[
    {
    "id": "biography_001",
    "tibetanTitle": "༄༅། །དཔལ་རིག་པ་འཛིན་པ་ཆེན་པོ་རྡོ་རྗེ་ཚེ་དབང་ནོར་བུའི་ཞབས་ཀྱི་རྣམ་པར་ཐར་བའི་ཆ་ཤས་བརྗོད་པ་ངོ་མཚར་དད་པའི་རོལ་མཚོ་ཞེས་བྱ་བ་བཞུཊ་སོ། །",
    "chineseTitle": "吉祥大持明多傑才旺諾布傳支分念誦稀有信心海",
    "author": ["阿克羅竹喇嘛 口述","米滂無死成就法幢 造"],
    "category": "傳紀",
    "tags": ["才旺諾布","傳紀","傳記"], 
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">此祈願文之中文內容...</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  },
  {
    "id": "biography_002",
    "tibetanTitle": "༄༅། །དཔལ་རིག་པ་འཛིན་པ་ཆེན་པོ་རྡོ་རྗེ་ཚེ་དབང་ནོར་བུའི་ཞབས་ཀྱི་རྣམ་པར་ཐར་བའི་ཆ་ཤས་བརྗོད་པ་ངོ་མཚར་དད་པའི་རོལ་མཚོ་ཞེས་བྱ་བ་བཞུཊ་སོ། །",
    "chineseTitle": "吉祥大持明多傑才旺諾布傳紀奇妙信心之海",
    "author": "米滂無死成就法幢",
    "category": "傳紀",
    "tags": ["才旺諾布","傳紀","傳記"], 
    "ContentTibetan": "<p class=\"tibetan-text\">此祈願文之藏文內容...</p>",
    "ContentChinese": "<p class=\"chinese-text\">第一章 提起前世及預言 仁珍千寶之降生<br>初、禮讚<br>禮敬尊貴的上師！無論何時何地，請慈悲接受我為弟子……。<br>本明不變離二執 壽命智慧皆自在<br>殊勝至尊如意寶 具德上師前敬禮<br>十方諸佛三密主 一切壇城轉輪尊<br>無上密乘善導師 鄔金蓮師勝利怙<br>佛陀為圓滿覺悟的天中天，具有五決定的莊嚴光芒，普照三世界，眾生以額首塗地虔誠禮敬。<br>佛法就如甘露雨，驅散人們猶如遭受火山烈燄煎熬苦般的心靈，藉由六十四種梵音，喚醒沉睡無明大夢的有情眾生。<br>僧伽為具足功德與離諸過患的聲聞、緣覺、羅漢及菩薩眾，為能拔除輪迴苦根的妙醫。<br>願殊勝的三寶，除卻六道輪迴之苦、導眾生入涅槃永不迷惑；最究竟的怙主，願如如意樹般的慈悲給予庇護。<br>具備十力的佛陀示現十二宏化聖地──南瞻部洲的中心，有具無量不可思議使命而遊梭戲舞者之一，如銀河系裡的智者大師黑行者、心部成就者吽生持明(八大持明之一)等，在我心湖裡蕩漾。<br>雪地中，佛法如白日之光普照，偉大大圓滿車乘，尤其是隆欽巴和卓貢等智者綻放之清淨光、究竟願力、無比慈悲、嚴謹戒律、賢能知識和璀璨炫爛成就，廣揚於如蓮般具信眾生的心。<br>我禮敬這些傳授金剛藏而享譽十方、直接和間接的怙主。以這種感恩及實現諾言的心，作者寫下此傳。<br>次、本文<br>這塊周圍為連塊大冰河圍繞的觀世音菩薩聖地，包含大、小西藏兩部份，稱為“吐蕃”或“雪域西藏”。大西藏分上、中及下三部分，噶陀金剛座的寺院座落在下部，為藏人所稱第二佛的蓮花生大士所加持。<br>離此往南，桑給省札山洞北邊，有三大高原，分別是邦布、馬爾康及擦甲山腰，此間，有一自然形成如度母姿態的岩石，一源自山谷、流注其間的河川，依度母的顏色，而取名為“綠河”，夾帶著金沙向北方展開。<br>不遠處，座落著連綿康區、被認為威神住地的札桑山上，有著名的“威神金剛岩”，為鄔金淨土的上師蓮花生大士庇護處與十三種伏藏法的伏藏處。<br>此地附近有一如五股金剛杵的高山，環繞著數以百計的泉水及據說共計一百零八樹種，如德瓦答樹、娑羅雙樹、那薩拉樹、阿西塔樹、沉香樹等自然形成森林。<br>另有一排白色與紅色岩石、峽谷及雨傘狀之婆羅雙樹縱橫其間，甚是優美。<br>林內含蓋幾乎所有的野生動物如老虎、熊、草豹、雪豹、狐狼，到處自由自在走動，也可找到老鷹、禿鷹、鸚鵡、鷗，還有猴子、土撥鼠等。<br>此地深賦啟發性，人類足跡難以橫越，如同蓮花生大士描述：“那裡的生物就如印度屍陀林內的生物般。”而根據一些取出的伏藏資料，此地的生物直如古印度鄔金淨土星宿海的生物。<br>離此往西北，其間有一如大鵬金翅鳥喙叼起蛇狀物的高山，名為大鵬金翅鳥山；另有一形狀如白色逆旋海螺的岩石，許多成就者在此名為唐卡日卓的僻靜山窪地禪修，偉大的導師誕生於此間的小茅屋裡。蓮花生大士曾預言：<br>墮落時代中期 衝突四處紛起<br>人們仇恨遄飛 長髮之子老鷹<br>出現雄山之旁<br>此參考資料，摘錄自早期喬伯上師與日那林巴上師的著作，尊者也說這預言同樣也適用於自己。另在仁增古定取出的《普巴金剛續》伏藏法中亦明言：“這預言將適用於許多人。”<br>尊者的父親貢波，深入各種修行，為虔誠的佛教徒；母親為多傑措，深信佛法僧三寶，經常持誦金剛薩埵真言。<br>母親懷孕時，父親曾夢見一黃金金剛杵從空中降下，融入自己體內，母親也曾夢見三個太陽照耀在萬里無雲的晴空，陽光灑落、融入體內，身心感到無上喜悅、輕鬆自在。<br>胎兒成熟，於時輪金剛曆土虎年（西元1698年）元月二十五空行母日，母親沒有感到任何痛苦，天空清澈無雲，響出“阿”、“杭”的聲音中，胎兒誕生了。<br>譯師毘盧遮那的轉世──伏藏大師貝瑪德欽林巴也住在此地，曾說道：“仁珍貝瑪諾布圓寂四、五年後，一位偉人將在此誕生。”<br>隨即認証剛出生的嬰兒為大成就者仁珍貝瑪諾布的轉世，取名才旺諾布，並給予小孩及其他人等長壽灌頂祈祝長壽。<br>第二章<br>一至十三小奇童 仁珍千寶示神通<br>更已授持三律儀 十六氣脈明點修<br>師貝瑪德欽圓寂<br>金龍年，西元1700年，尊者三歲，有位曾為尊者前世仁珍貝瑪諾布弟子的僧人，拿出上師生前擁有的一本阿彌陀佛法本時，男孩一看見，即說：“那是我的法本。”僧人感到很驚訝，淚水奪眶而出，將法本奉還。<br>尊者縱然還是位小孩，但已能入禪定般的唸誦咒語，取出隱藏於石頭內的伏藏法，同時說：“自己為蓮花生大士二十五位心子之一的南開寧波，住於洛札卡丘聖地”，能毫無疑惑地體認實相，親見神祕的無形眾生，如：見到一位頂戴花鬘的白皙童子以黃金寶瓶給予灌頂等。<br>然而，很多人懷疑：“此是否真為大成就者仁珍貝瑪諾布的轉世？”尊者在自己寫的許多著作中陳述了此事。但貝瑪諾布的外甥噶桑鄔金，無疑地確信尊者為貝瑪諾布的轉世。<br>水馬年，西元1702年，屆滿五歲，上師貝瑪德欽林巴教導尊者閱讀和寫作，都全盤吸收。<br>六歲，尊者和叔叔出去，回家途中，因遭人陷害而遇到很多困難，繞過很多陌生地，忍受各種饑寒熱苦。<br>七歲，得到上師的灌頂，但在諸多因素下，未能繼續跟隨上師。<br>尊者後來覺得，因修行時無人指導“不可時鬆、時緊”等要訣，很多成就的瑞相退轉。<br>八歲，親見可取出的伏藏法，由於缺乏適當的指導以致現象消失。<br>金虎年，西元1710年，十三歲，和藹的上師貝瑪德欽林巴，又開始傳予尊者有關大圓滿次第的法門，包括人身難得、壽命無常、輪迴諸苦、究竟解脫道、皈依三寶、發菩提心、供曼荼羅、金剛薩埵、上師瑜伽真言口訣及三根悉圓具的成就法。<br>最後，上師賜予尊者一杯茶後，又贈予銅製茶壺（表上師已將外內密教法完整的授予尊者。）由於加持力，禪修有相當的進展。<br>(16歲)年初，上師貝瑪德欽林巴圓寂後，尊者繼續修持上師瑜伽法以祈求上師，夢中上師示現傳法。<br>年終，尊者前世貝瑪諾布的外甥噶桑鄔金丹增，派遣一位財務官迎請尊者到睿智者貝瑪洛珠的寺院，獲得根本上師同意後，以天文曆算選擇一個吉祥日，開始這趟旅行。<br>一行人抵達藏塔區金沙河（長江）岸邊，乘皮筏橫越過河到達薩米，受到這位上師的親自迎接。<br>來自各階層人們認證尊者為前世大成就者的轉世後，被迎請到寺院的獅子法座上，在殊勝瑞兆下舉行坐床典禮，備受所有在場者極高的尊崇。由於對此場面尚且生疏，亦未建立法緣，尊者沒有站起來回禮。<br>在老師(親教師)陪伴下，尊者到將丘的鄉村──札林，接受長壽灌頂。後由此地出發，抵達贊日尼坦，從當年冬季到隔年夏、秋之交，一直住在那裡，經由上師的開示，法本內容如同原已記憶。<br>此年，尊者親見極多聖尊、夢中降服很多惡魔、看見許多非人眾生、清楚地看見很多隱伏的事物，尊者認為這是童年時雜念較少、慧脈較清淨的緣故。<br>後因留心寺院種種煩瑣雜事而分神，以上種種經驗如一塊木板因油脂過多漸成黑色般，致使先前修行的體驗漸漸消退，更因他人的妒忌、暗中破壞，處於不幸之境，然而外表看來，尊者仍被尊為導師、受到各種供養。<br>尊者在《掌中蓮花》的自傳中，如此描述：<br>七歲之年<br>珍貴導師德欽林巴<br>收為入室弟子<br>取名才旺諾布<br>三歲能言<br>七歲能問能答<br>尤其三歲時<br>空行母護法守護<br>奇蹟與預兆實現<br>眾皆可見<br>過去世的些許事件被喚醒<br>親見蓮師在虛空中<br>永遠的大師<br>能毫無困難述及<br>前世幾位老師的名字<br>眾皆如夢似幻 思及有時 吟誦著吽之歌<br>有時 傳法與灌頂<br>有時 廣行善業<br>有時 憶及過去的轉世<br>如夢中 頻頻憶起<br>有時 能解他人心思<br>有時 過去世的一些痕跡湧向我<br>五歲之年<br>前世的親戚們<br>帶來各類用器<br>考驗我<br>我都選對<br>然而 他們譏笑<br>不支持我<br>此年起 我學讀<br>學寫正楷和草寫<br>六歲 自我的根本上師<br>取得心要和<br>大圓滿的完整教授<br>也取得毗盧遮那之護法<br>及大黑天神的成就法<br>七歲之年<br>憶及忿怒蓮師之儀軌及事業<br>並視為本尊<br>我啟發正信的修持<br>降服了妖魔卻凸顯了傲慢<br>獲得一些共通<br>和不共通的成就<br>來自本尊的加持<br>通達萬物如幻般皆空<br>八歲之年<br>我閱讀伏藏大師桑傑林巴的傳承<br>觀音法門的導引《極密光網》<br>了解內涵<br>以此喚醒我<br>共同師及根本上師的三昧耶戒<br>需嚴謹持守<br>我對此致敬無遺<br>十歲之年<br>智慧稍開<br>到達學者處<br>提出佛法之問題<br>滅除很多人思維顛倒之言詞<br>他們都覺羞愧<br>今日我若憶及<br>一個惡業於焉造成<br>我自白 懺悔<br>十一歲之年<br>跟隨著如生命或心髓般的導師<br>得到明界《空行心要》之口訣<br>我全部吸收無餘<br>接受其他灌頂和傳授<br>了解萬法唯心<br>證悟一切虛幻無實<br>雖然 此生我無能力<br>但為過去生的本尊所加持<br>治伏星曜 夜叉 天龍<br>魔鬼和媽嫫等世間神祇<br>他們都供養心髓<br>十二歲之年<br>久美多傑的親近弟子<br>達帕桑波傳授<br>《密意集合經》、《幻網經》和<br>《吉祥祕密心經》的灌頂<br>此外 我接受全部伏藏法的<br>完整灌頂和口訣<br>此時 已脫離童稚作為<br>能安穩地坐著<br>全神貫注法教<br>無遺漏 也無被迫<br>十三歲之年<br>居於吉榮柔蘭僻靜處<br>於四月八日<br>得自在轉法輪的大成就者<br>勇士 貝瑪德欽林巴<br>授予所謂全部經續的精髓<br>基界本初的詮釋<br>究竟灌頂<br>生起次第的精要<br>方便法的要點<br>《俱生智慧的原理》<br>殊勝的真實戒<br>及勝義菩提心<br>一切三昧耶的總意<br>大圓滿和大手印<br>所有前行 正行 結行的課程<br>接受完整的灌頂<br>課程及課堂的進度與用語<br>迄於今 我未曾忘<br>如今 我傳法時<br>大都引述導師的話<br>當年的經驗<br>無任何可說的尊嚴和光榮<br>但無誤的認知動心 住心 和明心<br>已建立堅定的道基礎<br>日夜顯相[ 白天的禪定和晚間的光明瑜伽或睡夢光明融合一起，入定和出定無分別。]融合<br>全因大恩上師的慈悲<br>自八歲至今<br>我無先前的習氣<br>平常以清淨的信心<br>向這位尊貴的導師(貝瑪德欽林巴)<br>請教佛法<br>並將教法銘記於心<br>不讓它如傾瀉於鏡子上的水 流失盡罄<br>上師的一切行止<br>視之為教法和預兆<br>不再認為是尋常的舉動<br>我有一個深切的信念<br>為了三昧耶戒可犧牲自我<br>我具信無疑將<br>所有一切供養上師<br>對世事的厭惡<br>宛如毒蛇盤上雙腿間般<br>修持佛法之希願<br>猶如母親欲見獨子般<br>此時 若無與惡友交往<br>即可處於僻靜處<br>若持續地修持<br>就能繼承先賢古哲<br>緣於父母 侍從 弟子 朋友<br>心靈深陷世間八風<br>當自覺不幸時的年尾<br>仁珍貝瑪諾布<br>的弟子和外甥<br>名噶桑諾布<br>帶著家僕來迎接<br>到此寺院<br>這裡的僧侶待我<br>彷如一隻裸猴<br>同時經歷喜悅與不幸<br>對世間行徑的厭惡心<br>宛如一條溪流 從此流出<br>尊者才旺諾布以活潑的詩句，描述自己童年的經驗。<br>夏天時，尊者住在日札尼南，遇見老師噶陀甲薩喜南德贊，得到很多灌頂、口訣和加持。<br>秋天時，請求夏榮仁波切允准探望上師德欽林巴及到亦曲隆僻靜處。<br>十五歲，誓願遵守生活的十二戒律、致力大手印的禪修，證悟和體驗顯著增長。十二月初，根本上師──偉大的伏藏大師貝瑪德欽林巴圓寂，色身消融於法界，尊者忍不住哀傷，虔心讚頌、祈請，夢裏及禪定中，親得上師傳法及允諾照顧，直到尊者能自己發揮為止。這些都記載在尊者的著作裡。<br>尊者和兩位根本上師(伏藏大師)密不可分的轉世關係，《預言明鏡》中如此描述：<br>末法時期的四十年間<br>尤其至三十年之期<br>現今的毗盧遮那將誕生於岡村<br>父名貢波 母名桑<br>一位名釋迦的瑜伽士<br>於水猴年出生<br>褐膚色 英俊<br>有如勇士般的威儀<br>身上綴以<br>如蓮花鬘般的六種嚴飾<br>帶著悲憫心的貝瑪德欽林巴<br>能控制四大<br>融通脈 風 明點<br>將會精進苦行<br>被稱為敦都多傑<br>將斷除修持非法行<br>降服邪惡的勢力<br>將隱藏妙德<br>秉持信心<br>精進和智慧<br>他的行止多變<br>卻單純如稚子<br>自在地唱著密訣歌<br>厭倦世間非佛法<br>但將膽識置於法行上<br>以群女為侍從<br>他會建立瑜伽士的法教<br>生起 圓滿次第的修持<br>會圓滿成就<br>並具無限的智慧<br>將成為續佛慧命中的主柱<br>此具善緣者確定來臨<br>偉大伏藏大師的妙德如此被描述！<br>有關尊者和上師事業相同的預言之一，如伏藏大師阿里答哇堅參的預言，記載如下：<br>南開寧波的轉世<br>將出現於噶陀寺的南方<br>名為貝瑪 黑痣在左腋下<br>通曉極密母續部<br>倘若能取出《空行心要》法教<br>將發揚此深密法教<br>一切相關法教亦將被開啟<br>被視為南寧的轉世<br>亦名貝瑪<br>此時，尊者自己得到的預言內容為：<br>烏雲在北方戲舞<br>將被風吹往東北<br>聲音雖然不大 甜美而猛厲<br>此自北方強烈的聲音<br>將征服西北邊的地平線<br>最後衝突會由西邊和北邊散開<br>然將持續不久<br>將會閃出三次如將煙燼的火花<br>鐵匠將入眠 並覺醒三次<br>近天母湖的山前<br>許多騎士奔馳而至<br>他們將會奔馳 也會稍作停留<br>藏南區的上村落<br>凶酷之人偽藏躺下 將逕自暴露<br>藏中大昭寺將頻繁衝突爭論<br>紅山上的金色小尖塔<br>會被帶往北方或西方<br>東方帝國的吼聲<br>將有三次戰鬥並取勝<br>不久 西方的雪山上<br>烏雲的珠鬘會圍繞<br>烈雹摧毀西藏<br>部份於新年前將知<br>所言是否為真<br>三至七年即將揭曉<br>會有方法以避免<br>但無一能實行<br>據此預言，火雞年時，會有內部衝突，厄魯特蒙古國王拉桑將揮軍進入西藏，六世達賴喇嘛倉央嘉措，被以欺哄手段送往青海，總理第司桑傑嘉措在阿噶才遇刺，許多寧瑪巴的偉大上師遭受壓迫或殺害，甚至拉桑本人也為准噶爾蒙古軍殺害。<br>這些野蠻軍隊，對蒙古人及藏傳寧瑪巴的傷害，難以估計。此事件發生在七年間。<br>達賴喇嘛五世時，被密續大師降服而深埋地底的許多惡魔，在某些負面的影響下，為拉桑掘出、釋放而逃跑。<br>尊者有相同的夢境……目睹一群騎碳馬的人時，尊者問：“是誰？”回答：“工布惡魔。”尊者欲以器物降伏時，即化為一陣黑風向東方逃逸，醒來，只覺內心一陣苦悶……。而如此的預言真實發生了。<br>火猴年，西元1716年，十九歲，尊者考慮在達倉閉關修持忿怒蓮師法門，但在惡友的影響而作罷。<br>後來，在吉榮的柔蘭僻靜處，建了一間名為“忿怒三角界”的小禪房，在此密集修持明界《空行心要》上師瑜伽相應法。<br>然無法嚴謹地圓滿它，尊者在著作內詳述原因：“由於對跡象和覺受的期待、散心持誦、輕忽口訣等，缺失於焉產生，而無任何吉夢或吉兆。”<br>尊者後來認知，不論持誦咒語數目多寡，持咒的功德絕不虛假。<br>如此，跡象和覺受已無必要；若帶著傲慢心禪修、心神渙散的持咒，是絕對無法期待任何徵兆。尊者因此說：“在修持本尊法和持咒時，須要避免紛擾的思緒。”<br>此時，雖然僅粗淺的了解圓滿次第的修持，但已體認、承認已犯的錯誤，並最好持續修持此法。<br>修持期間，也因懈怠而內心升起懊惱，唱出很多悲歌。<br>尊者也常於夢中到伏藏法的埋藏地，因此知道許多伏藏法的埋藏地點和預言，然而卻未實現最好的修證。<br>為了已受的灌頂和法教，非為責難或諂媚，決意守持最基本的戒律，即使犧牲生命也在所不惜，即開始實修上師瑜伽的七句祈請文、蓮師心咒及六字真言的口訣，每日練習一次調息法，但不久後即改為幾天一次了。<br>第三章<br>年為二十至二一 和解地方紛爭事<br>親見普巴金剛尊 修成威猛事業法<br>火雞年，西元1717年，二十歲，尊者閉關實修普巴金剛(金剛童子)法時，親見本尊，並見來自地底的惡魔障礙已被剷除。尊者說：<br>本尊壇城如群星<br>加持力強而神奇<br>聚集慈悲和事業<br>驅除障礙賜成就<br>密主無衰金剛童子相<br>普巴金剛如日月<br>蓮師父母之本尊<br>驅除障礙賜加持<br>密主無衰金剛童子相<br>普巴金剛如日月<br>如此定中修本尊<br>天龍夜叉諸障礙<br>本尊加持即滅除<br>偶誦本尊咒力即如此<br>倘若長時禪修之<br>能得殊勝之成就<br>尊者如此唱著。<br>此時期，尊者居中調解洛薩和伯雜雙方人民多次的交戰，促成和平之路。<br>無論何時，尊者只要一有時間就作一星期的閉關修持，特別是空行母法的修持。自己也了知於適當的時候，將自然獲得聲望與財富。<br>有次，尊者如是說：“夢境裡，見到約手肘高的白色觀世音菩薩和忿怒蓮師。”親見自性中(即以意伏藏方式)取得《空行母口傳淨相密道》，並記錄在一張白紙上。<br>在此地，遇到前世於赤松德贊王時的書法家登巴才芒的轉世瑜伽士根桑仁欽，現世為一隱居的成就者，得到《熾慧忿怒蓮師》、《明界心要》等伏藏法的灌頂和口訣。<br>此外，亦得到大圓滿生起和圓滿次第等的傳統法教，就如寶瓶傾瀉般地將整個法脈傳授尊者，公認尊者為其心子。尊者自己也說這是他最慈悲的上師之一。<br>火狗年，西元1718年，二十一歲，尊者前往殊勝佛法的中心地──噶陀金剛座，遇見印度大成就者吽生持明轉世的噶陀派索南德贊大師。<br>藏曆九月二十二日如來降天日，尊者在其座下皈依三寶、受出家別解脫戒，法名索南特丘丹增帕桑珀。<br>由此尊貴的導師處，得到《明界金剛心》法完整詳盡的四灌頂和其他支脈如長壽法、無上觀音法、熾慧忿怒蓮師和其他許多法的灌頂和口訣後，兩者心意就如乾草碰上火花般的結合，尊者被視為最親近的心子之一，大師也是尊者最慈悲且重要的上師之一。<br>第四章<br>時年二二於定中 馬頭明王制魔群<br>火豬年，西元1719年，二十二歲，尊者在但瑞山右側方，名丹欽處，傳授給七位以上具信徒眾甚深法教。<br>有次，因密行來到辛古康拉，得到很多奇特的徵兆，夢見根本上師貝瑪德欽林巴在光圈中。<br>年尾，在達普瑞卡村僻靜處，傳法予百位以上群眾，在場者都深受感動，傳法極其成功，這是尊者生平首次帶領初次參與的徒眾進入宗教的殿堂，顯出極相互依賴的莊嚴徵兆。<br>尊者後來到了吉榮汀日，傳授拙火等甚深法教給貝瑪德欽的再傳弟子──貝瑪旺嘉，地妖惱怒，而在十二月的深冬裡，興起閃電和暴風雹。<br>禪定中，尊者襲擊女妖，令顯露原貌，承諾為尊者的侍從；天空現出前後端狹窄、中間寬廣如紡錘般奇特的河流；來自各方的雲彩，如車輪、寶石、蓮花和似舞者雙手展開交叉的金剛杵，尊者目睹這許多奇妙瑞相。<br>應貝瑪旺嘉的請法，尊者闡明《密慧法》的滿意懺悔及成就法。於禪修的定中，尊者親見成就者怛巴加噶傳予法教和莊嚴徵兆的加持，如鏡中影像般清晰地親見《妙法息苦道次第的密訣》，著作了此口傳法教的總意，標題為《水鏡藏》。<br>尊者前往建於水虎年的曼秋禪修中心，因外、內、密因緣的遷引，刮起了黑風暴，撼動整座大山，各方烏雲密佈，閃電和暴風雹如石頭和雷霹頃盆而降，布棚上滿佈閃電的映光，雲層中現出的許多可怕形影，空中迸出的駭人聲響，附近的人們極度恐懼、到處奔竄，尊者無絲毫恐慌，在修持黑馬頭明王的定中，這些騷動驟然歇止。<br>黎明時刻，尊者親見明王嘿嚕嘎和上師德欽林巴無二無別，得到自在駕御猛神生命的成就，修行定力增長，獲得強大的法力。<br>前往探望伏藏大師柔北多傑，因各種原因耽誤了行程一段時間，此時大師卻圓寂消融於法界中。幾天後的夢境裡，尊者親見大師並得到加持。<br>鐵鼠年，西元1720年，二十三歲，尊者到馬康村，面見在康區極負盛名、被視為印度大成就者夏哇里巴(獵鹿者)轉世的噶舉巴耳傳傳人蘇曼巴，本名噶瑪仁珍桑日嘉措，由他處，得到大手印和大圓滿精要的祈請文和口訣。<br>於此，也遇見了大學者大司徒確吉炯內，經由他的安排而拜會傑昌仁波切，得到大手印上師瑜伽的簡釋和廣釋、達波四法、五俱大手印的簡釋和廣釋，尤其是上樂金剛耳傳三如意寶之一《本性如意寶》、大手印共和不共法門。<br>關於這件事，尊者說道：“先前因意志消沉、心神紛亂，內心起了一些疑惑。此後體驗保持堅定而不動搖，心不再忐忑不安。”<br>這位上師所傳止觀雙運禪修法與上師德欽林巴所傳實無二無別。<br>尊者也得到金剛總持法的四灌頂、金剛手菩薩和印度女成就者瑪吉珠嘉的長壽灌頂、柔北多傑的伏藏成就法等。<br>又從大寶法王的導師日卡阿塞的轉世鄔金喇嘛，得到忿怒金剛手菩薩和新取出的獅面空行母伏藏法。<br>尊者返回吉榮住所，不少僧侶發燒、劇烈頭痛，自己也很虛弱，乃修持忿怒蓮師進入甚深禪定，一位穿僧袍凶猛的惡魔出現，尊者以金剛杵襲擊並插進他的體內，惡魔立即現原形、允諾服從命令。尊者問他：“是否可解除此病及病因？”惡魔回答：<br>哦 聽著 偉大的成就者<br>病因源自護法對你的不滿<br>尤其是<br>你與不潔妖女的曖昧及合修<br>空行母不悅<br>而顯現色身的病<br>此次你不會死<br>空行淨除障蔽法是最好的藥<br>又問道：<br>有人說<br>白哈爾護法已經成佛<br>是否為真<br>白哈爾護法<br>住在桑耶寺 面朝鄔金聖地<br>怎會自己成佛呢<br>約三十年[ 此處所指為羅剎國的三十年，羅剎國一年等於現代三年，故即九十年後。桑耶寺也確於西元 一八一六年火鼠年六月遭火噬，此為藏地重要的預言之一。]<br>或三百年後<br>當桑耶寺為火摧殘時<br>白哈爾護法<br>會歸返蓮師淨土<br>他如是說。<br>尊者又問一些問題後，強有力的唸了“呸”字，惡魔逃向東方消失。此後一段期間，此地的很多精靈都效忠尊者，此事詳述在尊者密傳中。<br>第五章<br>時年二四禪定中 親見恩師隆欽巴<br>直授大圓滿口訣 咒力誅殺蠻橫盜<br>迫害民眾寺院僧 神識渡往極樂國<br>鐵牛年，西元1721年，二十四歲，尊者到如星宿海花園般優美的尊欽，給予七十多位持守清淨梵行的僧侶大圓滿灌頂，包括丘揚帕當喇嘛。<br>其時，尊者也親見殊勝的法王龍欽饒降，授予心要的甚深法教，法王說：“所有法教本質本無任何區別，但你有分擔法教的責任，而大圓滿空行母心要法門最適合你。”將四部心要的法本置於尊者頭頂而傳法，又傳予一篇祈請文後，對尊者說：“要以大圓滿法教來利益眾生。”<br>另一位隱藏暴風雨中的密主護法[ 為紅派三不共護法之一的一髻佛母。]也對尊者說：“喔！善男子！弘揚大圓滿的正法吧！你的任務和事業，我會幫忙圓成。”說完，即從夢中醒來。<br>火雞年，野蠻的准噶爾蒙古軍掀起戰火，壓迫及殘酷地殺害了許多寧瑪派的大喇嘛們，成就者久美仁欽南嘉和弟弟貝瑪桑波在康區尋求庇護，尊者與他們會面，而得到久美仁欽南嘉授予根穹林巴的金剛薩埵心要和其他許多法教，得到貝瑪桑波傳予敏珠林寺日修祈請文的口訣。<br>亦自貝瑪旺嘉、噶陀仲巴南卡嘉措、耶喜久美和伏藏大師貝瑪丘傑等，得到多種不同的教授。<br>年終，尊者住在吉榮的色倉僻靜處時，強盜集團殺害僧侶、民眾，搶劫寺廟財物，尊者開啟一髻佛母、瑪哈嘎啦等護法壇城，修持一個月的法，先以誅法誅殺有記名強盜七十多、無記名一萬多，再以超渡法將其神識渡往極樂國，摧毀邪惡的力量。<br>第六章<br>二五噶陀總寺恭迎請 為設黃金寶座封教主<br>水虎年，西元1722年，二十五歲，尊者前往強伯莫聖地成就了紅金剛亥母法的修持，親見亥母和一些莊嚴徵兆。<br>又前往噶陀金剛座，聆聽嘉喜索南德贊仁波切各種甚深法教的傳授，仁波切為尊者舉行了坐床典禮，封為噶陀派黃金寶座的持有者。<br>此時期，也得到來自波密縣伏藏師成律多傑傳予的兩種伏藏法，尊者認證他為該寺的一位轉世，為他寫了長壽祈請文。<br>尊者臨離之際，嘉喜索南德贊仁波切極其依依難捨，不禁淚水盈眶，握住尊者的手，如似交付遺囑般，請尊者維繫法教、照料噶陀派的法務。尊者離開前往賽寺。<br>水兔年，西元1723年，二十六歲，上師德欽林巴安放在舍利塔內的法體預定火化，原定貝瑪旺嘉為主法阿闍黎，然在眾多因素下，改由尊者為主法上師。<br>火化時，顯現的各種奇妙徵兆和跡象令人匪夷所思，與會者都產生極大的信心。<br>噶陀教主嘉喜索南德贊圓寂後，尊者主持了追思告別式及轉世祈請法會，夢境裡親見教主升往西方，並請尊者協助消除菩薩道的障礙。<br>某夜，又夢見教主將誕生於秀夏的一所古老寺院，就在“忿怒法源”地[ 忿怒為四種事業中之誅業。法源分為內、外、密三種。外為場所、內指身體、密為法界、本尊、空行之壇城。]安置一座壇城，尊者入定，在各種奇妙的徵兆中，親見邪惡的力量從此被根除。<br>年尾，下決心參訪藏地所有佛法的出處西藏中部，便去探望仁珍貝瑪瑪尼的侄子、也是弟子、達拉寺的住持噶桑鄔金丹增，表達了參訪遙遠之地中藏的意願，尋求允許卻未被同意。<br>一再請求後，得到首肯，同時獲得住持大師傳予甲村寧波伏藏法寂靜蓮師的灌頂和教授。在清淨的定中，尊者親見上師頭頂前方有朵白雲，上有彩虹、花鬘，間有朵多瓣白蓮花的座上，成就者隆薩寧波咒士相、頂上纏縛頭巾、禪定坐姿，無數空行母圍繞供養、禮拜，由此景象，尊者對這位住持上師生起極大信心。<br>另外，尊者也得到敦珠傳承金剛手菩薩和諸佛總集的長壽灌頂，聽聞喜波林巴伏藏法的口訣、彩雷智者貝瑪勒珠的法集及大成就者日卡阿塞所寫僻靜處禪修山法等。<br>其後，在尊者向上師致敬告別時，也向上師、僧侶和居士們提出建議和忠告：“為了眼前及永恆的利益，必須胸懷大愛和大悲。”<br>經由瑞卡村，抵達貢覺，尊者從鄔金南卓桑波上師座下，得到上師意集的灌頂和口訣、遠傳寂忿百尊的灌頂、意自解脫寂靜和忿怒尊的完整灌頂、律齋渣所取空行心要的法教，並被賜名為法界自解脫；另外，也得到寂忿大黑天護法的灌頂，聽聞了時輪金剛六加行及一座成就法的開示。<br>木龍年，西元1724年，二十七歲，尊者抵達下馬康區。根據尊者的記載：“自己從根本上師噶瑪仁珍桑日嘉措處，得到基道果的入門法教、仁珍柔北多傑密慧心要伏藏法、達波傳承化身修持法、噶當和大手印融合之法、噶瑪林巴的完整法教等。”由此而被認為此根本上師的主要弟子。<br>上師噶瑪仁珍桑日嘉措當時也說：“由於過去生智慧的修學，你的修行已可以了。從現在開始，你單獨住在僻靜處或者傳法利益他人。”如此的賜予權能。尊者頂禮時，上師給予讚誦、鼓勵和吉祥的祝禱。 <br>又從鄔金倫珠上師處，得到日那林巴所有法教，尊者也同時傳授他完整大圓滿空行心要的入門、灌頂和口訣。尊者在旅行記事中曾載：“初次外出旅遊收受的首位弟子，就是這位上師，這是個好預兆。”<br>前往參訪大成就者柔北多傑取出伏藏法的凱榮聖地時，遇見米傑多傑的轉世吉美努當。<br>路經噶瑪仁欽寺院，抵達瑞波切，遇到達隆唐巴(達隆噶舉祖師)的最後後裔札西南嘉，尊者傳予蓮師、八位郭瑞空行母上師瑜伽法及貝瑪林巴威尊等的灌頂。<br>某寺住持阿旺札巴丹北對尊者非常敬佩，也從尊者處得到一些法教。<br>最後抵達西康帕區的朗瑪隆蓮花生大士聖地，參拜東丘寺。<br>在波密縣時，尊者曾從努當敦都多傑的子孫仁珍南嘉得到完整的敦都多傑伏藏法。<br>之後前往耶貢，值逢冬天，沿途河水和山路都已結冰。抵達時，發現此地人民正處於內政衝突下，即前往一座被視為俱誓金剛護法住處──根隆中間隘口附近的蓮師聖地──東榮岩窠穴，獨自閉關禪修大悲觀世音菩薩成就法。依據尊者的文章描述，有很多吉祥的預兆。<br>在康區，正逢中藏首都拉薩的政府官員快速更替直如夏季河川氾濫的洪水般，許多佛法的大導師都如蓮花生大士無誤的預測，遭遇野蠻准噶爾蒙古軍的襲擊而圓寂，如敏珠林成就者達瑪師利和侄子共三人、金剛總持貝瑪成律，另有八位成就無庸置疑的伏藏大師：達香努當多傑、南丘米傑多傑、貝瑪德欽林巴、鄔金特達林巴、仁珍柔北多傑、丘傑林巴、德貝多傑、嘉喜索南德贊，一些知名和不知名的成就者等，令人不忍耳聞。<br>這些事件的發生，根由末法時期眾生少乏福報，尊者唱出許多感傷的歌哀悼這些成就者。<br>尊者帶著弟子們朝拜波密縣近工布的札噶貝瑪謝普聖穴時，應曼貢寺住持的邀請前往此寺，授與約千位僧侶和居士們八大嘿嚕嘎續的灌頂和口訣，並傳給他們祈求的任何法教。<br>尊者倡導禁止殺害野生動物、給予一切有情和平安樂的生活，“所有看到尊者身相、聽到尊者法語、憶及尊者功德的人們，將得到暫時和永久的安樂。”<br>參訪很多如同薩隅的村落，滿足人們的期望後，返回札噶。如此唱誦聖地的功德：<br>我去到奇妙之地 將普<br>看見許多共和不共同的跡象<br>山形彷彿張開的手指<br>五湖的守護者是惡魔 威神<br>天龍和聞名的喬莫燦光空行<br>那兒有蓮花生大士的五大洞穴<br>八小洞穴和十六塊岩窠之間<br>稱名十萬空行帳棚<br>圓形 五層樓高<br>宛如九乘護法相<br>任何見及 聞及 憶及者<br>生起大樂<br>前方有如綠松石色的小湖<br>喝了水 累劫的罪惡即淨除<br>東北方 有座三角形的小湖和<br>如紅食子般的岩石<br>是怙主護法的住處<br>也是十萬空行母的居處<br>任何人繞湖禮拜七百次<br>等同背誦六字真言一億遍<br>雖然不能獲得解脫<br>但確定一世也不會墮入惡趣<br>此前方 一方形石塊上<br>可發現惡魔屍首的痕跡<br>任何人躺下一會兒<br>可去除障礙<br>南方會出現“啥”和“傍”的字<br>這是伏藏法的記號<br>西方有蓮師和隨從的身形等<br>第七章<br>二八往朝西藏地 途經波蜜立寺院<br>往見八世夏瑪巴 十二世大寶法王<br>傳予他等噶舉法<br>木蛇年，西元1725年，二十八歲，尊者在將普岡日爾密行時，親見上師、本尊和空行母給予加持，依此寫下題為《色蘊薈供》的法本。特別是尊者在佛陀成道日修持意成就法時，親見蓮花生大士。<br>夏季，應波密縣人民的請求及因緣具足下，在兩地各建一座寺院及開啟普巴金剛壇城，人們如夏季的雲朵般雲湧而至，尊者給予長壽及極樂世界成就法灌頂、菩提心、百字明、六字真言、蓮師心咒和蓮師七章祈請文等傳授，明言禁止獵殺野生動物，令很多人立誓杜絕殺生行為。<br>尊者離開前往環境優雅、莊嚴的朗普僻靜處，寫了一篇大乘祈願文《如意寶》。工布札桑列里寺的轉世成律揚札父子來拜見，應所祈給予灌頂。<br>欲往工布附近的聖地朝聖，然於某種因緣下未成行。<br>經由介於工布北方和歐卡間的札拉山路，尊者抵達了唐沙圖、安秀的普賢森林，朝訪成就者帕莫竹巴的法相和茅築禪房。<br>又到才唐，參拜金洲佛像、昌珠寺的彌勒佛堂、詹唐和崩巴長壽泉、雅魯晶岩洞等。<br>在昌珠寺時，應瑜伽母耶喜薩卓請求，著作了金剛薩埵外、內、密瑜伽修持法，取名《深明心髓》。<br>前往參拜西藏著名的第二金剛座──桑耶寺時，在寺內的三層頂尖、四大洲殿、八小洲殿，作了豐盛的供養、虔誠祈願和迴向。參訪東邊文殊師利主寺時，又因瑜伽母耶喜薩卓請求，寫了名為《口訣道歌》的修持教言。另也參訪了桑耶寺附近的清普寺。<br>由此地越過古卡拉山路，尊者前往西藏最大文化和宗教中心──拉薩，參拜及供養大、小昭寺內供奉的釋迦牟尼佛、五尊五具[ 指五位天然形成一體的觀音像，傳說大昭寺的十一面千手千眼觀世音不經人造、為天然積聚而成，此像內裝有一尊由驅蛇心旃檀樹中天生的觀音像。其後松贊干布王、文成公主、尼泊爾公主往生後的靈魂都沒入其中，這樣五種成就的事物自然共聚一體而名之。]自成的觀世音菩薩像，由衷地虔誠禱祝、唸誦梵文祈願文。<br>離開拉薩，前往多隆楚普寺，拜訪被視為彌勒佛後賢劫千佛第六佛、也是觀世音菩薩化身的十二世大寶法王絳曲多傑及無量光佛的化現紅帽冠夏瑪巴秋吉敦都，得到大手印的法教。<br>不久，黑帽冠和紅帽冠兩位上師在前往中國的札西車勾寺期間，同時圓寂。 <br>第八章<br>二九親見朱倭仲巴時 得大手印大圓滿口訣<br>朝往覺囊寺及尼泊爾<br>火馬年，西元1726年，二十九歲，尊者到達藏區的達那寺，拜見寂命(寂護)菩薩的轉世朱倭仁波切四世──揚卻丘吉旺波，得到大手印和大圓滿的灌頂、《普賢意集》的頓超導引、寧瑪派舊譯續的口訣等，經過仁波切的部份詮釋後，內心的疑惑頓時煙消雲散，證悟達百倍之多，尊者因此視仁波切為第三位根本上師。<br>因前世的因緣，尊者對覺囊傳承特別具信。某次，在對一位僧侶感到非常生氣的機緣裡，禪定工夫頓然進展，根本和後得界相融合，達無分別之境。<br>後來在朱倭仁波切指示下，著作八篇續部歷史、一篇朱倭仁波切長壽祈請文，最終師徒心意合一，仁波切非常歡喜讚誦，並為尊者寫了長壽祈請文。<br>離開後，尊者前往蓮花生大士聖地薩布隆洞穴，圓滿智慧空行母的唸咒修持法。給予從附近聚集而來的群眾《桑傑林巴上師意集心要》灌頂時，護法真實現前向尊者禮敬致意。<br>之後，前往參訪第三世大寶法王讓炯多傑創立的薩布隆寺分院；再到查隆寺附近，朝拜西藏十二位地母神之一居住的聖地。<br>此年，尊者由嘉敦阿旺多傑上師得到香巴噶舉傳承的重要口傳《妮谷空行母六法》；由貢波帕導師得到覺囊傳承《妮谷空行母六法》的灌頂、口訣和導引後，作了一個奇妙的夢而寫下一篇傳承祈請文。<br>覺囊派大師多羅那塔建立的達丹當丘林寺，現已成為格魯巴寺院，改名甘單彭措林，此為西藏的香巴拉國。尊者參訪此寺和覺囊僻靜處後，經過拉才北方，到達魯拉哲蚌寺（已成為其他傳承的寺院，改名噶當卡丘。）希望得到偉大成就者根桑旺波傳予覺囊的所有法教，等了三天，連上師面都沒見到，體認這位導師的謙虛，由衷生出極高敬仰。<br>尊者抵達定日南方的拉多後，經過聶拉木縣，到達尼泊爾，恭敬的禮拜了閂布(蘇瓦揚布)自然而成的佛塔，寫了篇題為《浴淨過患之澡堂》的祈請文；同時參訪菩提(波達)大塔、蓮花生大士聖地楊列雪和其他許多聖地，供養並祈願。<br>此為尊者第一次到尼泊爾，正值尼泊爾王子往生。尼泊爾王請來很多印度教和佛教的修行者，宣稱：“何者能以非世間火來火化王子的遺體，將奉為國師。”<br>尊者聲言：“能做到！但圓滿後，君臣須答應一件事。”君臣應允，尊者由五指發出五色火光，火化王子遺體。<br>國王詢問：“應做何事？”尊者說：“現今存在的惡習──男眾往生，女眾陪葬，與佛教的理論相違，應廢除。”<br>國王說：“此為流傳已久的民俗，也是印度教所定規矩，雖然我已答應你的條件，仍要和大臣們商議。”<br>尊者說：“剛才印度教國師和臣子都已答應，現在要再與誰商議？”國王說：“確是如此，但要如何實施？仍須討論。”<br>尊者說：“無須特別制定法律，國王既已應允我為國師，而我為佛教徒，因此以佛教的戒律來實行即可。”雖有人不滿，但畏懼尊者的法力，只好接受，長久陪葬制度於焉廢除。<br>第九章<br>三十天竺女神為佛母 甘露洞穴祕密修密行<br>火羊年，西元1727年，三十歲，尊者到了馬友文殊師利菩薩續部裡曾預言過的吉隆，看見以檀香木雕刻得極為自然、五尊之一的手持蓮花、名為滿願觀音菩薩像。<br>後又來到蓮花生大士聖地，也是《華嚴經》上預言的龍女崗──帕巴山，住在聞名的“噶陀山洞”內，修持上師瑜伽的第三灌頂，具善緣的居士才仁敦丹非常恭敬地護持尊者閉關的生活所需，天竺女護法神為佛母一起合修，實現密行中，禪修的境界進展良多。<br>前往參訪拉得途中，由將良巴羅珠穹佩處，得到瑪帝上師的大手印和六加行的伏藏法、巴拉巴傳承密傳法教的開示、成就者甘地巴傳承五次第教授及加持。夢境中，空行母告知：“這位上師確為印度大成就者甘巴拉巴之一的轉世。”尊者感到非常欣慰。又從瑪帝上師的弟子巴拉巴阿旺耶喜，得到揚貢巴傳承的山法和不動忿怒尊成就法。<br>前往拉得上方的岡惹莫冰河，尊者作了上百次空行母薈供。參觀帕當巴曾預測、也是蓮師的聖地阿蘇拉岩塊的石洞；參訪了三世大寶法王讓炯多傑的誕生地──帕當巴的普卡洞穴。<br>後又來到座落冰河前方、形如一面突出的勝幢旗幟、被視為天神善居士如來之地、以“阿唐岡莫切”聞名的“百泉聖地”，唱了一首道歌，傳授灌頂、口訣和入門法教予當地虔誠的皈依者，如續部大師嘉喜桑給和其子、贊林巴喇嘛父子、特本喇嘛、絳真格傑的兄弟們、甲和揚兩位官員，圓滿他們的期望。<br>又受邀到札普丘林寺，傳授巴拉巴《大圓滿空行心要》灌頂、口訣和開示，特別傳予《空行密道》和耳傳法門。<br>尊者住在歐波村的末端，絳真格傑寺附近聖地蓮花生大士成就洞時，絳真格傑寺護法女神──七位天母，以身命供養尊者，十四天一起密行修持，隨侍在側。<br>某日黎明時，具善金剛母著黑衣、長髮直落腳跟出現，給予尊者很多過去、未來的預言，全部筆錄下來。<br>尊者後來傳此法予色桑日巴久美隆卓之子、仁珍幽陌巴的轉世──色桑祖古，又傳授大圓滿心要和阿底瑜伽灌頂、開示和入門法教給絳真格傑寺的伏藏大師寧瑪桑給。<br>應一些來自孟古那夏人們的款待和請求，寫下一首題為《本理金剛歌》的道歌。<br>參訪大成就者密勒日巴曾閉關過的六宮和三洞之一的江潘天宮。到林札卡時，許多授記自然地由心底湧現而唱出八首憶念上師的道歌。<br>朝拜貢唐寺的聖物時，尊者住在拉雷密勒日巴尊者和重要弟子日瓊多傑札西相遇的聖地──佐沃洞穴，應兩位軍官和百姓請求而傳法。弟子色桑祖古來拜見，尊者又傳予《明界心要》灌頂等，並為他取了法名。<br>參訪蓮花生大士埋藏很多伏藏法的噶波拉汀和仁欽同的岩石後，抵達努日采巴噶舉始祖尊珠札巴的弟子拉日尼達奧創建的達噶寺，拜訪住持薩索丘北（大成就者蔣揚丹增的法子），接受珀東派俱生大手印和時輪金剛灌頂、口訣和開示。<br>此為尊者首次得到時輪金剛的無上灌頂，很多莊嚴的預兆發生，定中親見學者兼成就者揚健噶巴於虛空中加持；另外，也得到不少瑜伽士祕密地傳授一些稀有的開示和口訣。<br>尊者傳授噶瑪嘎旺敦都（為丘柔路嘉參和薩普的嘉旺桑給的轉世）丹寧林巴大圓滿法門的導引；給予伏藏大師噶旺多傑的轉世噶旺祖古、瑜伽士德欽楚喜、拉當喇嘛等許多幸運者灌頂；傳授口傳[ 傳法時，上師念誦、弟子聽聞。]法教、耳傳[ 包含口傳和秘訣的教授。]密道給成就者貝瑪旺都，並賜名德欽旺秋。以上皆顯示尊者在瑜伽道上的圓滿成功。<br>第十章<br>時年三一至三八 藏王王后拜為師<br>尼泊爾佛塔開光 身佩骨飾修密行<br>覺囊轉世被認定 接受覺囊全法集<br>土猴年，西元1728年，三十一歲，尊者接到西藏總理頗羅鼐索南多傑的來信，邀請到尼泊爾莊嚴的菩提(波達)大塔前修法。<br>兩位來自上吉隆加查巴和揚仲巴家族的人護持幫忙搬運行李。途中，在札卡達索山前的隆達，傳法予瑜伽士惹欽噶瑪丘北的轉世噶瑪丘當，並送他一首密勒日巴成就地的讚頌歌〈白岩聖山讚〉。<br>(再次)抵達尼泊爾後，在菩提(波達)大塔前散花、供養及祈願；前往百座凶險的山修法時，尊者現出禁行瑜伽士像，穿著忿怒飲血尊服──虎皮下袍、人皮及象皮上衣、戴著骨飾等；住於菩提(波達)大塔附近時，得到授記：“距離菩提大塔五百噚的任運集屍陀林，有一蓮花生大士的足跡。”不久即找到此地。尊者在夢境中見到許多惡魔對其恭命敬禮。<br>應總理頗羅鼐妻邀請，尊者回到吉隆，住在上朗確的江康，給予她很多灌頂和法教。參訪滿願觀音後，又前往帕巴山的甘露洞穴，深入不可思議、遍滿虛空的空性禪定中。<br>在此，尊者作了數次《空行母食子滿意供養》，以懺除累劫的罪業、祈求佛法長住和眾生具福安樂；特別是為了全西藏人民的福祇，在偉大虔誠阿里國王興建的札西邦巴寺，開啟本尊普巴金剛壇城，修持誅殺法──投擲食子以驅除惡魔及《四洲空行靈器幻化法》。<br>色桑的轉世休強多傑來此，師徒一起住在僻靜處一個月，尊者授其自己的口傳伏藏法、金剛薩埵法門的開示、阿底峽傳承的度母法門、居士戒、其他許多灌頂和開示，在持誦吉祥祈請文下賜予他寶座。<br>應巴拉寺轉世祖古請求，尊者以一天半時間寫下自傳《掌中蓮花》；在寺院住持札西敦珠請求下，寫了一篇女護法神天竺仙女的滿意供養文。<br>根據空行母預言，前世的瑜伽士幽陌巴丹增諾布應取出一伏藏法，但因緣未具足而無法取出，尊者為幫忙現世的轉世順利取出伏藏法而至此，惜亦未成。<br>尊者前往中藏區，途經丘卡時，傳授空行母法門給予洛桑丘札阿闍黎；經過卡拉榮貢，住在偉大學者吉美札巴的寺院巴默丘汀幾天，給予南卡巴桑軍官、隨從、僧侶和居士們大圓滿的灌頂和開示。<br>到那南借住幾天，軍官的傳令員丹增才讓等人前來請法，傳予祈願文並給予一幅普巴金剛唐卡。尊者此時亦在仁珍尼達隆薩的轉世噶旺成律南嘉座下獲得噶旺多傑寧波的伏藏法。<br>後又前往密勒日巴聖地拉西秋巴朝聖，由於聖地的加持力，領悟力猛然增長，當地噉肉空行母神變試探，都被尊者以大手印降伏、未能傷害。<br>抵達定日，尊者參訪大成就者帕當巴聖地與紀念塔。在朗闊屍陀林作密行時，在附近的石頭上留下四指手印痕跡，至今仍然可見。<br>在加吉師利的羅班寺，尊者從涅揚後裔續部大師貝瑪旺札處，得到咕嚕丘旺取藏的大圓滿伏藏法、《樂空大海》甚深道口訣和開示，尊者也相對的傳予他大圓滿立斷、頓超和其他法教。又為此寺設立基金，護持德欽林巴傳規的寂忿尊法會。<br>在參拜加吉師利紀念塔時，於四方各圓滿的作了一次薈供。<br>到拉多南方以“宗普聖地”聞名的札索宮，從嚷如日巴的直傳弟子建揚成律噶巴處接受了“帕”及“夏”傳承的大威德金剛、馬頭明王、密集金剛、大成就者美智巴和帕當巴傳承的上樂金剛灌頂等，很多久札楊建噶巴傳下的法門；也得到帕當巴的醫學、中藏竹巴噶舉傳承大手印、六加行、《平等一味》、緣起、上師瑜伽遷識法等開示、灌頂和口訣。<br>之後，尊者修持五遍七曼荼羅供，以為感恩。又應宗普寺上師和弟子們請求，傳予北方伏藏法普巴金剛的灌頂。<br>隨學覺囊教主根桑旺波座下，遍學覺囊諸教法，認證薩桑瑪底班禪轉世尊。<br>尊者後來經由拉阿拉山路，到達魯拉哲蚌寺的僻靜處，與覺囊派教主根桑旺波大師同住三個多月，受教於大師座下，修習佛陀三轉法輪所說經部最究竟之法──演釋如來藏性真理的殊勝“他空中觀”學，得到最上無二《時輪金剛續十一部灌頂》、六次金剛阿闍黎灌頂、金剛瑜伽六支加行和圓滿次第的詳解、二次第導引的口傳及講解、一些傳統和一百零八門大解的口訣等，這些法門均為根噶卓秋大師根據西藏所有傳承的深睿法教，中肯、不偏倚地蒐集彙整而出。<br>尊者也由大師處接受學者兼成就者多波巴謝拉嘉參和多羅那塔傳承的口訣、仁欽允那成就法完整的大小灌頂、成就者卓北嘉莫的長壽法灌頂等，師徒最後心意合一。<br>尊者以最上的供品作了三次曼荼羅供感恩上師，第一次作了七遍七曼荼羅供，最後兩次作了各五遍七曼荼羅供。<br>期間，教主根桑旺波認證尊者為覺囊派偉大導師薩桑洛卓嘉參(薩桑瑪底班禪)的轉世，尊者曾如是說：“憶起自己曾為定吉王子蔣揚耶喜嘉措的轉世。這些應該都是自己對覺囊傳承有極大敬仰及信心的原因。”<br>此時，尊者毫無倦怠和不可思議地立即領悟覺囊傳承所有共及不共通的法教，期待已久的願望從此實現，滿足了內心欲望的寶瓶。<br>之後，參訪了七世紀虔誠的藏王松贊干布建於西藏的羅拉章巴蔣寺及附近的魯弄、塔敦和楊敦促等佛寺，到此間蓮師埋藏很多伏藏法聖地的洞穴禪修。<br>土雞年，西元1729年，三十二歲，正值佛陀在印度莊嚴的舍婆提城化現無數神變的紀念日，尊者特別給予雲集的群眾灌頂和法教。<br>為佛法故，獨自前往索隆等地，受地方軍官諾布巴久和其兄洛桑札西邀請到色卡區的孟卡宗，應緣給予灌頂和法教；應空行母根桑成律旺嫫請求，寫下一首教言的詩。<br>尊者後來前往參訪，位於帕瑞布切山區北方拉多大成就者唐東嘉波聖地及紀念塔。<br>康龍巴貝瑪仁珍旺嘉大師讚歎、並宣告尊者為延續大圓滿傳承的聖者。<br>為法故，不畏路途險惡，以堅決的勇氣突破困境抵達利隆，參訪成就者達恰日仁欽桑波的轉世康龍巴貝瑪仁珍旺嘉居住的東珠林寺，得到極密光明金剛乘的精髓教法和証得無死虹光身印度學者《比馬拉米札（無垢友）心要》的圓滿灌頂、一百九十個法門的口訣和殊勝四法，亦得到噶瑪心要北方伏藏《意成就法》的《惜護燈心要》口訣、聽聞了經部教示等。<br>康龍巴貝瑪仁珍旺嘉大師對尊者特別讚歎，並宣告尊者為延續大圓滿傳承的聖者，由於上師的加持，師徒二人心意合一，就如經部和續部內均提及“上師為快樂和一切成就的根源。”<br>時輪金剛內有云：“師為一切功德海，若以淨信心愉悅，共與不共二成就，即生當中能獲得。“<br>如一方遊僧般的尊者，從出發經康區的上波密縣等地至今，得到許多尊貴上師的法教，每以最上、清淨的財物禮拜供養上師。<br>又如經上所說：“對上師的財富無貪求心，對同修道友無嫉恨心。”也不接受任何回饋等。單就這些，已為他人難效尤。<br>色桑的轉世、偉大康龍巴轉世的弟子桑阿丹增、貝瑪丘汀寺的祕書多瑪爾仁珍貝瑪多傑及寺院所有喇嘛們、續部修持者索隆的南加巴窩、札那的噶瑪達奧多傑、沙卡的軍官諾諾、普蘭的首領南卡帕桑及其他許多僧侶和居士們等，都來探訪尊者並請法，如願得聞法要。<br>尊者後來到雄偉的努寺住了好幾天，指示寺裡的僧眾不間斷修持大黑天護法。後來由色桑祖古作陪，前往阿里宗卡，途中，固定地傳法予有緣者。<br>林阿札僻靜處維護不良，尊者指示色桑祖古照料，花了好幾年時間才整修完工，給予中心的僧眾和附近百姓們公開灌頂後，離開前往努日（西山），在偉大的丘旺嘉參居住地藏岡波切，遇見丘桑喇嘛，得到近傳北方伏藏大師噶旺多傑寧波的普巴金剛灌頂和其它法教，尊者亦相對的傳授予大圓滿的甚深教法；又應達噶寺首席喇嘛和侄子邀請，給予灌頂和傳法，均圓滿所願。<br>尊者後來從嘉旺桑給的直傳弟子釋迦桑給，得到由大成就者藏寧嘿嚕嘎傳下的惹瓊巴耳傳新譯上樂金剛灌頂，得到《三種珍寶》、伏藏大師丹寧林巴大圓滿《智慧視解脫》的完整灌頂、口訣和開示。此期間，尊者著作了上師瑜伽修持法《蓮花鬘》和很多的口訣。附近的僧眾和百姓們恭敬地頂禮尊者蓮足，尊者都給予各自所祈的相應法門。<br>經過揚唐，前往西藏西部的阿里珞隅區，抵達《喜金剛續》預言過、佛教和印度教徒視為聖地、當地人們稱為木塔噶塔或丘米加擦的百泉聖地，到處可見如雲集般的空行母、燃燒於水和石頭上的火燄，在此住了好幾天，竭誠所能地作薈供。<br>後來受到阿貢丹增國王、王后及部長邀請，前往上珞區的孟唐，傳《明界馬頭明王》、《金剛手菩薩》、《大鵬金翅鳥》和敦都巴大師的《蓮師熾光》、《大圓滿空行心要》灌頂、口訣和法教給他們。<br>之前，尊者亦曾應芒隅首領措吉朋措邀請，傳授完整的空行心要；應國王和隅珞部長們邀請，寫下《金唸珠》祈請文；傳授四字大手印給孟唐寺住持根噶朋措等，為他們寫下一篇傳承上師祈請文。<br>尊者在給卡、桑普和藏札寺住了數月，為圓滿不同皈依者的祈願而給予灌頂等；傳法於下珞區，參訪了道波的宗教聖地。<br>再次參訪百泉聖地時，受到札宗高階軍官以女兒供養的極高禮敬，為他們傳法時，多位善女子剃度為僧。<br>此時，位處高原的珞區和道波，大雪紛飛、天寒地凍，儘管逆境當前，尊者等毅然繼續旅程，以此色身的勞累示現身業的去除，當地一些天神、空行母和護法齊來相迎，請求取出一些伏藏法，因時機未成熟，未能如願。<br>尊者抵達曾被佛教徒亞才國王統治過的印度尊朗，此家族已改信名為巴利拉札的印度教，統治著約二十幾個小國，講著訛誤的方言。<br>尊者在喜馬拉雅山山脈潘恰利山前薩都，一處名為“天然屍陀林”的金剛瑜伽母聖地住上好幾天，並作薈供，“因內、外緣起聚合，各種佛教和印度教的哲理，清晰地自然湧現心頭。”尊者如實敘述。<br>因居民的景仰和具信，尊者給予灌頂、口訣和開示，說服他們依循正知見、導入心性以開悟解脫。<br>住在中印邊境的桑珠丘汀寺時，正值門巴族兩位首領相互格鬥，乃居中調停，解決他們的紛爭。<br>夜深入夢中，親見度母而寫出一篇《度母讚頌文》。尊者如天降甘霖般的圓滿人們的祈願。<br>鐵狗年，西元1730年，三十三歲，尊者應幽札寧波轉世噶旺多傑的弟子瑜伽士鄔金丹增邀請，前往宗朗的達喇，得到噶旺寧波《法界自明》的法教、《觀世音菩薩心要》、普巴金剛法、北方伏藏的觀音法門和伏藏大師努當取出的虹光化身開示。尊者相對授予貝瑪德欽林巴明界心要灌頂及心要的持有者。<br>路經薩都和達榮，抵達下達拉，往蓮師聖地奔巴，於不動瑜伽的禪座中，追循禪定的深層內義；期間亦如源源不斷江流般的對具信有緣弟子傳授解脫道。<br>尊者親近的弟子鄔金丹增諾布，以參與尊者先前和現今的祈願過程，而負起編輯大師著作的責任。<br>金豬年，西元1731年，三十四歲，尊者在絳真寺滿願觀音菩薩像前，供養自己所寫八十八段的証悟道歌《琵琶之音》。<br>之後，前往加吉師利寺和布札聖地，寫下不少朝拜聖地的詩歌；欲往印度菩提迦耶、過羅恰聖地朝聖，因故未能成行，又回到絳真寺。尊者傳予巴拉瓦阿旺耶喜等徒眾中觀派菩薩戒和金剛亥母灌頂。<br>後應弟子色桑祖古迎請至江旁南卡宗新蓋的寺院，傳授普巴金剛、極密無上如意寶和寶生部的灌頂，開示達波派上師瑜伽法、口傳自己所寫道歌。<br>抵達札卡達索寺，為圓滿住持祈願而傳授噶旺寧波伏藏法、觀世音蓮花王、加措寧波伏藏法、三寶總集、新伏藏法《觀世音如來總集》等灌頂與開示。<br>又到朗札瑪寺，應色桑仁波切請求，給予忿怒蓮師灌頂；前往巴克秋定寺，傳予色桑仁波切與眾多喇嘛們《觀世音如來總集》、寂忿了義藏、經集藏如意寶、大成就者噶旺多傑伏藏法、觀世音三根本精要、上師精要、寂忿意自解脫等灌頂及口傳，開示俱生大手印、極喜金剛四灌頂和勝樂金剛十三尊灌頂等。<br>前往加吉師利寺時，應普南卡巴桑請求，留在翁噶寺重編大藏經與目錄、供養了一座六字明咒大經轉輪。<br>後到蓮師曾親傳藏王木赤贊普《蓮師願望任運法》的貢唐地區，六次於定中親見蓮師而獲得此法。這時咒師貝瑪旺札亦供養尊者阿里班禪傳承祈願任運的唐卡，善緣十分具足，尊者想在前往布里雪山時寫下此法，但機緣未具而暫時未寫。<br>此年，亦傳法予瑜伽士根桑龍卓與具緣弟子們一些不共祕密口訣，應各地寺廟請求陸續傳法。<br>水鼠年，西元1732年，三十五歲，尊者前往朝拜蓮師加持過的桑桑拉札及日布札桑兩座聖山，修持上師、本尊、空行成就法，供養、祈願、迴向佛法昌盛和眾生安樂。<br>同時，給予蓮師弟子真巴南卡的轉世根桑耶喜密傳丹寧林巴的大圓滿精髓、北方伏藏《樂空大海》等灌頂和共通的開示，成為尊者親近弟子之一。<br>此時，康龍巴仁增旺嘉在吉隆的成就洞圓寂，尊者為其處理後事及供養靈塔，在一週內重寫一篇他的轉世祈請文。又捐助此地札桑禪修中心的修法基金。<br>在拉札禪修時，尊者得到開啟意伏藏的訊息，而寫下一些伏藏法傳給具信有緣的弟子們。<br>冬天，尊者前往拉多的索丹宗，為許多具善緣的弟子們開啟法教之門、為幾位精進修持者傳授北方伏藏《意成就法》，同時寫下此教法的傳承祈請文。<br>水牛年，西元1733年，三十六歲，尊者一整年都留在拉多的北方和南方。<br>曾去探望上藏區杰寺偉大的譯師查巴阿旺札西南嘉（抄布寺傑出的譯師丹增旺波的直傳弟子，為當代頂尖的博學之士，精通梵文語法、詩詞、天文學及占星學等不勝枚舉。）<br>尊者隨他學習梵文語法的《妙音佛母文法大解》一段時間，譯師對尊者在極短時間內即領悟全盤的教授而深感訝異，賜名“妙音成就金剛(央堅珠貝多傑)”；尊者作了一篇名為《妙音歡喜歌》的妙音佛母傳承祈請文及名為《極喜琵琶》的《詩鏡》傳承上師祈請文，思欲以梵文語法寫下來，但未能完稿。<br>尊者對藏傳天文曆算的貢獻<br>此年，亦註釋了《詩鏡》第三章，即為有名的西藏文譯本《美隆瑪》；深入研究占星學以拓展西藏弟子的知識，而傳下眾所悉知的《普氏曆算法》；精選出時輪金剛、金剛空行母、四座金剛續[ 指自、他、合、密。]內的部份，編著一本曆算續，題為《完美寶鏡》，即後來著名的《持明算學》。<br>弟子中如康區的轉世祖古丘吉迦措、普蘭的僧侶噶瑪旺嘉和定日的成律日嘉沿襲此曆，使之廣傳，然現今已少有。<br>木虎年，西元1734年，三十七歲，尊者在帕庫的巴默秋定一座寺院，為金剛持洞穴的根桑仁增旺波喇嘛深入而詳盡地講解《離畏》的課程，向南卡帕桑傳予岡波巴上師成就法，在他們請求下，完成一篇傳承祈請文。<br>在帕桑莊嚴“無畏”大廳裡，尊者向廳內的黃金佛塔獻上絲質哈達，在上面寫下一首讚美詩，也在拉多北區仲巴蔣[ 為阿里連境的南部。]的雲布隆寫了一些祈請文。<br>同時期，親見《蓮師願望任運法》的傳承祈請文並擬了一份原稿，著作一篇題名《大寶藏》有關蓮花生大士的詳盡讚美文。<br>達爾巴的首長也在此時向尊者請得一些甚深的法教。之後，尊者到魯拉哲蚌寺，接受根桑旺波不少的灌頂。<br>此後，尊者前往西藏的香巴拉──覺囊寺，修持時輪金剛成就法。<br>期間，尊者在一座城牆破落寺院內的垃圾堆中，找到一份由覺囊派多羅那塔大師編輯，有關印度八十四位成就者資料的原稿，尊者依此寫了一篇名為《金桿》有關於這些成就者的文章。<br>逗留在札多的僻靜處──拉旺札巴（覺囊派尊者多羅那塔的根本上師）的住處，面對一群雲集的皈依者，尊者端坐在學者推波巴喜饒堅贊[ 譯為慧幢(1292-1361)，覺囊派著名大師。]和多羅那塔坐過的法座上，依照覺囊派傳統，給予眾人灌頂、口訣和口傳，同時承擔佛堂和大殿的整修工作。<br>在此，尊者亦傳授珍貴的大伏藏法予札桑的夏仲根桑耶喜、瑜伽行者貝瑪久美、拉喳歐敏珠林寺院的學者貝瑪仁珍和其他的皈依者。<br>在札波桑宗時，尊者亦取出天鐵的金剛杵和一些祕密伏藏法。<br>木兔年，西元1735年，三十八歲，尊者前往北錫金靠近汀吉區密乘山的僻靜處，為了佛法及有情眾生投注很多心力，重新蒐集過去成就者的一些史蹟。並在寧瑪派瑜伽士洛桑寧札請求下，寫了一本可公開修持題名為《仁欽佐寶藏》的法本，以為導引。<br>尊者巨細靡遺地教授親見的伏藏法《蓮師願望任運法》予弟子們，如巴拉夏魯、阿旺耶喜、卓普的貝瑪根薩、札桑的根桑耶喜、比丘根桑賢槃（之前為吉隆王）及許多幸運具慧根者。<br>據說，有些弟子曾筆錄了這些教授。尊者後在薩普隆停留一段時間，傳授大圓滿精髓給弟子們，據聞並於此地取出普巴金剛杵及祕密伏藏法等。<br>第十一章<br>時年介於三九至四十 認証十三世大寶法王<br>為其舉行坐床之典禮 傳敏林空行母大圓滿<br>親見智慧空行母<br>火龍年，西元1736年，三十九歲這年，大半時間，尊者留在夏魯僻靜處，並前往日塔的寺院，在布敦的法座上，給予眾多僧眾多種教授，尤其是六加行的課程；將深廣教法傳給智的轉世──文殊蓮花無畏、一些傑出的人士及群集的皈依者。<br>從拉庫傑仲處，得到《道果》的灌頂；親臨都桑林寺，得到寺院方丈三次傳授完整的《道果》；由夏魯夏恰一位阿闍黎處，聽聞偉大學者布敦的完整作品；在榮噶波久一座佛塔內，造了數十萬尊朱倭仁波切塑像及百次加持。<br>在丘隆，給予查日瑞巴後代、也是南開寧波的轉世──貝瑪才旺喇嘛傳法及馬頭明王、金剛手菩薩和大鵬金翅鳥等灌頂。<br>尊者在蓮師住過聖地附近的耶喜措嘉佛母修持洞穴住了一些時日，寫了名為《成就大寶瓶》有關觀世音菩薩法門生起和圓滿次第修持的著作，並傳予覺囊派尊者根噶卓秋。此法門後來儼然成為証量教學的趨勢。<br>前往錫金歡樂園時，發現當地人士大都遵循學者桑傑培仁波切（尊者過去生的轉世之一）的教授學習，尊者亦將覺囊傳承的上樂金剛和沙壇城灌頂，傳予此地的親近弟子巴拉的祖古噶旺耶喜及根桑歐卓喇嘛。<br>尊者給予嚴守戒律的欽日丹巴達吉和其他許多學者們灌頂、口訣和開示。<br>住在辛模的毘盧遮那洞穴的時日，寫了一首讚揚許多曾受過觀世音菩薩加持西藏成就者的詩。<br>後來各應榮丘特林寺轉世噶桑久美倫珠來信請求及噶旺祖古勞桑持仲邦巴請法，各自給予許多教授；在藏區的夏魯日布作供養、傳法給許多信徒們。<br>在夏魯寺的佛堂，虔誠禮拜供養，寫下一首讚美護法神拉旦地母的詩及獻上哈達，在寺內比丘兼巴丘達的同意下，捐獻了整套西藏總理贈送的大藏經，比丘也回獻自己的銀曼荼羅盤予尊者，尊者並寫下一篇祈願文。<br>尊者拜訪寧多的寺院後，留在拉隆一段時間。抵達恰桑丘布寺，除傳法給部份人外，也傳予庫桑貝瑪丘當和附近一些幸運的弟子們更深的法教，傳授《大圓滿》給拉薩布達拉宮南嘉札倉寺的兩位比丘羅桑丹增和旺秋嘉參，應他們請求，著作了大圓滿的修持法本。<br>離開前往祖普寺的下端區，著手整修香巴噶舉傳承七位大成就者之一傑岡秋吉桑給的寺院。<br>完成後，即往祖普寺，暫住貝瑪炯宮蓮師和第一世大寶法王都松欽巴先後住且閉關過的僻靜處，修持的定中，尊者親耳聽到：<br>鄔金多傑[ 指鄔金金剛，意為蓮師的預言賦予空行母的密意來表達。]的法教使命來臨了<br>而現空行母的密表示<br>宛如來自冰河的小溪流<br>雪山戴著頭巾般的迷霧<br>小溪流向火方(西方)<br>並佇足在樹旁<br>叉分成六小支等<br>再者在近山一僻靜處<br>名為該日雄日<br>或靠近此處貧窮的地區裡<br>純淨而尊貴的血統<br>此乃精進學佛之淨土<br>此處即有“噶瑪噶”<br>尊者將這些文句送交大司徒仁波切。如預言般清楚明瞭，大寶法王多傑的轉世，水牛年誕生在定日縣的嘉瑪。<br>木虎年，法王隨行弟子根桑無畏負命裝扮成一位瑜伽士，帶著包括房子、村落形態、父母和孩子長相等，能絲毫無誤指認轉世靈童的明白指示，前往相尋。<br>好消息很快傳到祖普寺，慶祝活動展開了。火龍年，兩位年長的喇嘛帶領前世大寶法王的幾位隨從，再次前去確認，隨即將法王請回祖普寺，舉行坐床大典。十三世大寶法王敦都多傑的著作中，也詳載著此事。<br>尊者轉往拉薩，在大佛堂內竭誠禮拜供養，由衷禱祝佛法昌盛、人民安樂。<br>西藏總理索南多傑頗羅鼐，以極熱忱及恭敬心招待尊者，並接受了一些法教及修法以去除障礙。寫給尊者的幾封信中，特別請尊者預測未來大事。<br>回函中，尊者寫了如下詩句：<br>對於蓮花生大士的傳承<br>你有極大的信心<br>幸運者呀<br>你深深了解政教<br>臣服在偉大導師足下<br>墮落的年代有一股天然的力量<br>邪惡的魔王和勢力已然壯大<br>他們掠奪西藏的快樂<br>偉人們的心志隨之而轉<br>以三十年為期<br>整個時期達三百年<br>一是美德時期<br>再者璀璨之期<br>三者鬥爭之期<br>如今我們處於第三階段<br>徵兆是貓頭鷹出現在紅色山丘上<br>桑耶寺變得金光閃耀<br>大覺者戴上王冠<br>隱身的魔王旗幟高舉<br>惡兆之女誕生於拉薩<br>蒙古護法[ 指白哈爾護法。]禁語<br>海波日山丘將聳立一寺院<br>昌珠寺的法旗被風吹倒<br>人們尋求僻靜處<br>此為這個時期概略的現象<br>侵略的預兆來自上蒙古<br>空中發出駭人的聲響<br>恐懼在人群裡蔓延<br>山南的山丘會夷為平地<br>准噶爾軍在內戰中格鬥<br>西藏的雪山將融化<br>十二女神的容顏將趨黯淡<br>屆時 上蒙古人就會到來<br>情勢扭轉者將降臨<br>若毗盧遮那的轉世<br>能取出五伏藏法 倘若發生<br>六十年的和平勢必來臨<br>若虛空藏的轉世<br>能取出山南區的伏藏法<br>若且穹的轉世<br>能取出雪山的伏藏法<br>將有五十年的和平<br>若宮禪的轉世<br>能取出邦巴的伏藏法<br>將有二十五年的和平<br>如果 龍樹的轉世<br>能取出伏藏法<br>會有二十一年的和平<br>等等<br>此時，總理的老師是普布覺的大喇嘛強巴仁波切。有天，總理同時邀請兩位上師坐在左、右邊對等的席次上，自己則沉默彷彿要入睡般的坐在中間。<br>強巴仁波切向尊者說：“康巴喇嘛，請寫下一首對蓮師的讚美詞。”如同有張蓮師肖像在前方般，尊者立即以如敘述釋迦牟尼佛十二重要記事(行誼)般的方式，寫了篇讚美蓮師八種救渡眾生重要化身的詩，結尾寫道：“這是應偉大學者強巴仁波切的請求而作。”<br>其後，尊者供養約三百六十尼泊爾幣的茶葉（相當於五十藏兩）給甘丹朋措寺的全體僧眾。<br>以六十三尼泊爾幣於拉薩佛堂釋迦牟尼佛像前、極樂寺的智慧佛塔和哲蚌寺的無觸佛塔等供燈及作時輪金剛曼荼羅供。<br>捐助自有的一百藏兩及總理公子供養的五十藏兩，計一百五十藏兩，幫忙覺囊寺每年舉辦的時輪金剛修法。<br>前往詳卓工波建立的查貢唐寺院，尊者傳授丘桑的轉世蔣揚秋培北方伏藏法《意成就法》及馬頭明王灌頂和口訣，傳給巴拉的轉世阿旺耶喜等二十一度母灌頂和六種禪修法。<br>嚴守戒律的瓊吉瑞伯德欽寺院方丈札薩尼瑪嘉參（曾隨侍第七世達賴喇嘛噶桑嘉措），亦聆聽尊者一些法教，後來成為內政大臣。<br>又應請求，尊者著作一本題為《一滴甘露》妮古派[ 即香巴噶舉傳規。]大手印的法本；在偉大的邦巴山神像、怙主詳和十萬佛塔前供燈、虔誠禮拜。<br>在耶巴密乘寺住了好幾個月，期間，尊者到尼瑪汀僻靜處遇見傑出的院長蔣揚吉北多傑，院長除鼓勵尊者弘揚舊譯傳承密法，也在院長座下領受密集金剛、上樂金剛及金剛持等灌頂，聆聽密集金剛的五次第和上樂金剛續的深層密義。<br>尊者在盤尤那爛陀學院教授丘嘉的轉世後，動身參訪止貢噶舉寺院，聽聞五俱大手印的內容及《三道歌總集》，尊者亦相對傳授寺中喇嘛們一些教法。逐一拜訪帝卓洞穴後，抵達工布東部的森林地。<br>火蛇年，西元1737年，四十歲，尊者到了下康波盡頭，留在珍貴大師桑傑林波公開教授《上師意集》的蘇里仁欽巴，應首領丹增珠札和兒子請求，傳予灌頂、口訣和《上師意集》內容的講授，也作了一篇傳承上師祈請文。<br>在瓊巴龍僻靜處的“法性殿”上，尊者得到了《上師意集》從沒有聽過的部份。在給予大圓滿灌頂和教授時，尊者作出日修口訣的法本。<br>尊者仍在康區時，曾應請願而取出在瓊巴龍的伏藏法。由於其他因素，尊者延後到工布的行程。此時，尊者公開了紅度母的成就法、蓮師和諸佛化身的忿怒普巴金剛的口傳。<br>尊者隨後前往西藏中部，在昌珠寺和札西揚南寺做了極大的供養。又特別留住在謝札蓮師聖穴，進入甚深禪定，並以多羅那塔大師所作妮古空行母六法為基礎，寫出一本禪修法本，空行母顯現各種徵兆，尊者確信自己得到的加持。<br>抵達西藏的鄔金淨土鄔金敏珠林寺，朝拜所有佛塔，傳給首席喇嘛仁欽南嘉、其姐敏珠林堪卓木久成律巴卓比丘尼大圓滿心部、法界部和口訣部灌頂、口訣及至高無上的祕傳心要的同時，尊者也得到一些大圓滿教法和長壽灌頂，並接受了赤仁波切的灌頂。<br>在贊揚寺的雕像和紀念碑前，作了極大的供養及虔心禱祝。<br>到拉薩的兩尊著名佛像前，作類似的供養和祈願。<br>前往祖普寺，參加十三世大寶法王敦都多傑的坐床大典時，作了最上的供養、唸誦吉祥祈願文。<br>返回拉薩，再次與總理會面，總理請求尊者留在中藏，但尊者打算經由工布和波密縣前往康區，乃詢求總理的許可。<br>隨後，抵達達拉岡波，拜訪偉大導師達波巴的主要中心岡波桑隆寺，向拉亞巴建造的岡波巴大師雕像獻上哈達、供酥油燈及虔心祈願。<br>前往續部法本內深為讚譽的上樂金剛聖地雜日禮拜，並向忿怒飲血尊、金剛亥母及其他分院的雕像獻上曼荼羅。<br>參訪了措卡湖和許多其他小地方的聖地等，作薈供及修持上千食子供養儀軌，親見不少聖尊和如魔術戲碼卻又極其自然的影像，然尊者並未揭露這些。<br>抵達東倉榮峽谷，應卓普巴貝瑪根薩請求，著作一篇獅面護法神祈請文，並在峽谷的小洞穴裡禪修。<br>不論在此處和他處，尊者都曾清楚地親見智慧空行母耶喜措嘉真實顯現，傳予尊者蓮師祈請文，並請尊者寫下(即流傳至今現有的祈請文)。親見影像之際，尊者曾寫下很多首詩，可惜未被全部留存下來。<br>第十二章<br>四一至四八親見 達賴喇嘛互為師<br>土馬年，西元1738年，四十一歲，尊者重回西藏首府拉薩。受邀謁見神聖全知、布達拉宮的達賴喇嘛噶桑嘉措，向達賴喇嘛頂禮，以表尊敬。<br>遇見總理，作了些許詳細的商談；參訪大昭寺佛堂供酥油燈等大供養；修訂以前在康區索奇的巴索寺所作上師瑜伽的法本。<br>尊者離開東工布後，經過查貢、查南和尼薩，抵達工布的森林區，拜訪了第二佛蓮花生大士生平所有重要和次要的聖地。<br>尊者如永不間歇的河流般宣說法教，參訪隱蔽之地貝瑪庫各個地方，之後停留在宗教運動的永恆地，座落貝瑪庫附近和黑白珞巴邊界的寶石山丘之頂，著作了很多的法本。<br>又前往飲血金剛和上樂金剛的居住地，附近可找到三塊岩石和一座湖泊、看到金剛瑜伽母的《自然法源》和許多其他神奇自然景物，尊者住在附近有尊極莊嚴飲血金剛雕像的措炯寺，編著了一本偉大的寂忿百尊懺悔文。<br>停留在甘丹瑪莫寺期間，尊者傳予十二世大寶法王所認證的丘傑林巴轉世甚深法教，應其請求，作了一部題名《成就者之主要道》的上師瑜伽法本。<br>土羊年，西元1739年，四十二歲，尊者待在工布釀卡蓮花生大士曾加持過的“洛百泉”僻靜處一段時間，珍貴大師甲村寧波也住過此地頗長一段時間。<br>尊者作了一本題為《滿願》詳盡的四曼荼羅修行法本及其他著作等，同時呈上一封題為《天鵝女之歌》的信函給神聖的第七世達賴喇嘛噶桑嘉措──布達拉宮至高無上的觀世音菩薩，也寫了一封詩歌形式的信給西藏總理索南多傑頗羅鼐。<br>尊者在此處附近的一些聖地住了一段期間後，到了工布的奔日聖地，此地人民深信西藏的第一位國王涅赤贊普藉著天繩之助由天上降臨人間，尊者在此為二十部了義契經作了一本目錄。<br>鐵猴年，西元1740年，四十三歲，尊者前往波密縣貝瑪庫西北方的仁欽朋寺，面對一群具慧的弟子們，滔滔不絕地宣說正法。尊者在此著作了一部法本、對十方淨土護法神供養食子儀軌。<br>金雞年，西元1741年，四十四歲，尊者待在唐卓──那措仁卓的住所，尊者著作了一本標題為《明義》的佛教歷史。<br>之後前往下工布區，經由帕日馬普札河(四河源)河岸、第一位西藏國王曾住過的朗卡多仁，尊者為了利生而做了各種佛行事業。<br>水狗年，西元1742年，四十五歲，尊者前往下工布的嘉拉新當和嘉拉巴東等地時，體認到自然顯像在石頭上的佛塔象徵文殊師利菩薩的意，竹子的外觀象徵是文殊菩薩的身，溪流呢喃如咒語象徵是菩薩的語。<br>隨後待在歐薩林寺的寧卡丘日，遇見西藏竹巴噶舉學院的最高喇嘛聖者成律辛達，尊者傳予他很多甚深法教。<br>同時，在竹千法王的請求下，尊者著作了一部標題為《甘露滴》的上師瑜伽法本。在竹秋定寺時，尊者給予偉大的竹千法王覺囊派時輪金剛灌頂、很多其他主要和次要新譯續和舊譯續傳承灌頂、妮古空行母六法和其他甚深法教的傳授。<br>尊者沒有接受竹千法王任何供養，相反的，供養了一座曾為克珠瓊波瑜伽士主要禮拜的黃金佛像和其他物資給竹千法王，以為永恆的祈願。<br>在瓊巴龍停留期間，又應竹千法王的請求下，寫了兩部有關時輪金剛的法本，一為大威德金剛的日修儀軌，內含布敦大師的讚揚，一為十三本尊成就法的法本，內含時輪金剛占星學的進階課程內容等，標題甚美。<br>同時，給予竹千法王的老師、偉大的學者仁欽嘉措觀世音菩薩法門的灌頂、口訣和內容的傳授。寫下一首普賢法輪的詩，以作為對竹千法王永恆的祈請文，竹千法王的老師亦寫下一首詩以為回響。<br>水豬年，西元1743年，四十六歲，尊者前往工布拜訪藏王松贊干布降服西藏邪惡之地時建造的布曲寺，在佛堂內具大加持力的聖尊觀世音菩薩足下，準備製造甘露丸及做《上師意集》的曼荼羅供，成就者覺日也在當場加入準備工作。獻曼荼羅時，尊者做了意集部完整的灌頂及十八部的灌頂和口訣。<br>尊者後來留在哈日桑給山的斜坡，住在蓮花生大士加持過的洞穴裡一段時間。到此地之前，曾在克魯阿（幽陌的成就者丹增諾布與其弟的出生地）親見一些影像而思欲尋找印度成就者格格日巴與夥伴很久之前到此參訪留下的足印，在寫下一首五偈頌的讚美詩後，立刻開始尋找石頭上的足印，找到後告知大眾，眾人訝異、生起虔敬的信心。<br>尊者隨後前往工布南方的藏布九泉，在繞里達河或徙河河岸轉向右方。在此，看到了偉大的貝瑪列卓才的轉世；寫了一部意集部的成就法，同時取自時輪金剛的內容，製作了一個天體的構造圖；根據明界心要和許多資料，寫下長壽修持法。<br>傳予滿堂雲集、因緣具足、具信的男女信徒香巴噶舉傳承的妮古空行母六法的口訣和開示、尊者著作的上師瑜伽修持法、瑪繼嘉唐瑪的開示、新續和舊法教等許多其他的灌頂、開示和口訣。<br>木狗年，西元1744年，四十七歲，尊者暫住瓊巴龍，受邀到德摩寺，得到宗喀巴大師所傳完整的大威德金剛灌頂、藥師佛詳細而簡扼的佛經儀軌、宗喀巴祈請文的口訣和開示、《菩提道次第解》、《文殊言教論》等的教授。<br>前一年，瓊巴龍附近一處名增的地方，一位有錢又虔誠奉獻名為吉宗的婦女，曾遣人到桑耶寺，寺中白哈爾護法透過靈媒顯現為先知者，告訴她應將所有家產供養尊者才旺諾布。<br>她請了擦智的瑜伽士和竹秋定寺的轉世，推介自己及欲以所有財產供養尊者的心意，在瓊巴龍淨土護法的強力請求下，如同為人所稱道的薩布隆之於蓮花生大士般，尊者為了佛法和有情眾生而收下這些供養，以此在這裡建了一座寺院和一尊一層樓高的度母雕像。<br>完成後，修持加持儀軌時，尊者親見很多的吉兆，同時創辦了一座禪修中心，指派了金剛阿闍黎，內有二十八位常住修行瑜伽士，從此年十月到隔年的四月，誦日修祈請文一萬次及金剛上師咒、六字真言、金剛薩埵真言各一億遍，此行事一直沿續著。<br>此時，尊者也編著了一部取名《意境》的西藏歷史及其他著作等。<br>木牛年，西元1745年，四十八歲，尊者幾乎整年都在瓊巴龍，大學者大司徒仁波切確吉炯內丹比寧謝也到達工布，兩人住在一起。<br>應大司徒仁波切的請法，尊者給予大威德金剛和覺囊派時輪金剛灌頂、時輪金剛六加行、《他空中觀》教理和覺囊派學院所有法教的開示，尤其是大圓滿精髓立斷和頓超的極密修持。學習終了，兩人心意合而為一。<br>尊者過去前幾世，曾在工布化身為寧普的珍貴大師桑傑林巴，也是黃金法教的擁有者。尊者也記得自己好幾次的轉世都在工布，因此在此地待了很長一段時間。<br>很久以前，在康區時，噶陀派的嘉拉索南德贊亦曾說過尊者的下一世會在卓千──像工布的地方誕生，並成為一個瑜伽行者。<br>尊者自己在童年時，也總期望能到工布，曾說：“如經考據，自己過去生一定是工布的老瑜伽士。”<br>停留工布期間，尊者受到各政府官員的敬重，諸如：擦拉岡宗的西邦旁確南嘉、唐噶宗的才旺朋措特拉杜、歐汪的迪巴札西揚嘉等，都應他們的請求，給予不同次第的法教。<br>第十三章<br>四十九歲至祖普<br>傳法十三夏瑪巴<br>活佛等眾均同授<br>五十認定十世夏瑪巴 為之舉行隆重坐床禮<br>火虎年，西元1746年，四十九歲，尊者再度到西藏中部，抵達百萬學者的出處桑普寺，於尊勝度母像前供養酥油燈等，並依來自鄔金和另一部不同標題名稱的上樂金剛法本，著作一部上樂金剛的成就法本。<br>之後從這裡出發，到達下多隆的榮巴拉丘，親見蓮師忿怒金剛相而寫下日修祈請文。<br>再到祖普寺，遇見偉大的此賢劫第六佛大寶法王，應大寶法王和巴窩仁波切的請求而傳了一些法教給他們。<br>又依巴窩仁波切請求，以噶瑪巴的傳承著作了大黑天護法的修持儀軌。<br>由此再往北方到布日大成就者洛瑞的中心，在這裡整修佛塔；後在近覺默雪山冰河處──被視為西藏地母神的居住地，待了一段時間，寫出白度母修持法本和日修祈請文。<br>火兔年，西元1747年，五十歲，尊者受總理之邀前往拉薩修法，驅除總理的障礙，並依白色上樂金剛法門為他修了長壽法，給予《伏龍金剛手》的灌頂和口訣等。<br>尊者虔誠在此地兩尊佛像前禮拜及大供養，虔心在阿彌陀佛、彌勒菩薩、文殊師利菩薩和觀世音菩薩等像前禮敬及祝禱。<br>在此，遇見大司徒仁波切和巴窩仁波切，與他們暫住一起，期間，寫了一篇取名為《怙主的天空》的阿彌陀佛極樂世界祈請文。<br>尊者和中國皇帝創立的一所學校的校長公貢波加成為筆友，常以書信答覆他的疑問。<br>此年，總理索南多傑以過去業障而長期承受的頸傷之苦終究解脫了，兒子達利巴托繼承職位。<br>尊者屢次受邀到新總理官邸岡洛肯修法、加持、開示及給予護法和財神灌頂等，傳給新總理的上師札巴仁珍喇嘛許多灌頂和口訣，傳授各種不同法教予東巴大臣、第大臣、遠近而來的軍官們、政府官員們及很多喇嘛後，又再次給予新總理灌頂和法教。<br>竹千法王儘其所能作了一次廣大薈供祈請尊者長壽住世，遮耶拉斯的轉世喇嘛也來探望尊者。替政府修法、為政府官員們及其他初皈依者作薈供，豐盛的供養如夏季傾降的大雨。<br>到祖普寺，為夏瑪巴轉世貢丘秋吉尼瑪舉行坐床典禮，當以盛大的供養及吉祥祈請文向這位年幼的喇嘛致意時，出現很多被視為來自尊者加持的殊勝徵兆，同時傳予大寶法王和夏瑪巴《明界長壽》灌頂。<br>在單獨傳授五次長壽灌頂和一次白度母灌頂給年幼的夏瑪巴後，尊者將其抱到腿上，以銀湯匙餵他奶凍時說：“我為你受了很多苦，如果你不精進，我就白費工夫了。”夏瑪巴後來陳述了這些話。<br>之前，八世的夏瑪巴巴欽秋吉敦珠在中國圓寂，九世轉世在不丹國的巴卓聖地，被帶到寺院，八歲那年舉行坐床大典後，很快又圓寂，下一位的轉世被告知將誕生在蒙卡南喜林。認證結束，噶瑪噶舉派信徒開始對他產生興趣。<br>另一位夏瑪巴的轉世，在水狗年，如同他的弟弟（無所不知的洛桑巴丹耶喜的轉世）誕生於札西才，眾意一致，認證過程順利。<br>依多年慣例，夏瑪巴轉世的認證事宜，送往政府當局時，認證夏瑪巴兩位轉世的合法性引起爭議，便在拉薩寺佛像前金瓶掣籤決定，結果有利於札西才誕生的轉世，來自南喜林的轉世只好回到原來的地方。<br>尊者一直極盡能事承擔十世夏瑪巴貢丘秋吉尼瑪坐床典禮的各項事宜。此位夏瑪巴後來曾隨大司徒仁波切到康區，住了許多年後，在噶陀寺坐床。<br>尊者後來與竹千法王很長一段時間住在一起，在強巴烏日山前及吉岡邦巴修持大食子供養。<br>離開後，尊者前往司波里，參拜由喀什米爾學者僧侶比布德兼達建造、喀什米爾博學之士釋迦師利巴札加持的上樂金剛雕像。<br>雕像的由來為有次比布德兼達批評噶舉巴時，釋迦師利說：“比布德兼達阿！比布德兼達！不要這樣說。佛陀絕無妄語，尤其止貢巴的導師就是龍樹菩薩的化身，你已經犯了嚴重過失，應造一尊上樂金剛以懺悔。”<br>以感激心完工的雕像，極其自然，如同上樂金剛本尊親自建造般。<br>尊者非常具信和尊敬地在像前作薈供、獻哈達、滿握碎黃金拋灑向雕像、寫下虔誠的祈請詩文、修了五次上樂金剛儀軌及供養大食子。<br>再由此地出發，抵達塔巴才，作大食子供養，同時派人邀請貢卡寺偉大的阿闍黎洛珠嘉措喇嘛立刻前來，傳予《金剛鬘四十五聖尊曼荼羅供》（這股潮流至今仍沿綿不絕，為出自以西藏新譯續而著名、偉大阿闍黎阿貝亞噶惹的著作。）二十一天完整的灌頂；同時傳更詳盡的上師瑜伽灌頂和甚深教法給寺內僧侶和隨行弟子們，以相當的發心供養，令貢卡寺的喇嘛甚為歡喜；又傳予龍王佛、個加巴地金剛亥母和巴基金剛亥母灌頂後，送他回去。<br>巴日的轉世來探望尊者，也接受了金剛空行母灌頂和開示。<br>傳予榮秋特林的喇嘛和許多人們馬頭明王灌頂；傳珍貴大師噶旺多傑伏藏法《法界自明》灌頂給群眾們。<br>收到總理寄來的極機密信函後，即帶著隨從騎馬前往拉薩。與總理在噶當康薩碰面，應總理請法，給予忿怒蓮師灌頂和其他法教，尊者獲得安住修法和許多供養。<br>經由寧唐諾布岡，前往竹司巴江秋林寺時，竹千法王親到大門口迎接。兩位尊者在“周遍清淨寢室”內討論有關宗教事宜後，給予竹千法王長壽灌頂。<br>尊者接著到答丘波日山頂，持續不斷作一千次食子供養。<br>竹千法王將回西藏西部，尊者和弟子們亦將啟程前往尼泊爾前，二位又一起住在丘波日山山洞，輪流替彼此修持長壽住世祈請文。<br>普藍夏仲仁波切和一位比丘尼，在前往拉薩的途中，有緣與尊者相遇而得到忿怒蓮師灌頂後，供養了尊者長壽住世祈請文和其它。<br>與竹千法王同時出發，抵達卡拉瑞貢，尊者寄信給康區的親友們，內容描述了一些類似遺言的訊息。<br>一行人來到過去為尊者覺囊多羅那塔的出生地章普，尊者給予竹千法王忿怒普巴金剛灌頂及諸多開示。<br>竹千法王將到西邊的拉達克，尊者供養很多金銀給這位普巴派的法王以安置在拉霍的噶夏觀音菩薩寺屋頂上的鍍銅傘。<br>尊者在途經桑卡的佛經堆塔時，獻上哈達。竹千法王完成噶夏觀音寺的任務後，踏上歸途。<br>尊者等一行人繼續既定的旅程，在經過桑卡的佛經堆塔時，獻上哈達！<br>第十四章<br>年五十一已修成 尼泊爾菩提大塔<br>女神護法為佛母<br>第三次抵達尼泊爾<br>土龍年，西元1748年，五十一歲，尊者從藏區行經南拉多、巴唐、貝瑪秋定、宗卡和吉隆，安然抵達尼泊爾。<br>大學者大司徒丹比尼謝也正在尼泊爾朝聖，兩位在靠近閂布大塔旁邊，藏人稱為靈鷲山、尼泊爾人稱為給多的哲蚌寺旁會面，同住一段時間，互相給予口傳、灌頂及口訣，大司徒仁波切隨後返回西藏，尊者則擔起重修菩提(波達)大塔。<br>這段期間，尊者傳授觀音灌頂、菩提心、長壽灌頂、蓮師心咒、六字大明咒和金剛薩埵百字明給五百僧侶及男女信眾。<br>本傳記作者的根本上師（當時二十三歲的成律敦珠），正在幽陌冰河僻靜處修持普巴金剛成就法，“一聽到尊者的名號及消息，瞬即進入甚深禪定一段時間。”筆者的上師如此親說。<br>不久，前往拜見尊者，一見面即被收為弟子，尊者以一個月的時間傳授他及徒眾們北方伏藏法的普巴金剛灌頂、最勝飲血金剛、觀世音菩薩等諸佛勝海灌頂、白度母和觀音菩薩修持法。<br>菩提大塔的重修不久即完成，尊者撒下開光的鮮花時，唱出道歌：<br>耶瑪火 菩提(波達)大塔<br>是一切諸佛的表徵<br>非人造而為自然形成<br>如結緣則圓滿一切願<br>在燃燈佛時代<br>為飼鳥之母子所建<br>在釋迦牟尼佛時代<br>此塔為蓮花生上師讚嘆<br>在鬥爭時代<br>為瑜伽士釋迦桑波[ 為西藏北巖藏多傑札的傳人，在尊者之前曾重修過菩提(波達)大塔。]重修<br>在鬥爭時代末期<br>尊者導師預言<br>啊 被我及他人所重修的大塔<br>令人驚嘆啊 菩提大塔<br>它好像天生而非人造<br>它好像自海底浮現<br>它如高傲的山般佇立<br>滿足祈願的大塔<br>任何人與之接觸<br>即感受到意義的大塔<br>與之有緣者上生於極樂淨土<br>令尼泊爾之土地肥沃的大塔<br>使西藏成為繁榮國度的大塔<br>全南閻浮提裡最神聖的大塔<br>被諸神及世人們禮敬的大塔<br>啊 三界明燈的大塔<br>吉祥佛陀的莊嚴壇城<br>覺悟佛陀的大塔<br>願我能一再地瞻仰它<br>然後，<br>啊 具德的統治者<br>勝者頗羅鼐<br>全西藏的統治者<br>坐在金剛座<br>西藏的最高怙主<br>噶桑嘉措法王<br>虔誠的總理<br>皆住於同心<br>蓮花生大士之子<br>仁珍才旺諾布<br>無分別心的幫助一切眾生<br>令眾生安住於解脫道<br>菩提大塔<br>令見聞憶念者得解脫<br>為西藏及尼泊爾的福祉<br>完成浩大的重修工程<br>勝利 勝利 一切勝利<br>願一切皆勝利<br>夏智卡秀或夏智康秀大塔（西藏人稱為夏絨卡秀，即菩提大塔），曾多次被重修，蓮花生大士曾預言提到“此佛塔具諸佛法身，不可遭損壞。”<br>然佛塔外觀由四大組合而經歷變化，在適當時機，三聖菩薩（觀世音菩薩、金剛手菩薩、文殊菩薩）、度母和顰眉度母的轉世，將負起重修的工作，尊者才旺諾布即為三聖之一的金剛手菩薩轉世。<br>佛塔重修工程始於火兔年，土龍年裝臟完成。<br>六月五日，尊者等自加德滿都起程返回西藏的途中，親見一些顯像，住在擦必哈兒寺的一間小屋時，似夢非夢下，一位尼泊爾少女強行進入房間，尊者初以為是妖魔而試圖壓伏，但她現出各種不同臉相，與尊者行雙運。<br>問及身份和住處，回說：“住在加德滿都，名叫惹尼。”<br>又問：“是否可用人身示現？”<br>回說：“不！我是真實的我，我會幫助你。這件事，你可告訴大司徒等不超過三位的好友。”<br>她經常一個月出現一次，也可交談。吉隆一些喇嘛聽聞風聲後，漸少出現，尊者寫給大司徒仁波切的信中說：“她現在會較少出現了。”<br>應巴拉轉世喇嘛邀請，尊者前往吉隆，給予貝瑪林巴的長壽佛灌頂、佛密大師的長壽灌頂、地母的灌頂儀軌、惹瓊巴的白長壽佛加持、文殊師利的小灌頂及北方伏藏的觀音菩薩法等等，並特別傳授大圓滿的深密心要灌頂，尊者因見一些顯像而作了十萬薈供。<br>此時，尊者因生病而煩躁，親近弟子巴拉祖古因此舉行尊者長壽住世祈請法會、在莊嚴的阿亞瓦底雕像前供千盞酥油燈。<br>尊者除為佛法長住及有情眾生作祈願文外，也在絳真格傑寺供千盞酥油燈及諸多禮拜，身體康復了。<br>在噶也寺，受虔誠的西藏總理夫人貝瑪秋增邀請，傳授灌頂及消災法。<br>在阿哇桑丹秋林寺停留多日，傳授三寶總集灌頂、四臂大黑天的禪定灌頂、腰帶大黑天護法的開示、馬頭明王及金剛空行母灌頂等給一群居士信眾。以自己親見的淨相伏藏法等的開示，傳給巴拉祖古及其他人。<br>尊者到達丘桑的轉世喇嘛蔣揚秋北仍住的札卡達索洞穴，應祈請，傳予普巴金剛、長壽佛灌頂及口訣，住在一起討論一星期，鐵橋洛桑巴珠也到此。<br>附近民眾群聚，接受以蓋四座鐵橋聞名的藏普寺僧侶瑜伽士及尊者共同傳予長壽灌頂。<br>尊者離開來到札西岡停留一天，次晨，為巴默秋定寺的年輕轉世喇嘛根桑仁增旺波剃度、取法名才旺丹北薩謝，委任為日拉薩哦聖地的首座喇嘛。<br>這位喇嘛為尊者寫了一部禮敬上師的儀軌，每月二十五日修持，直到作者寫此書時，當地仍遵循此儀軌固定修持。<br>尊者前往與密勒日巴一生及弟子有關宗卡的日拉薩哦聖穴，將伏藏法的《寂忿百尊意自解脫》完整灌頂、中性大黑天灌頂及長壽灌頂等，傳授予噶瑪林巴上師、巴拉祖古、耶喜秋札比丘、成律敦珠及多位喇嘛們。<br>給予成律敦珠《丹尼林巴伏藏法的精滴》灌頂、《淨土護法的皆喜童子》小灌頂、上師瑜伽的詳細講授、自己著作中的幾章及其他口訣等，又特別傳予《寂忿百尊意自解脫》灌頂及帝洛巴、那洛巴、智慧友阿闍黎及寂藏菩薩等人的教授。<br>此時，尊者邀請多波切寺的大瑜伽士嘉喜桑給到來，給予自己一些精要的講授、舊譯續含經部、意集經、大幻化網等口訣及灌頂，得到三部中第二部的《最後祕密心要大幻化網》。<br>當瑜伽士擬給予大黑天護法灌頂時，不確定自己是否已從上師處得到灌頂，尊者說：“會幫忙確定此事。”即入定，一陣後，在場者都聽到一些聲響、感到一股力量。<br>出定後，尊者說：“確已得過此灌頂，大黑天護法特從喜瑪拉雅來此證明。”如此，乃給予圓滿灌頂。<br>另由瑜伽士嘉喜處，聽受馬頓傳承六善法的口訣及講授；也應嘉喜所願，相對的傳予一些法門及祈請文。<br>尊者收到學者羅日祖古秋吉嘉參來信詢問，回信中不只答覆問題，也附上自己寫的祈請文《離戲》。<br>此時期，尊者著作極樂淨土及佛陀三身之道的開示，送長壽祈請文及物資給竹巴噶舉學院的尊者噶舉成律新達，回信給尼泊爾國王的大臣黑天，為普藍族族長多傑拉加的兒子剃度，取法名才旺丹增。<br>第十五章<br>五二西藏大戰亂 尊者救人二百多<br>土蛇年，西元1749年，五十二歲，尊者自賢哲法現班禪處得到《噶瑪心要》的灌頂及口訣，接受一些稀有大圓滿心髓及舊譯續部經典等的教授。<br>尊者前世為貝瑪諾布時，曾從康龍巴的祖父索南丹北寧瑪大師，聽聞許多法門，此世也聽聞了所有寧瑪派舊譯密續法門的傳授，同時寫下此文：<br>願吉祥降臨<br>佛說輪迴皆苦<br>有為法終須毀滅<br>知無常生出離心<br>故須精進求解脫<br>於此自述所行善<br>自土蛇年年初以來，尊者自舊續部大師領受祕密心要《大幻化網經》灌頂、口傳及口訣。此經為密續十八部中的最後一部，與伏藏、親見現象或曾間斷過的傳承不同，為直接由佛陀口傳口、耳傳耳、心傳心，直傳至今。<br>於日那大師處，尊者領受了《噶瑪心要》灌頂及一些寧瑪派稀有續部傳承教法，因一再請求，也得到寧瑪派密續的口傳及口訣。<br>期間，接到印度人稱為木貢給大的珞隅國王后邀請參訪該國，無法拒絕，乃於五月由阿里區貢唐出發。六月三日到達孟唐，受到穿著傳統服飾、演奏各種樂器的當地人民盛大歡迎。<br>在此，傳授予王后及信眾長壽灌頂及祈請的法門中觀派菩薩戒及觀音菩薩禪修法，詳細講解《瑜伽上師成就法》，多次舉行傳法，人數最多時曾達五百人；並對少數人傳授《大圓滿明界心要》的深法。<br>再從日那大師聽聞續部口訣，對上師的恭敬及供養，令大師很歡喜，隨後，恭送大師返回住處。<br>為了到滾水石冒火的聖地下珞隅，經過工巴岡，俱誓金剛及年欽護法來迎接，告知保護邊陲的狀況：“境外雖無敵人攻擊、但境內邪神偽裝成魔出現。”<br>九日，到達下珞隅的札拉喳那。十日起，於三壇城中入定，與其他僧侶一起修持十萬薈供，與很多仁者同時看到許多勇士及空行母們很歡喜、熱鬧聚集，並見一些有緣聖者障礙消除的徵兆。<br>來到此地後，有次聽到聲音說：“爭端已起。”思索一下，覺得應無關緊要，前往印度毗濕奴神聖地巴日郭作大食子供養後，留在工巴岡休息幾天，寺院首席喇嘛供養尊者，視為瑞兆而接受了。<br>鐵狗年時，曾到過此地，尊者南開寧波曾親傳及諭封我為所有續部的法主，故而此次在此地寫下一個藍“吽”字。<br>從未來過家噶村，土地神威神彈奏樂器及舞蹈以表歡迎。在馬隆待了幾天後，來到蓮師聖地迪卡，土地神、七位天女之一的俱誓金剛母，化現人身來相迎，尊者盡所能地行薈供及食子供，滿足眾願給予傳法。<br>又來到孟唐，以幾天的時間，傳授心要的圓滿灌頂給幾位上次曾受過法的弟子、新來自堆波的大金剛持瑜伽士和宗朗王的大臣；兩次按照覺囊派年傳承[ 年為年‧熱巴堅‧尼瑪喔些，1124-1192，寧瑪派伏藏師，與古汝‧卻吉旺楚被稱為上下伏藏師。]的普巴沙壇城傳普巴金剛灌頂給曾三次以畫布壇城得此灌頂的隱居成就者堆波瑜伽士，瑜伽士發願若無病痛，每天應持咒二萬次。從古至今，此大成就法曾被開啟三次，加持力很大。<br>清楚的看到戰爭的預兆，對藏民來說是很不幸的。此時，阿里的公軍聚集武力在卓秀，夢中的聲音說：“如果不離開到別處，謠言就會生起。”<br>不久，西藏總理派遣十三萬戶的武力到阿里區。戰爭將開打時，族長公大人生病了，遣人帶來裝滿銀子的罐子請尊者給予預言。<br>對使者坦言說：“大人性命垂危，及時舉行消災延壽修法，或可受益。”但時機已逝，公大人逝於六月十日。<br>西藏政府軍逼近時，公大人的人民如風中蒼蠅般不戰而散，七十人避難到尊者處，請求庇護，尊者不顧己身，運用各種善巧方便為他們請命，終約有二百人得獲赦免。<br>如此一來，尊者也受到某些寺院的許多僧侶們批評袒護公大人。<br>願將此請命而使這些人赦免離去的功德，迴向眾生早日開悟解脫。<br>墮落時代，除極少數外，大多數人不會感恩回報，許多大寺院甚至聲明“無法幫助公族長。”但何以一個流浪者可以做得到？尊者這樣的行為，對許多人來說並不是一件愉快的事。<br>但此作為，得到來自觀音菩薩滿意兆相的肯定，這對尊者是個安慰。也由於這些不能推卸的職責而耽誤了幾個月。<br>第十六章<br>五三嫉者往質詢 親見文殊聖者身<br>鐵馬年，西元1750年，五十三歲，自珞隅國來到卓秋統治的竹秀，夢見西藏及中國的妖魔以小石子當骰子賭博。此時，若舉行修法，藏民會得到利益，但由於共業而只能得到暫時的安樂。<br>土蛇年，西藏總理因我為了大力請求赦免公大人隨從的性命，耽誤會面時間不高興而改變主意，不僅不同意我的忠告，更表示不悅。儘管如此，仍提出一些建議，但無一實行。<br>二月七日，來到札頓，舉行幾次消災火供；十日及其他幾個聖日作食子供；特別到北方的山丘頂作食子供時，七位威神現身取食，凡夫也能感到起風及某股力量──這是喜樂及威力相互交加的兆相；同時，看見二十多位被處死者輪迴為魔的預兆。<br>這年，本打算到尼泊爾朝拜及供養聖塔，因這些鬥爭而耽擱了。<br>此同時，親見怙主守陀巴的佛母吉祥慧鬘，給我四灌頂及一些預言，都如實修持。<br>前進到南拉多，圓滿完成自土蛇年起即開始持誦的毗盧遮那佛真言二億遍，將此功德迴向証悟之道。很快又圓滿一億遍大威德十四字真言及五十萬遍度母讚。<br>在仲巴蔣、珀東埃及綽普供燈、舉行祈願法會。<br>十日，到札仁欽才與大政治家會面，他的態度恭敬如前，可是心意似乎已變，不再接受教導，他的佛法導師西都巴也在場。我發覺他掌權將不會久，曾向他周遭的一些人示意過。<br>當時，加塔歇兄弟被起訴，我協助他保住性命，後來卻恩將仇報，故事直如世尊幫助提婆達多般。<br>一些心懷不軌者對頗羅鼐王建議讓我修伏魔法會有助益，因此下令我做此事。我知道若如此做，將會引起大紛爭，所以請求修四事業火供。<br>之後，到札西倫布寺，因班禪大師和十世夏瑪巴是兄弟的緣故，以一切受用供養班禪法王，同時也收到很多回禮。<br>隨後經過波拉、尼薩、才欽，到拉隆待一個月。到亞卓湖的鹽寶多，瞻仰聖者蓮師遺下的足印聖跡。<br>巴窩仁波切正於途中趕來與我見面，在目土巴馬貢相會時，出現了西藏的天龍、閻魔等忿怒和紛爭的徵兆。<br>祖普寺的仲巴揚欽，因行為過失而被交給西都府，害怕得譴人來請我為他請命，出了點力，在他到達格日時，事情已解決，他們覺得很快樂，我因此未被視為只是一位宗教小人物。<br>繼續參訪山南聖地，預感到那邊的不安寧而回到那布岡。禪定中，就如記得自己小時事情般的清晰憶起前世一些事情，受到很大激勵。<br>打算經過羅柔到夏寧美，很久前與大司徒及其他仁波切認證的此地一位轉世活爺，在二十二日(佛陀天降日)一起到達夏寧美，為求吉祥如意而舉行薈供及少女的宴會[ 供養很多少女、送禮及薈供。密續中說七位少女中即有一位善種女，二十五位即有一位世間空行母，一百零八位即有一位智慧空行母。此為密續中圓滿空行母的戒律之一。每月二十五日作薈供。為消除夭折小孩家庭之障礙等而作。西藏還有設宴比丘、設宴咒師、設宴母親、設宴兒童等眾多儀式。]。<br>此地有一傳說，尊者南開寧波曾於瞻仰禮拜此地空行母所建的佛塔時留下手印，令人驚異的是這座佛塔完全依《時輪金剛智慧品》描述的尺寸建成。<br>以畫布壇城，在此給予浙律仁波切香巴傳承的五尊上樂金剛灌頂及大手印的六加行五教法，他的聰智，令人極度歡喜。<br>此時，相續出現很多令人不安的兆相。普巴曆十月十二日早上，總理被中國大清朝指揮官謀殺了，他的精英部隊奮力迎戰，殺了三百多位中國人和兩位官員後解散。<br>十六日，傳來消息，多仁班禪已成為西藏統治者，蓋著昔日黑印的諭令傳來已聚集武力。<br>再不久，蓋著紅印的諭令也傳來，宣告他已登基為西藏統治者。<br>我打算去拉薩，卻由於身為忙碌僧侶，必須參與一些活動而耽擱。此時，夢到一位藍色的毗濕奴(大世間神)，傳給我一些世間成就法。<br>來自各方的謠言，使人民懷著相當大的疑心及猜忌，本身則對諸法實相更具信心而內心平靜，覺得善惡等無差別，如幻化、水紋、陽燄般，都只是一個心念而已，善惡本對法性無影響，因此不存疑慮和希冀。<br>三日，察覺到有位可怕的人，已投生為夜叉。九聚凶日那天，稅吏朋措的弟弟帶來政府的一道命令，不巧，當天無法見到他們而未收到。<br>第二天，他們拿著此信想威壓我，即以普通的待客之禮回報，並以見力調伏，他們都面如死屍般的蒼白。<br>九日，緩緩前往拉薩，在塞口溫泉停留一天，經過香波拉隘口頂端，遇到一群牧民以大旗幟高豎犛牛背上，被視為香波拉山神歡喜示意的瑞兆。<br>十四日，留宿在雅多的噶瑪佛堂，夢到聖尊文殊師利菩薩以各種示意為我除怖。<br>十五日，來到昌珠寺供油燈、獻哈達及發清淨願文，也參訪夏巴寺和寧秋寺。<br>來到桑耶寺，一道如柱般的白光豎立屋頂最高層的前方，院內的白哈爾護法比以前更歡喜恭敬。同時遇見一位屍陀林天母化現的漁婦。<br>在此停留一天，於頂樓馬頭明王殿及白佛塔內供燈及發清淨願，以應和在昌珠寺的修法。雖曾多次見過佛陀的大雕像，但此次佛像看起來光輝更明亮、莊嚴，令我驚嘆。<br>當通過古噶拉隘口時，未曾興起絲毫的風，如似土地護法心生歡喜。留在察貢唐休息一天。<br>二十二日，抵達拉薩。<br>二十三日，請求多仁班禪讓我會見達賴喇嘛，但他託詞有很多問題須考慮而拒絕。<br>由於緣起的力量，立刻，有人被派往布達拉宮，隨即被告知第二天可以覲見。<br>當我前往布達拉宮時，很多人以為政府會欺凌我，在背後竊竊私語及嘲笑。但見好幾百位後藏大小政府官員對我低頭禮敬後，他們即對我非常恭敬。<br>不久，經由尼加總管，我在黃金佛塔上方的“萬法興隆”殿內，供養達賴喇嘛一條長哈達、一兩黃金和五兩白銀。<br>頂禮時，達賴喇嘛於定中，微笑親手接過哈達，總管等請我坐在首席，自認並無資格，寧願坐在墊上。<br>我俯跪著請教一些問題，達賴喇嘛都給予適當的回答，並問及我的健康等。<br>當時多仁班禪如前任總理般坐在達賴喇嘛左邊，我獻哈達給他時，他點點頭，對以前曾拒絕我要求私下會面的事情頗覺尷尬。<br>當時的一切場合，深覺如鏡中幻像般，猶如究達佛法。以本性而言，真如並無改變，僅外相在變化。<br>那時，大怙主竹千法王聽到我覲見達賴喇嘛的好消息，無法決定是否離開，就好意的留在幽陀康薩。我前往相會，他非常高興。<br>尊者巴窩仁波切也在拉薩，相互見面。第二天，堪布得拉達拉仁波切與札日大人問我一些似理由充份的小問題，都坦率回答。<br>八日，我再次呈一篇有關佛法的重要問題及陳情書給政府。<br>十日，收到回文，談及各個不同派別的理論，並提出八大難題。無遲疑、也不畏懼以書寫和口頭回答，寧瑪派與噶舉派的弟子也由此獲益不少。不過除了少數人外，一般人很難了解此文。<br>這些問題的產生，是由於哲蚌寺及色拉寺某些重要人物，對我一些著作的成功覺得不高興，主要的唆使者是祖普寺嘎榮組織的人。<br>二十日左右，駐西寧的中國欽差大臣來到拉薩。<br>二十五日，新總理多仁班禪夏仲才仁旺嘉，下令拘捕殺死已故總理的中國士兵。其中二十人被處決，我為亡者超渡及祈願，希望他們能不墮入三惡道。<br>二十六日，一些中邪的大官，阻止修迴遮病敵法，接到此令，不得不暫時答應，此對西藏毫無益處。<br>達賴喇嘛的老師諾顏呼圖克圖捎來訊息，宣明中藏、康區及蒙古的人民都是同一信仰，他本身非常尊敬蓮花生大士，除請我繼續作一位自由的行腳僧外，還有一些令人高興的話。達賴喇嘛也傳來訊息，說我毋須長期留在拉薩。<br>第十七章<br>五四攝尼泊爾王 修建天然大佛塔<br>應達賴喇嘛要求 拉達戰亂往調解<br>鐵羊年四月一日，西元1751年，五十四歲，離開拉薩，前往炯宗石的僻靜處。已與許多官員們產生了濃厚的友情，因此猶豫難捨地與他們別離。<br>由甲區出發的途中，覺得一切相如幻化，在慈悲與空性和合中，妄想如蛇結自然解開般。<br>在多隆，面臨一些惡劣的自然環境，不得已而使用了政府所送的交通工具繼續前進。<br>九日，到達吉岡。<br>十日，依黑行者阿闍黎的法門修上樂金剛薈供。竹千法王送來一尊度母雕像、七錢金子、許多生活所需品及祈請長壽。在康區的夏瑪巴祖古及大司徒仁波切也沒忘記，特意派專人送信及禮物並祈長壽。這些都是好預兆。<br>十一日，旅途中來迎接的馬隊以表演款待我們。在僧侶彈奏樂器下迎接，抵達祖普寺時，突然刮起一陣暴風，是歡迎的兆相，我先到夏瑞佛堂覲見頂禮偉大的大寶法王。<br>稍早，祖普寺的仲巴祖古到大門口迎接，他的身體相當健康，談吐及思想也跟以往大不相同，實令人高興。稍後，我傳授時輪金剛六加行及其他法門予上述師徒二人及卡波覺的祖古。<br>二月十五日(祥旺仁波切等人視為佛誕日) ，根據經上的字句，無增減、完整地傳授中觀派的菩薩戒給師徒三人(夏瑪巴、大司徒、大寶法王)及嘉察仁波切。<br>“自覺既無智慧、持戒不嚴等諸多缺點，並非擔此重任的適當人選，但曾由具德上師處得此傳承，他們為求得此傳承，曾如溪水涓流不斷般地請求，的確顯示具格弟子[ 符合密續所說弟子的條件，此處指三門清淨的持戒者。]的德性。自己深覺不具經典所示菩薩資格傳此法門，而祈求佛陀、菩薩眾及護法神原諒。”尊者謙虛的說。<br>總括而言，停留此處的幾個月，大部分時間浪費在政治性活動上，只有極少時間修研正法。<br>在拉薩，宗日及後來的駐藏大臣一位接一位到來。普巴天成海曆新年，多仁班禪被削去總理職位，貶為普通大臣。<br>一月十一日，甘丹康薩被調到多仁。<br>二月一日，政府收回十月十五日下的紅印。後來的印信顏色與之前的無異，令人驚異。<br>為了避免無謂浪費信徒的供養，製作了一把價值一千個金幣──以北蒙古黃絲、珍珠及珊瑚鑲嵌的傘，委托赤加德旦卓瑪夫人，三十日(根本上師生日當天)供養於桑耶寺的佛陀雕像上。<br>此際，多傑札寺及敏珠林寺的主事、總管及重要僧侶們被召往拉薩審問。拉薩大多數精英分子相互藐視，不合作的狀況猶如針尖上的氣球般，這些是頹敗的明顯兆相，令人悲痛。<br>三月二十日，得到第三世大寶法王──讓炯多傑的加持，證悟更多佛法的道理。<br>阿里區王后及弟弟、尊者竹千法王的代表羅日巴喇嘛、山南區的德察祖古等人，相繼到訪，都如願的傳予他們想要的法門。<br>達賴喇嘛遣送一位隨侍帶來關注及詢問一些預言，雖然知道未來會發生什麼事，卻也不敢洩露天機，只能給一些暗示，達賴喇嘛已經很高興的送來一個銀製的小曼荼羅盤、一些鍍金的銀罐及其他東西等禮物。<br>三月十日夜晚，夢到穿戴花鬘的大自在天，應是這些大神祇及天界也在看顧我。<br>孩童時期，曾對夢境很有興趣，但近年來，不再重視也不寫這些了，空行母也曾示意停止寫這些，聖哲們亦確切說過：“夢中，見神勿喜、見鬼勿憂。”<br>在定中確實可以如此，但人在世俗境界中，見鬼往往會起憂心等不好的覺受，見神則覺歡喜及舒服等，蘊界在成為不變的大樂智慧身之前，會有平等與不平等二元對立的心念，夢境亦如此，除非悟到圓滿清淨真如，令一切善惡分別妄念消失於實相中。<br>一般說來，夢境好或壞的定義以視能帶給作夢者快樂或痛苦而定，但這些實稱為修行過程中的覺受或徵兆，這與以上所述相應。<br>此時，支持假夏瑪巴的蔣謝瓦使用盡心機、自認聰明地說：“將邀請一位大人物至工布地區。”假夏瑪巴被從南喜林調回，他的支持者恰過巴的轉世被任命進入達賴祕書室，帶來一些毀犯三昧耶戒的人作為侍從，做了很多錯事，他們重提舊案而再度引發爭論，由於無法親自前往而一再派人向布達拉宮的官員解釋。<br>夏瑪巴大師的主事貢波花了很多時間在拉薩，耗盡財物。巴窩仁波切對此案也憂心忡忡，暫時先以修法來維持內部的團結。<br>夏瑪巴大師如果能留在中藏，事情就會和解，若能取得達賴喇嘛的批准，讓他到康區的德格，事情會更加好轉。<br>前年火虎年，在拉薩的桑竹宮，曾有位看不見的身影說：“成就東方之宏業。”那時，語意不清，但覺是大寶法王和夏瑪巴大師將到康區的兆相。<br>祖普寺曆算的四月二十五日(藏曆的三月)，大寶法王將到拉薩向達賴喇嘛致敬。<br>依據預言：“如果黑帽冠及紅帽冠兩位法王以師徒關係善緣無間，將來會合而為一轉世，除此之外，其他人不可用噶瑪巴的名義帶黑帽冠。”此依第十三世大寶法王的意思寫下，蓋上橘黃色手掌印及印章，交給巴窩仁波切、大寶法王的主事們、夏瑪巴大師和我。<br>我因感冒生病，無法遠行相送，就在大門三頂禮，接受加持。他(大寶法王)將住在拉薩的西那卡。<br>二十六日，吉星高照的日子，經過一個半月的工夫，建築專家秋札完成吉岡佛塔。結果雖不令人滿意，仍將此功德迴向証悟之道。<br>我必須馬上離開祖普寺，但拉薩的南朗巴及噶些等人有要事待辦，堅持我留下。因此，遣人去拉薩布達拉宮呈遞申請書，他們欣然批准請求。<br>大寶法王在拉薩逗留一個月，大小民眾都對他深懷敬意。藏曆四月二十四日，他與達賴喇嘛會面，達賴喇嘛起座迎接。總之，此次事情進行的比較順利。<br>五月五日，法王回到祖普寺，我前往接迎、頂禮並接受加持。<br>大寶法王在拉薩時，止貢噶舉法王及弟子曾派人送禮致意，現在也送至此，他們的關係日益親密。<br>我雖然原先只打算在祖普寺停留幾天，但實際卻整整待了六個月零五天很長的一段時間。<br>此時西藏的局勢，外有強敵、內有紛爭、中間穿插許多謠言。大寶法王及夏瑪巴大師的眷屬，對此有不同的態度，令人疲累地猶如掉到滿是荊棘的灌木叢般難受，不過，這一切都安住在大手印界中成平等一味！<br>當夏瑪巴大師坐床典禮後，我的責任已完，曾告訴自己將來不希望參予這些俗事。但在此關鍵性的一年中，有重大的改變，一切對兩位法王有益的活動不得不隆重盛大舉行。這些都由於以前願力及因果的相互作用所成，亦頗覺歡喜。<br>此時，很多兆相顯示，中國與西藏的鬼神有極大的衝突。大寶法王自拉薩回來時，惡鬼亦尾隨而至，因此舉行了三分食子及煙供法會。<br>我寫信給夏瑪巴大師及大司徒仁波切，派專人送達。如以前般，再度祈請大司徒仁波切撰寫《噶舉金鬘》、梵文《旃陀羅波字經》的注釋和一些密續法本的翻譯。信的結尾，寫上長壽祈請文及法輪常轉、正法恆住的祈願。<br>道歌曰：<br>紛爭攪亂的時間之海<br>十方產生危險和恐懼<br>然而 從蓮花生大士的慈悲裏<br>我們找到一線生機<br>福德的大船以智慧之釘堅固<br>船帆被功德之風<br>吹往正確的方向<br>許多聖者無畏無倦地<br>前往快樂之洲<br>滿載眾生的解脫大船<br>駛達究竟的彼岸於彼處休憩<br>這是大成就者們的事業<br>“若要廣說這段往事，會很費時，就略說其中幾件，以後再詳述。”尊者如是說。<br>之後，尊者也沒再寫傳記，因此也就無法再詳細說明。<br>不過，在他給宗教及世務的無上領袖七世達賴喇嘛噶桑嘉措法王的信上寫著：<br>“離開祖普寺後，停留在西藏中心烏如幾天，以溫泉來治療腳疾。傳授觀世音菩薩法給一些具緣具信者，勸他們時常持誦六字大明咒。”<br>來自各方不斷的乳酪及酥油餅等的招待和邀請，妨礙修法而令我厭倦，冒著大雨離開彼處，越過丘佩拉隘口抵達岡卡。<br>前次的食子供，普遍受惠，對當地的人畜尤有助益。此次的食子供特為利益鬼神。<br>從容地到達西藏史上記載為四位行母聚集聖地之一的薩普寺，曾被目睹空行母聚集，這次也有徵兆顯現，我儘所能作豐富的食子供養。<br>唐拉神(即年欽護法)及俱誓金剛要求我，應該做些能避免西藏受外來侵略的事，自思如我這樣的凡夫無此能力，就擱置此事。<br>在嘉措普宗，好幾尊如來佛像的雕塑完成了；給予漁民和獵人們很多稱心如意的物品，他們高興地答應三年不殺生，並安排一位可靠的人監督。<br>此時連續好幾天有惡魔起亂的兆相，如果很強烈，動亂會來得早，如果微弱，動亂就會來得慢且短，慶幸的是這次的動亂不久就結束了。<br>隨後前往蘇康第三世大寶法王讓炯多傑建立的寺院、亦被視為多傑林巴取出伏藏的地方。當時，感覺到男惡鬼的不悅，但心無罣礙。<br>於此處，傳授妮古空行母六法給許多信徒們。<br>越過夏過定隘口，在阿拉普的僻靜處及巴雅的遊牧區，給予長壽灌頂和勸持六字大明咒。<br>之後抵達甲區。那時，極少接受供養，僅有的少數財產皆布施，用於每月十日固定的修持六字大明咒及祈請文。<br>在甲區時，考慮重修尼泊爾的閂布(蘇瓦揚布)大塔。佛陀的經典裏記載“此塔是寶頂髻佛兩眉間的白毫放光所造。”佛陀多位弟子的著作、佛塔的目錄、尼泊爾聖者和西藏佛塔的目錄等，皆記載此事。<br>根據可靠的原始資料及印度較為人知的事實，世親菩薩從印度到尼泊爾時，曾瞻仰過此塔；阿底峽尊者到西藏途經尼泊爾時，瞻仰過此塔；許多西藏學者認為這是牛角山的果馬薩拉甘達(閂布、蘇瓦揚布佛塔)、佛經裡預言的佛塔，藏人稱為帕巴香根。<br>大塔隨著時間的流逝而破損，早在菩提(波達)大塔重修圓滿時，就有重修此塔的想法，但有時緣起不具足、時間變遷、財物不具足等等因素而成障礙，後來自忖：就算無法圓滿重修，只是豎直主軸、屋頂鍍金，亦功德無量。<br>季節並不適宜，尼泊爾天氣燥熱，為了令佛陀歡喜，我不在意身體遭受任何痛苦，決定前往尼泊爾。<br>在甲區，將所有信徒的供養換成金及銀。途中在覺囊大塔做燈供，些微的護持僻靜處，在從前接受百法傳承及時輪金剛六加行灌頂的金剛阿闍黎大悲成就者舍利塔前，依密續所載，如法的行外內密薈供及修法一星期。長久以來，對升起心寂究竟智的疑惑，此次完全明白了！我非常明瞭，這是供養上師舍利塔的殊勝功德，因此更具信心。<br>收到尼泊爾王和廓爾喀王的回信，聲明不會反對我重修閂布(蘇瓦揚布)大塔。越過拉才的加措拉隘口，來到世間十三聖山之一的嘉吉師利聖山時，親見尼泊爾人禮敬的六面天及象鼻財神，明白此是邀請我到尼泊爾的兆相。<br>在祖普寺時，覺得如能為達賴喇嘛的長壽作祈請，定會有利益。後來，聽到一位學問淵博的侍從曾為他祈禱長壽的訊息。這次，我也在許多聖地為達賴喇嘛的長壽祈請，生起很大的信心。<br>不管如何，以清淨及虔誠的心意，派遣侍者丹增多傑去拉薩，供養達賴喇嘛長壽祈請文。信中並述及會去佛教希傑派信徒的主要聖地定日縣朗闊。<br>從那裡，經由西藏四名湖之一暨貢嘎夏美神居住的巴默巴唐和吉隆，前往尼泊爾，能否取得修塔所需主軸的木料，還需靠廓爾喀王的善意。<br>我寫了一封信給西藏政府：“上次受邀到宗朗、尼泊爾及隸屬印度一部分的提拉賀提國拜訪的事，我並無答覆。<br>今年，本打算去不丹的達倉，對尼泊爾王的特別盛情邀約及自己上次重修菩提(波達)大塔圓滿時曾發大願重修帕巴香根(閂布、蘇瓦揚布)大塔，在龍年無法做到。<br>蛇年年終時，又必須擔負解救公大人隨從性命的重任，終究也未能完成。<br>馬年年尾，又由於政治的變化，必須去拉薩而更加耽擱了。今年，尼泊爾王堅持我須前往，他寫一封信給廓爾喀王，請求提供做主軸用的木材，也得到答應了。因為門巴(廓爾喀)的國王很容易改變主意，為此我特派專使，獲得他堅守上次承諾的答覆，情況就是如此。<br>從以前至今，我了無積蓄，所以無太多可以捐獻的，大概很難圓滿佛塔的整修。<br>為了去尼泊爾，我來到巴唐附近的上曼卡區。又接到拉達克王的請求，他過去經常寫信邀請我去拜訪。<br>年輕時，本有拜訪鄔金的打算，途中也可順道探訪拉達克，但因夏瑪巴大師事件，被困在中藏很長一段時間。<br>現在上了年紀，又出身自偏僻的邊遠區，不會也不懂得逢迎和讚美，所以也不合適親近皇室大臣，現在您知道我的這些缺點了。<br>本身亦深覺若能使拉達克統一，就能避免因上蒙古的侵略而引發的戰爭，似乎也是一件功德，但目前我決定重修佛塔，無興趣到該國。<br>再說，蓮花生大士曾預言：“上蒙古會在鐵狗年侵犯。”而這也有幾個週期，一個是火羊年之後的鐵狗年，前藏及後藏有衝突，蓮師預言：“在芒隅的邦巴山上作一場法會，可以避免災難的發生。”為此而修法。<br>修法中，得到預兆“外來的侵略已被延後二十五年或三十七年。”尚有其他方法可更進一步避免，但必須因緣具足，否則無效。<br>我將這些重點告訴弟子，但沒有告知一般民眾。也告訴一些領袖人物，但這些人只希望聽到讚美等好聽的話，我的忠告，只贏得他們的嘲諷。<br>如果此時能做進一步的修法，就能得到相當大的利益，能更進一步避免一切災難。<br>當我在康區，曾得到預言“在中國三次干涉西藏的朝政後，上蒙古的侵略必定會來臨，構成危險。”<br>木兔年，蓮花生大士的預言出現，指出：“如果能發掘巴卓達倉的伏藏法，就能促使西藏領袖及大臣們和解，全西藏就能安享和平及繁榮。”<br>不過，曾受過總理照顧的一些高階喇嘛卻挑撥說我是這個或那個人的朋友，以至於好幾年間，我的問候信都被拒絕。既然無法引起對這些事情的注意，就讓它冷卻下來。<br>同樣依據蓮花生大士預言：“須為達賴喇嘛的長壽祈請。”但我要求做此事時，政府的回答是：“區區一個瑜伽士，竟敢在三大寺院前如此膽大妄為。”了解到該保持沉默了。<br>“現在我這個將消逝的老瑜伽士，很難做對全西藏人民有益的事了，最好將以前得到的稀有傳承弘揚到僻靜處。如果不行，就自做修行及迴向祈願。如果連這都不能，就悠遊自在地過生活。”我如此想著，目前也並無計畫去內地。<br>如果有完成重修閂布(蘇瓦揚布)大塔的因緣，會報告諸神及人民的怙主達賴喇嘛，徵求意見及同意“希望大塔重修完成時，回到康區的邊遠地帶。”<br>多年來，我也一直收到德格王和其他統治者的邀請信，很多寺院派人邀訪，我可以很自在的竭盡所能獻身佛法。抵達尼泊爾時，會有更詳細的報告。<br>鐵羊年年終，尊者經由吉隆前往尼泊爾，所到地方，無數大小僧侶及在家眾爭相前來相見，尊者公開給予灌頂、傳授金剛上師口訣、金剛百字明和六字大明咒等等，也應許多信眾請求，傳授各種法門的口訣及講解。<br>第四次抵達尼泊爾，重修閂布大塔。<br>抵尼泊爾，統領百萬人民的大國王吉巴兒巴巴雅和大臣，騎著華麗裝飾的大象及馬，前來迎接，尊者被安排遊行一大段路，使廣大群眾能瞻養尊容，後來被接待到閂布(蘇瓦揚布)大塔所在山丘附近小山上的給多寺。<br>在給多佛堂，應多瑪巴旺秋多傑和作者的上師成律敦珠的祈請，尊者傳予淨相伏藏法的《蓮師願望任運法》灌頂、《北方伏藏意成就法》灌頂及講授法門，並講解了虛空瑜伽阿噶兒瑜伽士法。<br>皇宮內有座被游泳池環繞的花園及毗濕奴神廟，遍植奇花異樹、放養著各種珍禽異獸，美不勝收，尊者住此時，寫下《普巴金剛寂忿百尊了義精滴》儀軌。<br>在閂布(蘇瓦揚布)大塔附近的文殊師利菩薩佛塔，傳授《北方伏藏普巴金剛》及其他灌頂給多欽的大瑜伽士嘉喜桑給和許多喇嘛們。<br>十一月的一個吉祥日，舉行了整修閂布(蘇瓦揚布)大塔的開工典禮，象鼻財神及六面天現身對尊者承諾：“因為你以對佛陀教法極虔誠及恭敬心重修此佛塔，我們會助你整修工程所需的金銀及物資。”<br>毗濕奴神化現成一婆羅門人來告知何處及如何取得佛塔的主軸木材後，就消失了。<br>由於這些大神們的現身幫助及尊者的慈悲力，請尼泊爾王(師利師利吉巴兒巴)和廓爾喀王(波若特那拉雅那)立即運來主軸的木材時，都立誓答應全力護持。<br>開始準備製造佛塔上方十三層法輪的銅與金時，尊者想到將來很少有人會再承當這樣的重修工程，即讓工匠以很厚的銅作十三法輪、傘蓋等。<br>繼尊者給西藏政府的上一封信，如此報告：<br>“謹告！十一月十五日，我自嘉吉師利啟程，渡過崩河，來到定日縣！”非人威神岡瑪等來表達他們的喜悅與歡迎，獲得很多重修工程的金子。<br>在朗闊的一座殊勝大塔內，有尊帕當巴大師融入的雕像，稱為“自身融入像”，帕當巴大師曾讚揚此地有如金剛座菩提迦耶。駐留此地時，日夜供酥油燈，也為了眾生而舉行大食子供及消災火供。<br>在薩迦派八思巴大師興建的四佛堂之一松給定，畢瓦巴大師親自傳授《道果》給珀東無畏尊，最後融入牆上的(畢瓦巴)大師畫像，尊者在此盡己所有供養此具大加持的畫像、發清淨願及迴向眾生。<br>經由上、下曼卡區，穿過巴默巴唐，越過蓮師前往羅剎國經過的仙女夏瑪山附近的貢唐隘口及夏久隘口，抵達宗卡，停留數日，在非人神祇處作豐盛食子供，祈求教法的持有者長壽住世、恆轉法輪、人民安樂。<br>摒除萬難，給予三或五百、有時甚達上千至三千等人長壽灌頂，尤其是六字大明咒的口訣，也要求十二歲以上者每天至少持誦三百遍六字大明咒。有時也傳授菩薩戒，雖然不完全具格，目的在鼓勵信眾們虔誠修善。<br>抵達吉隆，在絳真格傑寺滿願觀音前，如往般地供酥油燈及虔心祈請。很多村莊的人們來請求灌頂，全部拒絕了。<br>十二月二十二日，啟程前往尼泊爾。在往女神金剛賽星住所賽唐途中，收到您的命令。<br>既然已經進入尼泊爾，決定去賽唐蓮師聖地一次行豐盛薈供。<br>抵達甘南國河[ 亦即半圓天門的洞穴。]岸邊的巴如後，再到尼蘭甘他山河岸的岡陀東朗。對具多種方言的達芒人傳授食子灌頂及六字大明咒口訣。<br>我們由那裏花了三天時間，穿過桑給巴那的稠密森林，經由波卡爾，度過吠陀經典稱的“祕密恆河”，在擦巴擦秀停留十五日以取得主軸。<br>當地人想要學習明咒，透過翻譯，傳授小灌頂給許多婆羅門徒。廓爾喀王以虔誠和恭敬心欲來請求咒語，卻原因不詳的耽擱了。<br>尼泊爾的木匠沒有依約準時到來，我很不悅。在前往尼泊爾途中，我們遇到他們，夢中得到指示，最好在那裡停留幾日，但我急於趕路。<br>尼泊爾王捎訊，要求我立即到他那裡，我僅告訴捎信者：“要求兩位國王寫下，在主軸未準備好前不會發生紛爭的約定書。”我們繼續走向山谷。<br>在那噶木兒，尼泊爾王與數萬群眾前來迎接，我吟誦著佛陀聖號、真言和祈願文，心裏想著佛陀的四手印，在數萬人簇擁下，進入鹽布城。<br>想起無常，晚上無法入眠。我們住在閂布(蘇瓦揚布)佛塔附近尼泊爾人稱為康多的古老佛堂，不斷的對閂布(蘇瓦揚布)佛塔頂禮與薈供。<br>本來想供奉菩提(波達)大塔，但很久以來，當地人不如法的使用供奉品而引起爭論，所以只以五十銀兩供油燈，省去其他的供奉品。<br>在尼泊爾，最急迫的工作就是完成鍍金銅製的法輪。國王也很認真負責，但當地工匠習慣作業緩慢。<br>修建閂布大塔中間，奉命解決拉達克糾紛<br>為了避免拉達克發生戰爭，接到達賴喇嘛再度命令，因事態緊急，馬上出發前往拉達克。<br>在印度菩提迦耶北部(即喜馬拉雅山北部)有四座雪山，西區終年覆雪的雪山為阿里三區，印度河由此流向高山環繞的拉達克，有一條商道通往新疆與蒙古，統治者的祖先是印度人。<br>拉達克王朝從未有紛爭或中斷過，現在才有叔侄之爭，可能引起新疆楚人的干涉，危及整個西藏的和平。<br>西藏大臣達利巴度最近成為政治陰謀下的犧牲者，後由身現比丘相的怙主法王達賴喇嘛七世噶桑嘉措接掌政權，由於拉達克國王間的政治內爭，導致有一觸即發的戰爭危機。<br>達賴喇嘛懷著對拉達克人民極度慈悲的襟懷，無法忍受這種情況，因此致函拉達克王，但都無回音，如此情況下，調解甚為重要，但任務艱鉅，無人敢自動請纓前往拉達克。<br>反對尊者的人煽惑行政首長多仁班禪，使他對尊者極為忿怒而向當局推薦：“這次需派人前往談判並帶回雙方的協議，無人敢接受這個任務，而最可能承辦的，只有拉達克人要求的仁珍千寶。”<br>達賴喇嘛依此意，命令議會，由達賴喇嘛辦公室及議會先後發函至尼泊爾之悶開多、才唐及給多給尊者。<br>尊者回信寫道：“謹覆來信，佛塔的修復工程雖已開始，但鑒於拉達克事態緊急、達賴喇嘛的命令及大臣們有力的說服，不得已先停止修復工程。”<br>第十八章<br>五五顯神通 制服拉達王<br>尊者自述：<br>我們決定前往拉達克。水猴年，西元1752年，五十五歲，三月二十日登上旅途，隨即抵達久給阿噶。寫了一份報告給達賴喇嘛，也去函拉達克王和大臣們，希望在我到達前勿輕舉妄動。同樣內容的信也以快騎送交竹千法王，要求他寫封合宜的信到拉達克。<br>漸抵芒隅的吉隆，拉達王子瑜伽士嘉西桑給已經往生，收到些供養，請求在絳真和帕巴為王子點燈超薦及迴向，也為他畫了幾幅唐卡，其中三幅為普賢王如來佛父佛母、寂靜與忿怒百尊，背面寫上祈禱文後，送給他的兒子久美南嘉。<br>路經隆大，在札卡達索寺(密勒日巴成就處)門前，給予住持喇嘛四灌頂、群眾長壽佛灌頂。此時，隨團僧人約有百位，遣送幾位到康區。<br>因水土不服，有些人留在吉隆及羅保索兩地。後由四十位弟子陪同，經上藏的雪山噶兒到西藏與拉達克邊境的蓮花生大士聖地“白山勝樂金剛”。<br>上拉達克王子先派數人前往雪山迎接，另外又派六百人相迎；下拉達克的木比郡王札西嘉南也派四百人來迎接，因我的堅持，最後兩地僅各派一百人及八十人前來相迎。<br>也有人要求我住在中拉達克，未接受而決定在靠近噶兒的王來進行調解，並送一份說明到拉薩的西藏政府。<br>在王來住處附近一如門神般的大力神祇前作食子供，祈求支持解決拉達克的政治紛爭。<br>有天，在“白山勝樂金剛”洗溫泉，適逢藏曆二十五日，又作了食子供，原有非人的干擾就此平息。<br>拉達克國王朋措南嘉及大臣們在王來為我們舉行盛大的歡迎會，八月十日的薈供也在此舉行，僅下拉達克的木比郡王未到，但仍派遣大臣參加。<br>大臣告知，中拉達克曾遣使者到喀什米爾，在使者身上發現一封喀什米爾的回信，內容提到：“如果拉達克人攻擊叔叔，他們會派遣援軍。”<br>國王朋措南嘉以道路被封無法前來等為藉口，沒有依時來與我會面，感到很生氣。<br>我接受達賴喇嘛的命令，因應此地人民希望，放下修復閂布(蘇瓦揚布)佛塔的工作，一路千辛萬苦來到拉達克，但現在身為調解者和遊方瑜伽士的立場不同，責任重大，因此要有更多的包容心和耐心。<br>此區的男鬼作祟，事情不太順利，入禪定中降伏。<br>拉達克王朋措南嘉及大臣不該知道我要前來，仍然派遣使者向喀什米爾請求援兵，使者被木比郡王扣留，為此怪罪而封鎖道路。<br>質問為何向喀什米爾求援？回答：“在知道您要來前的羊年十一月，就已派使者到喀什米爾。”<br>而木比郡王的大臣說：“在接到您的信前，就已扣留拉達克的使者。”<br>召集雙方老臣，縱然他們承認也必須知道，西藏人民的怙主達賴喇嘛是為了所有人民今生與來世的福祉，才派我來此調解。<br>為他們分析兩國和解的好處，不只為現在、更為來世，兩國亦應與喀什米爾保持良好關係，引起軍事干涉最為不當。<br>喀什米爾政府表面雖然答應幫助雙方，事實卻施行分裂拉達克的詭計，因此不宜到中拉達克，木比郡王札西南嘉應該來此，拉達克使者及喀什米爾的來函也應立即釋回，這些重點都須了解。<br>另外，一旦喀什米爾的傳染病消滅，應恢復商業活動，既然沒有戰爭，問題應可解決。於是，拉達克提供馬匹給木比郡王的使者。<br>曾派使者邀請拉達克國王朋措南嘉到此共商，但他希望我能過去而未到王來。<br>聽說國王小時候聰明伶俐，現在卻有精神障礙。無法推斷他們國家內政長遠的狀況，但目前急需讓叔侄和解。所以，又派遣使者邀請他。<br>喀什米爾會出兵的謠言可能不實，如果確實，損害將極慘重。致函拉達克國王與木比郡王，同時致函喀什米爾的那瓦，內容宣稱叔侄已經和解，因此不需派兵或派人來談判。<br>謠傳喀什米爾的那瓦人想要侵略西藏，若謠言屬實，我更不能擴大宣傳西藏派人協調和解的事。八月下旬，我派使者進行此事。<br>由於共業的結果，社會蕭條，情勢更須避免外國干預。注意邊地的情勢非常重要，事情很嚴重，不僅大事，連小事都需謹慎處理。<br>喀什米爾邊境的拉達克人民都非常感激達賴喇嘛政府派我來此，若非如此，在仲夏前可能爆發嚴重衝突與混亂。<br>他們說：“當春天聽說有喇嘛會來調解時，雙方都鬆了口氣。”這是事實而非說表面話。<br>修復佛塔有很大功德，而接受達賴喇嘛的命令來此調停，對眾生與法有更大利益。<br>我覺得達賴喇嘛知道世界看不見的祕密，拉達克人民也因此得到和平與安樂。<br>雙方已定下和解的日期，使者已派往喀什米爾，叔侄間的衝突，基本上不嚴重，因住在皇宮內的木比大臣女兒教唆，國王又完全支持她，是錯誤之舉。<br>拉達王子(海昧寺的祖古)和國王朋措南嘉告知：“木比大臣用欺騙的手法，已佔有三分之一的土地與人民。”皇后與其他大臣因此對他們動武。<br>由於大臣的家族七代為竹巴學院的功德主，海昧寺因此極力地保護大臣及其女的性命。<br>如果他們願意選擇宗教生活，可留在寺內，但他們寧願逃亡，若他們態度強硬，和解反而困難，現在談判日期將屆，這些將在適當時機中解決。<br>對我犯的疏忽與罪過，請惠予寬恕，並請繼續賜予指導。<br>木比郡王及大臣對我更有信心，上拉達克的拉達王子和皇后也很尊重我。<br>這邊出現一些不祥徵兆的傳聞，有偽裝成小孩在喀什米爾邊境的路上乞食，有變成駱駝助人或害人，新疆邊境某地大魚從河裡跳出，羚羊說人話，大洪水從祥雄苯教區的護法雜目瑪神山流下，曼薩若瓦兒湖發出雷響聲及火花，諸如此類難以驗證的傳說此起彼落。<br>印度正處於腐敗期，大小統治者們相互爭鬥不休，達給國王的弟弟毫無道義的搶奪王位，巴坦的幾十萬軍隊正與德里打仗。<br>給達賴喇嘛的信中提到：“瑪友 (拉達克古名)也因各種散佈的謠言引發內戰。因眾生業力及惡鬼干擾，朋友反目成仇，父子、兄弟姊妹、主僕不再互相信任，誠實工作的人不再有權力和獲得支持，甚至說話前後矛盾，情況很不明確，因此無法詳細說明。<br>而雪地西藏觀世音菩薩的化身──達賴尊者您以慈悲的力量，使人民生活繁榮安定，真是人民一大福祉。”<br>拉達王子與皇后前來迎接尊者，決定於三月舉行談判。開始時很困難，各種流言擾亂民心，困擾尊者。尤其是木比郡王札西南嘉不顧命令，不能即時前來，使事情拖延數月。<br>尊者本來計劃拜訪日帕、曼弟、岡格力等地，也因此不能成行。<br>尊者不斷地給予大規模灌頂、口傳及口訣給拉達王子、米旁江巴多傑國王、大臣及不同學院的僧侶和信徒們。<br>為了降伏這些煽惑人心、引發戰爭衝突及外國干涉的惡鬼，及對國王和西藏人民陰謀不軌的人，尊者自己供養茶水及兩百銀兩予上千僧侶們，不斷作食子供養、修法為眾生祈福。<br>在龍樹聖僧供奉過、阿底峽尊者加持過的十一面觀世音菩薩前，尊者傳予僧眾及信徒們大乘八種別解脫戒之菩薩戒、比丘尼師利摩得傳承的十一面觀音灌頂及六字真言的口傳，並應多人要求，寫出十一面觀世音菩薩八關齋戒及其他本尊的修持儀軌、蓮師祈禱文、文學作品及教言等。<br>尊者此行，除了一些皈依者的供養外，沒有收過任何與政治任務有關的一分一毫、甚或一朵番紅花的供養。在拉達克的一年半間，只接受當地人供給的一些柴薪，所有的生活必需品均由自己的財產支付，沒有給上、下拉達克國王帶來任何麻煩，不僅自己，也明令隨行者不得接受任何物資。<br>花了很久的時間，木比郡王札西南嘉終於受到尊者的精神感召。他到達時，以未馬上獲准謁見尊者而感到惶恐不安，幾度要求謁見後，終於獲准。<br>見到尊者，不禁昏倒。醒過來時，渾身顫抖，祈求尊者寬恕他遲未出現，並立即答應完全接受指教。尊者要求制定永久而非暫時解決問題的法案。<br>為了表示悔改，國王供養尊者一百個印度銀幣，尊者說：“我接受你遲到的道歉，但除非事情解決，我不能接受你的供養。”因此供養全數退回。<br>和談方面，尊者已掌控全局，只要下一道命令，即可解決問題。<br>佛陀的教法為隨順學生資質而因材施教，且若不讓雙方表示意見，恐將招致批評，因此尊者遣親近弟子及鄰長為代表與有關當事人會商。<br>如同中土[ 指西藏。]法律所陳，各國依照原來的風俗習慣，國王需經先王、種族的加冕授權，經由見證人三、四次反覆地詢問及反詢問，此條例各部落必須尊重，這與符合真理多少並不互相抵觸，而是問題嚴重，需要慎重處理。<br>處理妥當後，寫下協議書，要點一一清楚明瞭列出，協議書最後由國王叔侄、大臣及見證人共同簽名、蓋章，在水猴年十月下旬雙方簽署。<br>身為轉世的拉達王子不適合參與政治，可能導致僧團的戒律式微而危害佛法，要依照佛陀的規定嚴守僧人戒律，才能得到追隨者的激賞，引導自己及他人走上解脫道。<br>這幾點，已對集會大眾嚴肅宣說。另外，也為海昧寺的僧侶制定簡要寺規，令循遵守。<br>由於因緣及任務的關係，先前尊者雖數次被請求而未同意前往拉達克王宮，現在因這些協議的事情必須處理，且國王、叔侄、一些重要人士和人民極力請求，尤其是一些非人及大金剛母的強力說服，尊者在盛大的歡迎中前往夏宮。<br>尊者再次告訴國王們：“要照顧人民的福祉，大臣要遵守政策。”嘿那斯庫郡王也從木比郡王的父執輩桑卡郡王尼瑪南嘉手中取回土地所有權。<br>第十九章<br>調解各邦國糾紛 平息拉達克戰亂<br>七世達賴頒獎賞<br>有關喀什米爾與拉達克間往來經商協議的文件，被翻成五種譯本，刻記在銅盤上，分送給各國政府。<br>水雞年，五月二十八日，西元1753年，五十六歲，尊者向大眾公佈這份協議文，在各政府一致保證遵守下，於六月二日簽署完成，任何政府均不可踰越協議的規定。<br>六月六日，於一幅置於木台上的瑪哈嘎啦唐卡前作護法食子供，各寺僧侶們也聚會禮拜各自的護法，立誓共同遵守協議。<br>尊者為智慧、慈悲與力量的化身，與蓮花生大士無二無別，面露光彩地坐在無畏獅子座上，唸誦著未曾聽過的龍天護法名字及確認的協議內容。<br>畫像與食子置於國王、郡王、大臣和人們的頭頂上，證明遵守協議的決心，所有在場的人對此協議均深具信心。<br>人們慶祝此吉兆，這些全在呈給尊者達賴喇嘛的信中提到：“根據要求，在王來與國王、叔侄一起協商。經過一個月討論，最後在此締結條約。<br>我本不打算到上拉達克，但國王叔侄極力要求，為免將來引起批評，協議必須由長者做最後決定，僅管拉達王子在場，但皇后不在，木比國王和大臣仍不願作決議，且拉達克木比郡王妃懷孕，急著回國待產。<br>拉達克國王和皇后於五月七日動身前往列城。我主持了若干儀式後，隨即與木比郡王於十一日一起動身前往拉達克首都，適逢王來河水上漲期，旅程非常艱辛。<br>很多印度瑜伽士認為拉達克即二十四空行淨土的瑪入，至今在噶夏附近，仍有一座由印度藝術家蓋的佛堂，裡面即有一塊名為姆指瑪入的石頭。<br>另外，拉達克境內除了榮地區外，草木稀少，到處佈滿沙、卵石和銅般的岩石，由地上結冰的情況，才能分出冬或夏，這些亦與瑪入的環境完全符合。<br>經過這些地方，終於快到海昧寺，想留在此地，但地母事先已宣布我將先去夏城，王子與皇后也已到彼處，所以我也在十一日到達那兒。<br>抵達時，人很不舒服，以致無法處理該做的事。又急著想要前往尼泊爾，因此每天趕著處理協議的事，做更多的談判，討論達一個月之久，更確定在王來協調拉達克叔侄問題及引起喀什米爾窺視問題的決定是正確的。<br>延誤許久，整件事終於在六月七日完成，並於十一日對大眾宣讀協議。<br>十二日，上拉達克大臣及我等僧侶們被送往列城，木比郡王占領的財產物歸原主，召集喀什米爾商人及拉達克人，除了宣讀經商協議的文件，並以各自的語言雕刻協議書的內容在銅盤上，發給他們各自帶回國。<br>十三日，上達拉克和下拉達克奉獻金、銀和極好的喀什米爾番紅花，但全部未接受。<br>為了口傳六字真言給具信有緣的人們，來到海昧寺。隔天，傳予萬餘僧眾中觀派的菩薩戒及觀世音菩薩修持成就法的灌頂。<br>此地的惡鬼已稍微平息，但仍要舉行消災法會，此事已坦誠告訴大眾，但大多數人不聽建議。<br>我一再地告訴他們，叔侄和解是達賴喇嘛聖諭的結果，拉達克國王承認此事實，拉達王子欲提供更多的財物給別特和赤才寺的格魯巴學院，我則供養不多。<br>鑒於法王達賴喇嘛的慈悲，我寄了二封感謝函，一封給曾是止貢噶舉寺喇嘛的拉達克高級官員，一封給在我的住處與我會面的木比郡王的大臣。以上為我已做的事。”<br>尊者收到西藏政府寄來的信、禮物、金銀和絲綢，自己也準備了禮物送給拉達克國王、郡王、大臣和喀什米爾的代表，必要時，將一些政府送的禮物也轉送出去。<br>同時，也回送尊者達賴喇嘛和顯要大臣貴重的新疆絲綢及印度喀什米爾金幣。<br>在給達賴喇嘛的信中又寫到：<br>“鑒於法王對人民的慈悲，派我到古時稱瑪友、西藏人現在稱的拉達克，我最遠到夏城，而離開尼泊爾已近一年半的時間。<br>在途中，傳給三十萬人中觀派菩薩戒、觀世音菩薩修持成就法的灌頂與六字真言的口傳。許多人受八部別解脫戒之一，約八百人接受圓滿居士戒。<br>瑪友國(拉達克)統治者與人民間的互相怨恨與不信任已消除，對西藏全體人民的幸福貢獻極大。<br>我願將此等功德，迴向所有如母眾生。願我永遠成為諸佛行願者觀世音菩薩的僕人，消除三界諸苦，得到加持。<br>僅此，祈願聖座雪域的怙主及願所有偉大上師長久住世，願三法輪常轉，究竟了義真理之教法興盛！願得加持，願望得以實現！<br>我的供養很微薄，但觀幻化如普賢供養雲般無量無邊，以一條白如蓮花的哈達和二十七個印度幣、五個巴拉夏國金幣作為曼荼羅供養，隨信並附上九個金輪禮物，請求法王祝我等一切善業迴向無上正等正覺！以上所說，謹祈安住於大慈大悲法性中！”<br>第一位康區來的使者在札頓才會晤尊者，下一位則在拉達克與尊者會面。<br>德格(在今四川)國王索南工波的僧侶弟弟和太太已過世，據報告，為了圓滿他們身後功德，總共供養好幾百銀兩。<br>除這些，尊者也另外供養兩百銀兩印度及西藏幣，修復噶陀寺和十萬佛經堆塔。<br>尊者去函給德格國王索南工波，安排夏瑪巴大師(在噶陀寺)坐床典禮事宜，提到請大司徒翻譯龍年在尼泊爾請到的梵文《度母一百零八名經》，並寄上一些印度金幣作為象徵性的禮物。<br>大司徒後來說這部《度母一百零八名經》與很久以前翻譯的比較，文字及含義上都不同且較好。<br>這前後，也致函請大司徒仁波切翻譯一些以前從未被譯成藏文的《佛說施龍咒》、《象鼻財神咒》及校正一些密續經典，並為《施陀羅波字經》[ 《施陀羅波字經》作者皎月，為印度之聲明學家。]和西藏噶舉巴歷代上師傳記《噶舉金鬘》作註解。<br>又派請德格準備大乘經部十卷、究竟了義二十部六卷的貝葉經，和大學者竹千法王四世貝瑪噶波所著的十卷貝葉經，不久即完成。<br>之後，夏瑪巴和大司徒兩位仁波切到噶陀總寺，有些喇嘛們不滿，但在德格國王支持下，夏瑪巴大師成為噶陀派的教主。<br>尊者本想參訪拉達克附近的札蘭達、喀什米爾和鄔金等地，寫信請求達賴喇嘛批准，然回覆指示：“在密續中提到靜坐思惟勝於朝拜聖地，而印度最近也有一些政治鬥爭的問題，因此最好完成在尼泊爾的修復工作。”尊者再思惟聽過的教法後，打消參訪的念頭。<br>已簽訂的協議書成為很好的範例，紛爭已完全排除，達賴喇嘛及政府寄來很多禮物。<br>在達賴喇嘛囑令下，尊者為了眾生的利益到此協調，促成人民的安定生活，特別是阿里及邊界地區，成功的迴遮了外敵的侵占達六十七年之久。<br>很久以前仍在上藏時，拉達克國王曾邀請尊者訪問，當時沒有接受，但似乎已預知將來會到訪，正如尊者給總理頗羅鼐的預言：“十七年後，會訪問拉達克。”<br>由尊者告訴總理，到真正前往拉達克，這前後正好相差十七年，與預言的時間正好吻合。<br>在建立意義深長的關係、使拉達克人民甚感慰藉後，尊者返回西藏。<br>水雞年年尾，回到芒隅吉隆的途中不斷傳法。在西藏達夏札西岡，與瑜伽士巴當多傑互傳法門。尊者說：“此瑜伽士過去三世曾為我父親。”另送給瑜伽士兒子一匹白蹄紅駒、馬鞍、馬勒、鞍墊和一百個尼泊爾幣，寫信要求他做紅大威德金剛薈供和廣大護法供養。<br>不久抵達尼泊爾的擦瓦擦秀，為了大塔的主軸到金剛伊欣天女[ 伊欣天女：普巴金剛護法十二天女中的四姊妹之一。]居住地德威格達。<br>水猴年時，尊者曾告訴手下：“主軸在幾棵很高的樹裏。”僕人在這裏作食子供時，突然跑出一條白蛇，在其中一棵樹繞了一圈後消失。<br>尊者明白這顆樹就是做主軸的材料，樹根粗有一噚、樹端有半噚粗，高五十三肘。<br>尊者唱了首歌：<br>尼泊爾安寧的擦瓦擦秀<br>是蓮師聖地<br>吉祥神是世界保護者<br>也是藍喉神後裔<br>福源女神是尼泊爾的女神王<br>他們保護那些行法者<br>尤其是賢者持明的護法<br>更是我瑜伽士的親友<br>天龍八部 這塊土地的神啊<br>你們是往菩薩道中的好友<br>不同的人來自不同地方<br>唱著不同傳統的歌<br>我將此獻給萬能的神<br>那些導師信徒<br>及在此聚會的人們<br>為何在此聚會<br>是為了法<br>由此直至獲得菩提間<br>願我們永遠聚會在一起<br>第二十章<br>五七返回尼泊爾 續修天然大佛塔<br>擲打尼王示神通 培養無數聖賢者<br>木狗年新年，西元1754年，五十七歲，尊者回到尼泊爾。<br>在給多時，俱誓護法和勇士們曾答應提供支援，以此寫了一首祈請讚頌文，也將印度的拉那些特那真言翻譯成藏文。又為了主軸，再度到擦瓦擦秀。<br>尊者去函給住在香札西才的班禪喇嘛父母，內容為：“我這個瑜伽士，因過去的業力，在康區花了二十三年，以一位喇嘛的身份，有過喜悅與憂傷的經驗。<br>後來，成為遊方各國的流浪僧人，斷絕世間束縛，輕鬆自在地悠遊山林十二年多。<br>與大司徒成為朋友，承擔尋找夏瑪巴轉世的責任，為了與政府官員交涉花了三年的時間，人生的一部份盡在波折中渡過。<br>火兔年，轉世的事情終於確定，為了佛教，應該面對一切艱難，我並不後悔，呸！<br>前往尼泊爾繼續佛塔的修復工作，雖然有些尼泊爾人阻礙，但夏絨卡秀(菩提大塔)的修復，仍然圓滿完成。<br>本想去不丹的巴卓，但此時政府官員間起衝突，王官員被中國政府免職，西藏政府對一些德高望重的喇嘛們也頗有微詞，而我是名單上的第一位。<br>本可到康區，但因想進行修復帕巴香根的閂布(蘇瓦揚布)佛塔，而到了尼泊爾。<br>天氣炎熱如入地獄般痛苦，為了協調叔侄間可能引起上蒙古入侵的衝突，被政府下令前往調解，暫時放下手邊修復佛塔的工作，經過綿綿不斷的溪流，抵達拉達克。<br>很多問題都是由人與非人間的衝突與侵害造成的，終因蓮花生大士的慈悲，達成和解。<br>仲夏，回到尼泊爾，因水土不服而身體不適，但有太多工作要做，而這裏唯一不需花錢買的只有水，因此用盡了所有財產，修復工作仍未完成。<br>儘管歷經艱苦，仍對佛法的信心不退轉，雖死亦無悔，以歡喜意樂心從事此利益眾生的工作。”<br>尊者給予多瑪夏仲、根桑久美、作者的上師成律敦珠兄弟大圓滿成就法和自己所寫詳述輪迴的白度母和觀世音菩薩成就法的灌頂與口傳，對各方和喇嘛們的請法，均慈悲給予教授。<br>之前，尊者要求廓爾喀王波若特那拉雅那時，曾答應派人支援運送主軸，但國王後來忙於軍事而拖延，尊者勃然大怒，派人命國王來見。<br>國王乘坐大象而至，坐在地毯上時，尊者由椅子上起身，嚴詞譴責國王未實現諾言，順手拿起前面的香爐擲向國王，廚子丹培接個正著，國王與隨行人員非常害怕，立刻依照慣例在印有三神像的紙上簽定，答應盡速提供修復佛塔的支援，尤其不可拖延運送主軸，國王並在末端親自簽章蓋印。<br>國王回去後，問隨行的人：“上師大怒時，你們看到什麼？”回答：“除上師氣得血脈賁張外，什麼都沒看到。”<br>國王說：“上師前額有第三隻眼，三眼通紅，口中冒火，我從來沒有如此害怕過。”<br>不久，即召集眾人搬運主軸，包括喇嘛、拉達克各階層、從西康等地來的西藏牧民、珞隅國和吉隆等地的人，都一起出力搬運，約過了二十天，主軸卻仍無法移動，連國王、大臣們一起來幫忙，都沒辦法。<br>尊者到現場，厲色揚聲對成律敦珠說：“成律喇嘛請過來！叫負責人立刻召集大家過來！”吩咐馬上被翻譯而照辦，尊者口唸真言、手摸主軸，主軸隨即滑動了一噚，很快就飛到五百聞距[ 一聞距即五百弓(噚) 。]外，在場者都目睹這個奇蹟。<br>尊者停留在擦秀到四月底，天花和痢疾等傳染病到處流行，事態嚴重，門巴區的人都說這年會死很多西藏人，影響人民重大，還好尊者、隨從和工作人員都無大礙，工作卻也因此拖延到秋天。<br>隨後，尊者前往吉隆芒隅，暫住絳真寺附近的成就洞，各地群眾藉機聚集來此，因而十分忙碌，不時地為西藏喇嘛和喜馬拉雅山區的群眾灌頂、口傳和開示，也不斷地致函各國。<br>九月底，又到尼泊爾，沿路賜惠給來拜見或聞法的人。<br>第二十一章<br>五八遺囑入涅槃 二年守密圓寂事<br>祕揭部落寺院等 競相爭奪師法體<br>生出舍利無量數 徒眾要求均滿足<br>廣建無數舍利塔<br>木豬年，西元1755年，五十八歲，主軸放入大佛塔，同時開設工廠以準備寶瓶和法輪需要的金、銅。<br>廓爾喀和鹽布國王時有爭鬥，多次前往調解，雙方終於停戰，兩位國王都表達願意支持及協助佛塔的修復工作。<br>佛塔上方的寶瓶以鍍銅做成，原想將四面的眉毛鑲上綠松石與珊瑚，瞳孔鑲上寶石，因此尊者第二次回到中藏，得到民眾供養約一升[ 一升約可盛青稞市制一斤二、三兩。]的綠松石。<br>後來，鑒於大塔附近居民及猴子常將供養佛塔的食物、油燈和絲巾等供物，任意取食或挪用，惟恐日後人們貪圖這些珍寶而破壞佛塔，遂打消了原來的念頭。<br>寶瓶仍維持原樣，僅在寶瓶上方鍍銅，四面眼睛前方的周圍有佛、印度聖者日藏和月藏菩薩等的雕像及名字，寶瓶的四邊升起四面幡。<br>以前，藏鳥黑魯嘎札噶仁珍南嘉和強巴朋措慈修復大塔時，曾在法輪的下面蓮花座到傘蓋間建了四根柱子，但經典內沒有這樣的記載而省掉，只做了十三法輪和傘蓋。<br>當時有些人相信佛塔的守護神伯唐的瑪哈嘎啦是天然現出的石像，原在耶讓附近的普魯多山上，後來飛到伯唐的現址；也有些人相信是龍樹菩薩親手雕刻的。<br>這尊護法像在外國入侵時，鼻子部份曾被武器打斷，後來又被安裝回去。<br>尊者陳設很多袋米和肉在這尊具加持力的守護神前作薈供，寫了廣大和簡易各一篇的瑪哈嘎啦祈禱讚頌文。<br>如自傳前面的敘述，尊者為了親近弟子羅日祖古在尼泊爾往生而難過。此時，跟隨尊者離開西康的廚子丹培，也年邁即將往生，有人問他：“想要往生哪個淨土？”回說：“可能往生金剛手菩薩淨土。”尊者為他寫了一篇祈禱文後，他在輕鬆安詳自在唸誦中，往生了。<br>這時，印度聖者那洛巴的轉世竹千法王噶舉成律新達，為了從尊者處聽取更深教法而來到尼泊爾朝聖，鹽布國王舉行盛大象隊與馬隊的歡迎遊行，尊者也持香爐和五色哈達向前走了很遠的路來迎接，他們一起在給多寺停留很長一段時間。<br>以前的夏絨卡秀 (菩提大塔)佛塔管理員，曾不顧後果將信徒的奉獻全數花盡，這種欺矇他人的行為是自造惡業，使雙方蒙害，其他曾造訪尼泊爾的成就者們傳記中也有記載。<br>尊者此次來到尼泊爾，在閂布(蘇瓦揚布)佛塔和給多寺面對卡秀兩座大佛塔前，點起數千盞油燈，虔誠禮拜供養。<br>鹽布國王加亞巴兒噶西對尊者信心堅定，而得到時輪金剛六加行的口傳和教授，尊者也為他寫了簡單的六加行法本。<br>很多婆羅門教徒、德喀斯坦和門巴人前來請法，都給予灌頂、口傳和口訣。<br>這些重大場合的翻譯，是一位精通各種學問、也深受尼泊爾王敬重的學者帝瑪蔣揚，曾在中藏待了很多年，頗有知名度，也曾從尊者接受內密佛理的教導。<br>隨後，尊者來到擦瓦擦秀，給予成律敦珠活佛北伏藏的大圓滿法、香巴傳承瑪哈嘎啦的灌頂；給予一位婆羅門教徒財源佛母咒口傳及一些預言。<br>有天，當尊者傳予成律敦珠等秘密真言和口訣時，刮起一陣夾著雷雨的大風，尊者左方的朵瑪發出火花等奇蹟，眾人目睹。<br>尊者為竹千法王供奉的唐卡背面寫上祈禱文，後由竹千法王陪同前往西藏。離開時，曾受教於大司徒仁波切和尊者的人，以及所有尼泊爾佛教徒的金剛上師班禪普賢和尼泊爾王都來送行。<br>尊者告訴他們：“以後可能不會再親自來尼泊爾，但五位法王[ 大司徒、嘎瑪巴、夏瑪巴、竹千法王和巴窩仁波切。]和邊雜阿札等主要弟子們，會承擔完成修復佛塔的工作。”<br>在往色唐途中的一塊岩石上，尊者以柺杖留下聖印，人人可見，也在蓮花生大士所著《箴言》中記載的金剛密道岩山附近，以柺杖印下很多痕跡。本書作者後來也曾目睹過這些奇跡。<br>諸如山神姊弟等護法們，都竭誠懇切地皈依尊者、接受菩薩戒，尊者指導他們菩提心及其他教法的修持，也依他們的形相、裝飾和眷屬等寫下供養他們的儀軌及祈請文。<br>在西藏和尼泊爾邊境的蓮花生大士聖地賽唐，其中一柱似人般矗立於紅色湖水中央的岩石，為普巴金剛護法四位賽目女神之一的金剛賽心女神住處。<br>應女神要求，為壓制魔王，尊者在此蓋了一座佛寺。後來以擲骰子決定，吉隆的哪位喇嘛負責寺院事宜，結果落在瑜伽士謝拉瓊尼札江林身上。尊者指導寺院內外的構造和壁畫，因水土不服而留在吉隆的庫秋定一段時間。<br>佛寺完成，尊者就到成就洞，瑜伽士謝拉瓊尼札江林來請教供奉及開光典禮的事宜，尊者要他自己主持儀式，但承諾修法祈福，隨後派侍衛達哇才仁快騎以一天的腳程，將尊者已加持過的米和花由成就洞送到賽唐，正好趕上花鬘供，眾人都很驚訝並認為這是好預兆。典禮結束，寺院命名為札西給傑寺(吉祥增壽寺)。<br>全知的竹千法王、來自各地的喇嘛們、地方代表、西藏和喜馬拉雅山的人民，來到尊者住處，尊者給予很多詳細的開示及指導。<br>在芒隅絳真寺，尊者寫出《俱生時輪金剛短軌》，大筆的護持巴默秋定禪修中心，傳授此法、圓滿持誦一億遍時輪金剛咒。為了竹千法王教法能弘揚廣大，尊者請求他為大眾灌頂，並對竹千法王行大供養、開示，說服他行應行的佛業。<br>有次，出現些許障礙的不祥預兆，驟然滾落一些巨石和許多小石，尊者以期剋印迴遮推到一邊，除了傷到竹千法王的犛牛，其他毫髮無傷。<br>傳予聚集來此的群眾上師瑜伽法時，在成就洞石頭上留下腳印，至今仍然可見。<br>竹千法王身體不適，尊者為他舉行了消災延壽法會，為他灌頂時說：“我剩下的壽命，都供養給您。”同時寫了長壽祈禱詩：<br>黑行者和虛空藏尊者<br>那洛塔巴無二之化身<br>鄔金金剛法所預言者<br>法王噶舉事業之大車<br>給予聚此的群眾長壽灌頂時，告訴弟子和隨從們：“對竹千法王的熱愛，應和對我般無分別。”<br>巴多喇嘛說: “他們可能融合一體。”<br>此時，八個月大的尊者多欽工波已，由父親久美南嘉上師帶來請尊者剃度，被命名為才旺其美工布、賜予一盤邊地的水果。<br>尊者曾在有意和無意間對弟子透露將不久人世的訊息。有天，尊者與竹千法王一起時，說到：“我腕上戴的這個如來佛舍利，是札哇恩西和敦都多傑大師伏藏取出的，每年會持續增加，但今年突然停止了。現在起，由您佩戴，直到將來供奉裝臟到閂布佛塔內。”將舍利及盒子一起交給竹千法王。<br>總總這些，都透露著尊者法體違和的跡象，尊者也沒有吃任何藥物。據說，除了曾對侍者丹增多傑提到一些預言外，沒有多說任何話。<br>木豬年，七月二十五日，金剛跏趺坐中，尊者進入甚深禪定，心識融入法界中，為了具信者而留下法體。<br>外面陽光和煦、晴空湛藍，沒有任何塵埃、雲朵和微風，顯現尊者的心意融入光明寂靜法身裏。<br>尊者燦爛有如佛教光明的太陽，廣植眾生的福田，如今日落西山、黑暗籠罩、大地陰暗，剎那間失去光明。<br>大眾感到無比哀慟，不知何去何從？深懷正念的天神和善人，對尊者的往生感到悲傷；抱持邪念的精靈和惡人，大聲的表達高興、展現出笑容。<br>尊者圓寂前寫了一篇道歌，寫著：<br>不久我將不在人世時<br>護法天地神祇感擔憂<br>夜叉鬼眾嘲笑心歡喜<br>持法傳人感慨而沮喪<br>毀戒邪魔士氣起高昂<br>吾之眷屬所怙位低弱<br>嫉妒競爭者興奮起舞<br>雖然這一切景象如此<br>對我而言無損亦無利<br>我心全然清淨往剎土<br>無憂空中瑜伽我喜樂<br>竹千法王立即於尊者法體前獻曼荼羅、禮拜、大薈供、祈請勿忘誓願等祈願，都祕密進行，弟子和隨從們遵守遺囑，決定守密一段時日[ 原因為拉達克剛協調和解放，怕因此起戰爭。怕上蒙古軍隊南下興兵攻藏。尼泊爾王、廓爾喀王毀誓不續修建大塔。]，一起簽字支持這項決議。<br>尊者的法體被放入大缸中，由忠誠弟子天文學家噶瑪旺嘉領著一頭驢和二匹馬，送往普蘭巴默秋定，暫時安放在無畏上師白色房子的禪室中。<br>法體上敷抹了樟腦、香料、紅白藥粉、六種良藥及香後，置於鹽中，外部以磚建成佛塔保存，由一位僧侶守護著，持續地在塔前禮拜供燈。<br>木豬年，尊者曾從吉隆寄一封信給普藍的首長多傑拉吉說：“可能會到秋定，詳細情形再知會。”所指，應該就是尊者的身後事。<br>徒眾們向外宣稱：“尊者將留在成就洞閉關幾年。”禪室中，主要弟子轉世學者羅日(又名為米潘揚卓) 代表尊者，負責回答眾人的請求指示、預言、提出的疑問、來自四面八方的信函。丹增多傑仁波切帶領內、外部活動的安排和進行。<br>為了確保這個祕密，尊者竹千法王出發前往阿里的宗卡，留在噶窩拉定僻靜處閉關，主持尊者圓寂供養法會及繼續修復閂布(蘇瓦揚布)佛塔的責任。<br>此時，丹增多傑仁波切、秋本大師動身前往拉薩，經由布達拉宮僧侶首相札沙喇嘛尼瑪嘉參的帶領幫忙下，向七世達賴喇嘛噶桑嘉措作殊勝供養，聖座亦回行供養並親切詢問尊者身後守密狀況，同時也請求聖座准許由竹千法王負責執行、支援尊者身後弟子佛塔的繼續修建。<br>聖座說到：“這座佛塔是佛法和有情眾生福祉的主要根源之一，非常急切的要修建完成。任何物資上的需要，將會由政府提供。”<br>為求保密，在後藏阿里芒隅、吉隆和貢唐等所有寺廟和聖地供燈、供養轉世活佛、分發茶葉和金錢給各寺院僧侶。<br>再一起到尼泊爾，繼續大佛塔的修復工作，由竹千法王主持消災法會，提供物質上的支援和建議，所作努力，完全為了完成上師遺願，也是為了佛法及有情眾生的福祉。<br>丹增多傑大師和其他隨從、弟子們，都繼續擔負完成上師生前交付的重責大任，由金羊年開始，在土虎年初尊者圓寂三年後，終告完成，歷時八年。<br>前年火牛年時，巴窩仁波切多傑米祖拉噶哇從西藏中部到尼泊爾，朝拜所有大小聖地，對大佛塔舉行供養時，逢竹千法王身體不適而停留在成就洞。<br>下午，當巴窩仁波切拋出手中鮮花誠心供養大佛塔時，閂布(蘇瓦揚布)佛塔傳來一陣伴著西藏米和花雨的哨聲，在場的人都看到。隨後，羅日仁波切帶領僧侶們唸誦多遍緣起咒。<br>三天供養儀式結束，廓爾喀王受贈上好禮物及受託保護佛塔，他至誠恭敬的接受禮物及保護佛塔的任務。<br>這座從過去到現在一直被佛教徒敬仰的偉大聖跡已修復完成，對西藏及世界各地，尤其是尼泊爾人民，猶如生命中的呼吸般重要。<br>對那些見到、觸摸或憶念它的眾生，具有無上的加持和功德，它以不可思議的加持力光芒四射。<br>修復大佛塔所用的財物資源，在目錄中提到過，過去已用在佛塔上的金和銅仍延用，新的捐獻是額外的功德。<br>以當地、當時金錢的算法，約用了一仟三佰八十二達尼（尼泊爾古錢名），扣除含括浪費的，實際用在佛塔的約一仟二佰五十八達尼。<br>此外有二仟零四十五多拉（多拉是印度重量單位，一印度盧比重量為一多拉）和六個瑪夏，扣除溶合的浪費，共有一仟九佰三十一多拉和六個瑪夏（純金幣）實際用在寶瓶四邊幡的鍍金、四角落的四面幢、十三法輪、寶蓋及頂端的日月。<br>另外的八十九多拉和十個瑪夏，花在其他用途。總共用掉二仟二十一多拉和四個瑪夏的純金幣。<br>從開工以來到修復完工，送給廓爾喀王的禮物、助手和工匠的禮品、相關法會和供養的開銷、工人的工資和運送主軸等等費用，共花掉四仟七佰七十五銀錢、一點五達令印度錢和一萬四仟一佰零六尼泊爾錢幣，加上哈達和織錦等其它絲綢衣物、茶、奶油、穀粒、鹽和肉類品，共花去四萬三仟六佰三十九尼泊爾錢幣。<br>以上花用，並未包括六十七匹馬、二十一匹綢緞、喀什米爾番紅花，總共花費約一仟個銀幣。<br>尊者仁珍才旺諾布的一生，充滿了知足，滿懷出離心和利益眾生的菩提心，生活簡樸，粗茶淡飯，不接受物質供養，過著捨世瑜伽士的生活。尊者的自傳中描述：<br>具信者的物質供養<br>不會浪費在錦衣玉食的享用<br>不會花費在欺蒙他人的邪惡生活<br>這些完全用來作供養等善業<br>從孩童起<br>對財富即無貪念<br>這不是我修行證悟很好的證明<br>是自具的本性<br>任何得到的供養<br>都用於供養上師及佛法上<br>從未有成為富有人的心念<br>這樣的敘述，在很多的著述、書信及傳記中都提到過。<br>自從尊者起意擔負大佛塔的修復，從開始計劃的同時，天神們都答應盡全力支援，直到完工。<br>來自各地，擁有不等財富的人，也都為此目標，陸續供養捐贈。不論供養的金額大小，都不得浪費。<br>佛陀經典中，有如是教言：<br>直如滴水落大海<br>大海不枯即無盡<br>迴向菩提之功德<br>直至菩提無止盡<br>依此教言，承擔佛塔未完成的工作，是積福懺罪的最佳善業，也是對上師最好的供養。<br>以一切正當生計和來源，而非詐現威儀、諂媚奉承、旁敲側擊、巧取豪奪和贈微博厚等參雜任何罪業的鄙劣手段籌款、修建完成佛塔的工作，這樣的作為，深為天神與大眾敬仰。<br>尊者遺囑“法體於芒隅邦巴山頂火化。”因此當有人提議法體送往巴默秋定時，拉達克王、珞隅國王、康區的弟子、德格王代表，都各自宣稱要將法體帶回自己的國家。<br>虔誠的普藍區統治者多傑儀迦說：“聖者的法體好比如意寶，像塊突然掉下來的大金塊般，為眾生的福田，故應完好如初地保留在此地或在此地火化，沒有任何人可以帶走。”<br>這件事成為激烈衝突的起因。普藍領導者又說：“如果拉達克、珞隅國或康區的人們，用武力來爭奪法體，情形將如珍和聶拉木縣人們，在密勒日巴尊者的荼毘大典爭吵般。”<br>後來尊者竹千法王和巴窩仁波切都說：“對上師要深具信心和祈請，切不可非分要求，將法體帶回各自的國家。如此的作為，不是上師的旨意，違反上師與弟子間的三昧耶。<br>普藍領袖為具堅定信心的佛教徒，尊者的法體已安躺於他的區域，最重要的是完成上師的指示和願望，因此應先將法體帶到邦巴山火化，再將舍利，令大家滿意的分配到各區域團體。”<br>普藍領袖心懷遠見、具善根，接受竹千和巴窩仁波切提出的建議，其他人也都附和。<br>尊者的法體被移靈到邦巴山，人們沿途排隊瞻仰尊者遺容祈獲得加持，最後安放在札西邦巴的寺院裏供人們朝拜供養。<br>此書作者的老師亦抵山上瞻仰遺容，以強烈的信心祈禱後，睡在大石頭上，夢見圓寂的尊者栩栩如生的來到，心情愉悅地以梵文給他作了四灌頂及裝滿好茶的銀壺。醒後，他唱著祈禱歌。<br>竹千法王和巴窩仁波切二位騎馬到了陸木岡，選擇在寺院上方石堆中，一處較好的地方搭起帳棚，安排火化。<br>此月二十五日空行日，舉行尊者的紀念法會，法體安放在涅槃塔爐穴，舖滿火化用的沉香、柏樹和紅白檀香，由竹千法王和巴窩仁波切帶領所有弟子，在上師與本尊無二無別的壇城中，舉行荼毘大典及盛大供養。<br>那時必然有很多內和外的瑞兆，從各地擁來很多徒眾，聚滿整座山，很難找到坐的地方。當涅槃塔爐被打開，竹千法王、巴窩仁波切和羅日祖古等人發現許多不同顏色、有佛像和種子字等的舍利，沒有一點餘骨，身體好像大部份已成光身，此點依早先的指示而沒有對外公開。<br>之後，決定在火化的地點，建一座大舍利塔。在完成地基主沙壇城及地上標記經緯軸後破土。<br>佛塔尺寸，完全依照博學者貝瑪噶波所著布敦傳承的比例，由學者羅日祖古負責畫線標記。另外，從尼泊爾邀請畫家過來，採用火化時的石頭和土壤來建造。<br>這時，竹千法王身體雖然不適，仍每天用右手提著以哈達包裹的石頭，左手搭在侍寢隨從肩上，搬運石頭到工地。<br>巴窩仁波切也搬運著這些浸過番紅花水的石塊。許多曾是尊者親近的喇嘛們也為舍利塔搬運石頭。<br>十三法輪以天然石塊製成，舍利塔內忿怒蓮師的雕像也是由石頭所製。此外，寶蓋、日、月和寶塔頂端，由模子鍍銅製成。不久即告完工。<br>在遺囑中指示，要在邦巴山上，面向西方火化法體，舍利塔的正面也是朝西，這些方位具有特殊含義。<br>為了佛塔的裝臟儀式，製做《大佛頂無垢經》壇城與《佛說光明無垢經》壇城，此傳承的灌頂儀式在後藏地區已很少見。<br>此座三層樓高，內裝有四種舍利的降魔塔(萬佛塔)圓滿落成，外有四根柱子支撐之幢，另有供燈堂，竹千法王及巴窩仁波切舉行了開光加持法會。<br>它代表著深遠偉大的紀念，無論是看到、聽到、觸摸和憶念到者，都得到無上的利益和福祉。<br>水虎年時，尊者大持明的主要弟子噶瑪巴、夏瑪巴、竹千法王、大司徒和巴窩仁波切，決定在萬佛塔附近興建一座佛堂，他們各自供養一百斤銀子作為佛塔興建和供燈的基金，由已故尊者的親近侍者才旺喬金負責建設工程。<br>佛堂為三層樓高，有四根柱子、銅製屋頂，作者的上師成律敦珠提供屋脊鍍金寶瓶，尊者丹增多傑在中層作了壁畫，一樓有一尊如已故尊者大小的石雕，壁畫和其它宗教飾物都由同一位畫師所畫。<br>尊者成律敦珠舉行二次供養，拉達王子供養漆金的十三法輪。<br>1816年，火鼠年，徒眾們以一百尼泊爾幣作為供燈基金，重新修建佛塔和佛堂，為佛塔的屋頂和周圍的六字大明咒經輪鍍金。<br>岡達喇嘛為邦巴山的看守者，但佛塔本身則無人看護，因此竹千法王和巴窩仁波切特別給他很多禮物，交待他看守佛塔，同時舉行法會囑託天竺女神護法守護。<br>之後，兩位仁波切到巴庫的巴默秋定，二位應當地的統治者請求而停留幾天。<br>統治者想為尊者興建一座銅鍍金的舍利塔，由羅日祖古繪圖、定比例尺，兩位仁波切加持，佛塔寶瓶內安置尊者法像，佛塔上層的佛眼內安置一尊俱生上樂金剛像，法輪內有藏巴嘉瑞成就者火化時脊椎骨自然化成的二十一尊觀世音菩薩像中的一尊，舍利塔內放有尊者的舍利及生前所用的柺杖，塔外珠寶嚴飾，佛堂內有蓮花生大士、兩位佛母的像，在尊者所睡的床上有如人身大小的尊者法像，牆上畫有尊者生平故事、祈願任運十三本尊聖像。<br>另外，蓋一座金塔的佛堂，存放五冊尊者的作品全集。之前，尊者法體在白色屋內保存兩年所用的鹽，依法體的形態完整的被保留下來，也為此聖物興建一座一層樓的尊勝佛塔。由竹千法王和巴窩仁波切散出吉祥花加持、供養，並安排人長期在兩座紀念塔供燈。<br>竹千法王和巴窩仁波切告訴成律敦珠：“尊者和你師徒間三昧耶清淨的關係，請你親手做一尊已故尊者的雕像。”<br>雕像內裝入很多聖物、舉行多次供養。此值得瞻仰的雕像，現在安放在成就洞的寺院裡。<br>此時，有位吉隆僧侶巴貢的作法，違反與尊者康龍巴貝瑪旺嘉和才旺諾布的三昧耶，因此竹千法王和巴窩仁波切決定，他不能再待在寺院。<br>學者羅日秋吉嘉措授予成律敦珠一些得自已故尊者的特殊傳承，他們請求成律敦珠留在吉隆，但他一再懇辭，倆位仁波切應允後，前往貢能僻靜處。之後，兩位仁波切回到後藏各自的寺院。<br>不久，竹千法王為了再建一座尊者的舍利塔，前往西藏甘丹朋措寺量取大殿上無觸塔的比例尺，交由兩位拉達克藝術家於一年內完成一座金銀珠寶所成的尊者舍利塔，安放尊者的舍利，供奉在擦智囊瓊佛堂。<br>據信，巴窩仁波切也建一座銀製的舍利塔安放尊者舍利，但不知供奉何處。<br>同樣的，其他弟子及功德主等也建立舍利塔、雕像和其他紀念塔，但因資料不可得，無法詳述。<br>尊者才旺諾布一生中，幾乎從未離開禪修，在後藏康區、工布、不丹、拉達克和阿里等廣大區域廣作禪修的教導，不僅弘揚一般的佛法教義，特別是密乘精要。<br>前面描述廣為人知的事蹟，有些是尊者親口敘述，有些記載在傳記和信中。<br>尊者不共秘密的傳記，唯修行與尊者同等的菩薩知道。<br>蓮師曾預言尊者將取出五種伏藏法，然而，在西藏空行淨土山南聖地的意伏藏法已被丘旺伏藏師取出，祕密伏藏為日那林巴取出。<br>尊者應該遇見五位伏藏師而取出甚深伏藏，在某些時空的差距下，只遇見貝瑪德欽林巴，未遇見德達林巴、達香多傑、柔北多傑和德威多傑等其他四位。<br>尊者雖曾得到伏藏法地點在不丹國巴卓達倉洞的消息，也因機緣已過而沒有取出。<br>尊者在祕密自傳中提到：“我是一位幸運具善緣的人，能得到蓮花生大士的甚深伏藏法。<br>這次，因為過去生和現在的業力因果，無法順利取出伏藏法以廣利有情，我發願未來能順利取得伏藏以弘揚佛法、利益有情，使偉大的蓮花生大士歡喜。”<br>伏藏師貝瑪德欽林巴說到：“《精集精要伏藏》是尊者應取的伏藏，雖為我取得，但尊者應是此伏藏的傳人。”尊者與這位根本上師已連續多世互為師徒，在未來他們會同登佛果。<br>同樣的，尊者與大寶法王亦有多世的師徒關係，這相當不尋常，但未在此提到。<br>尊者如此說到：“此生如果不具順緣，會在下一世從山南聖地取出甚深伏藏。”在有關此點的祈禱文，尊者著述如下：<br>此生流浪瑜伽士<br>未來山南聖地處<br>取藏藏民使安樂<br>第二十二章<br>大弟子認定上師 三世仁珍千寶身<br>稟明二世弟子眾 未來轉世已預言<br>未來種種亦預言<br>“尊者涅槃十二年後，轉世將會於山南天階不遠地出生。”尊者的大弟子巴窩仁波切住在加寸洞時，得到這個明確的預言，而在土豬年六月二十八日記載下來：<br>空行怙主轉世<br>才仁札西敦珠<br>賢明的大智慧者<br>居住在下南部的中心<br>為獨子<br>父名謝日 為瑜伽行者<br>屋門臨北 右側窗 前有水塘<br>母名才仁 極幸福快樂<br>供養現世偉大的賢哲無數薈供<br>由於此美妙獻禮<br>母親逝至極樂地<br>父親咒師丹增證持明地<br>凡俗者眼中罕見之事<br>觀於無生法界<br>小孩示現自信特徵<br>吉祥的白土聖地<br>因緣具足 產生吉兆<br>可愛的寶貝吉祥長壽圓滿<br>這個預言，巴窩仁波切保密了好長一段時間，直到金牛年十二月五日圓寂後，才在他的遺囑中發現。<br>尊者前世的侍者丹增仁波切雖然年齡已高且身體違和，仍然排除萬難，在水兔年從山南聖地的成就洞出發，到達蓮花洲的蛇湖。<br>雖發現尊者轉世的線索，但跡象顯示，轉世已圓寂往他方淨土，未能親見而折返。<br>尊者才旺諾布在自己的祕密自傳中提到：“緣於願力和業力，未來的轉世將為博學的僧侶、為覺悟的行者、為三律具足的瑜伽士，或為精通律藏和守清淨金剛三昧耶戒的僧侶化現，成為利益佛法的典範。<br>也會轉世為國王、統治者、部長或具有宗教情操的普通人；也有可能是位佩戴骨飾、唱著金剛歌的瑜伽士，空行母聚集之師，現出無量的神通，遊走於二十四聖地；為了度化六道有情，也會出生於畜牲、地獄等道。<br>多世轉世後，即融入蓮師、虛空藏大師意中。將來在莊嚴虛空淨土，成為虛空遊戲佛(或譯寶髻功德佛)。所有結過緣的眾生，皆將同證佛果。此為尊者親口答應，故毋需懷疑。”<br>經由偉大怙主尊者才旺諾布口傳佛法教義而親嘗甘露法味，得到成就的弟子無數，主要弟子為噶舉巴的五位師徒：十三世大寶法王──敦珠多傑(未來賢劫千佛第六佛獅子吼佛)、十世紅帽冠夏瑪巴──貢秋尼瑪、尊者竹千法王(印度聖者那洛巴的化身)、五明通達的大班禪大司徒(泰錫度)丹北尼謝，另一位為日那林巴伏藏大師的化身──巴窩仁波切祖拉噶巴(亦為蓮花生大士語的化身) ，都是法的明燈。<br>其他的弟子有許多分屬不同佛學院及教派的成就者、轉世祖古，眾多僧院的住持、上師、智者、持戒清淨的法師或善知識，學術機構和禪修中心的住持，許多貴族出身的密宗大師和一生禪修的捨世瑜伽士。<br>寧瑪巴、止貢、大隴和竹巴噶舉各佛學院，覺囊、夏洛和珀東等等各門派，很多都是尊者的弟子。<br>更有無數外道者和婦女等等，從尊者獲得教法，在此無法一一詳盡說明。<br>由尊者自己的陳述中得知：“蓮花生大士曾預測，此世弟子能承辦自利利他的有七十五位，七百位將可得解脫，約一萬多人結下甚深法緣。”<br>此七十五位弟子包括三十六位賢者、八位聖者、四位心子、統治廣大區域和較小區域的國王、宰相大臣等，其中主要的領導者為七世達賴喇嘛噶桑嘉措。<br>尊者曾數次會見法王，為法王舉行多次不同的長壽祈請法會。達賴喇嘛和尊者間有極親密的關係，也有發願，但也出現很多嫉妒者的阻礙，而無法順利完成很多大業，此細節可在其它伏藏法的預言裏發現，如秋傑林巴伏藏中的指示：<br>松贊王的忿怒化身<br>出現在紅鐵山統治外人<br>偶爾會有魔鬼障礙<br>如果去除障礙即能穩定政局<br>其它預言的記載：<br>松贊王及拉雅[ 松贊王之轉世即達賴七世，拉雅之轉世即尊者才旺諾布。]的轉世<br>將在布達拉宮會見<br>他們會弘揚佛法<br>使西藏人民安樂<br>而尊者在工布瓊巴龍閉關取得的祕密預言，如下：<br>由於現在赤松德贊王法緣之故<br>將來事業加持的化身<br>出現在東藏多康地區<br>生肖屬鼠和豬[ 屬土鼠的是出生在康區理塘的七世達賴喇嘛噶桑嘉措。屬木豬者為出生在安多地區的十四達賴喇嘛丹增嘉措。]<br>名為嘉和措<br>身有如項鍊般的白紋<br>具有聲名者<br>將由邊界來到中原<br>成為全藏的政教領袖<br>因為眾生業力的緣故<br>會有許多的障礙<br>人和非人傷害<br>特別於年二十一、二十六和四十六歲<br>凶年及逢七凶年的前後<br>需努力修迴遮和能順緣的法門<br>若能接受此法門（紅度母）<br>將可如願去除這些障礙<br>重要是不可一心二意[ 指心有疑慮。]<br>以精進和尊重心修行<br>爭鬥和不順即能消除<br>我蓮花生大士和聖度母的誓願<br>不虛偽也無疑(不移)<br>此預言顯示，七世和十四世達賴喇嘛的出生地點、生肖、種族、姓名、身上特徵、任務、一生的障礙及日期等。<br>藏王赤松德贊生病時，曾遣使者向當時在山南閉關修持的聖僧南開寧波(尊者的前世)請示，聖僧遣使者先走後，乘著太陽的光芒，頃刻即到桑耶寺。<br>當國王禮拜聖僧時，病即不藥而癒，也在聖僧座下接受不同教法的指導，這些在《箴言書》內曾提及。<br>由於先前的願力和祈請，如果順緣具足，尊者才旺諾布能取出五種伏藏法，帶給雪域眾生無比的利益和福祉。<br>當時曾有些相當重要的特別預言，同樣達賴喇嘛的祕密自傳及其它作品中，也記載了一些重要的變化和因緣。<br>此外，宰相、藏王、頗羅鼐索南多傑和兒子德格王、中國的札果國王、拉達克國王、尼泊爾鹽布國王、不丹統治者、珞隅國(莫斯坦)國王和其他統治者，都曾接受尊者在解脫道上的教導。<br>印度的提拉賀提國王、喀什米爾的那瓦國、德里國皇帝、茲里國國王、廓爾喀國王、門巴國王，也都接受過教法及調停和解而免受戰亂。<br>尊者所作的十三部詩歌內提及︰<br>諸佛慈悲的總集<br>即為蓮師的慈悲<br>南瞻部洲佛教的中土<br>是和平快樂的西藏<br>西藏的布達拉宮上<br>住著雪域的怙主<br>七世達賴噶桑嘉措坐在寶座上<br>被統治者、宰相、英雄圍繞<br>世界的和平快樂<br>由於蓮師的慈悲<br>西藏和平快樂<br>人民享受上天之富<br>在阿里和瑪友的國王和解成朋友<br>上蒙古的軍隊被送返國<br>德里的國王變得親切友善<br>喀什米爾的國王成為聽從之民<br>上部增勒國國王受制於約定<br>下蒙的廓爾喀國王轉惡業為善業<br>尼泊爾鹽布城國王成為佛門弟子<br>印度德日賀德國王已成佛教施主<br>西康德格國王堅定積德行善<br>中國之郡王已有他空中觀見<br>不丹巴卓國王流旋佛法之海<br>東方中國皇帝愛護西藏國土<br>東起中國到南方的印度加耶，西至喀什米爾，北至大士，許多驕傲的統治者都對尊者倍加尊敬，更不用說其他人了。<br>許多墮入魔道的僧侶和外道，眼睛被無明矇蔽而反對尊者，沉溺於批評及錯誤等言行，自成墮落三惡趣的因。在一蓮師的祕密預言中記載︰<br>具善根因緣之人圍繞<br>無善根之人起惡見<br>邪魔之人來毀謗<br>很多人 人前尊敬背後指責<br>許多與之結緣者二次起疑心<br>即使聖人批評也將三劫間墮地獄<br>無疑而親近者<br>即與我蓮師具甚深因緣<br>若生起懷疑 障礙即出現<br>許多眾生福德淺薄<br>很少有不懷疑而尊敬<br>與他相同發願者一百七十五位<br>如無違緣 會漸漸出現<br>將如朋友般相互協助<br>利益有情眾生<br>如是偉大的聖者，也會有人討厭。很多為魔鬼引導的假伏藏師自稱為寧瑪派上師，做出很多不如法、下流、欺騙眾生的墮落行為，使很多過去和現在上、中、下層的人，錯誤的批評蓮花生大士。有正知見、具智慧者可分辨了解這種情形。<br>尊者廣泛地閱讀經論、密續及其他傳承教法，完全通達，成為知識無礙自在的大師，寫下許多著作，在不同的時間和地點，傳予很多人不同法教，惜未被收集記載下來，今天實際僅存共五冊。<br>羅日秋吉嘉措仁波切曾為尊者的作品編寫目錄，連同傳記共六冊；江浪寺的智源咒士努力蒐集所有尊者的作品，將其分類為十二部︰<br>1.傳記<br>2.教言及道歌<br>3.意伏藏法<br>4.上師瑜伽<br>5.灌頂及導引之傳承祈請文<br>6.讚頌文<br>7.修行口訣之導引<br>8.成就法、灌頂、食子儀軌<br>9.歷史格言<br>10.文學<br>11.寫給上、中、下社會階層人士的信<br>12.祈願及迴向文<br>其中有小部份，被傳到不同地方。除此二人，無其他人蒐集彙整。<br>智源大師曾完整的接受尊者傳承法門的口傳，至今還有的少數具信者，仍以大師為學習的對象。若無大師的發心，不要說口傳傳承，連法本都很難找到，我們實應非常感謝大師。<br>࿉總 結࿉<br>不論尊者到何處，都能以明晰的教法和物資，滿足人們各方面的需求。無數的人，因而去除不道德的惡行，行十善業，轉向人天善趣的道路，得獲根本解脫。<br>最主要地，尊者慈悲的阻止了西藏已緊急如噴煙火山般的外來侵略，使人們享受自由和平的生活；救助因業力而瀕臨死亡的眾生；在許多聖地和森林、高山、峽谷和河川等地，進行保育工作，解救無數野生動物。<br>如同大菩薩般，尊者盡其一生，從事上述的佛行事業，廣泛運用四攝法[ 四攝法︰布施攝、愛語攝、利行攝、同事攝。]利益眾生。<br>噢 佛陀的事業無一不具意義<br>呼吸間亦皆恆時饒益有情<br>如上述經典的詩句般，任何情況下，尊者任一呼吸，都帶給眾生利益和福祉。<br>凡予接見、加持、愉悅交談、溫馨歡迎和慈悲設想者，都得利益；對難調難伏者現忿怒相，以猛烈言行相對而調伏；對收受的任何具信虔誠的供養，都用於善業；以不可思議的善巧方便，無分別的散播無上解脫的種子於人們心田。<br>凡見到尊者慈容、聽聞尊者法語、思憶尊者種種、觸摸尊者法體、曾得尊者加持等功德者，都會得到不可思議的利益。<br>這些，並非偏頗的言詞、盲目信仰的誇張虛浮言語，更不是宣傳和奉承，而是事實，所有過去到現在的正直智者都了解。<br>尊者在各地舉行大小成就法的法會、禪修和取出伏藏法；不分教派，接受無數大師們的甚深甘露教法，弘揚新舊密續經典，傳授正法、伏藏法及其他甚深教法，全心全意服務佛法。<br>探訪知名伏藏聖地、停留及禪修。建立佛堂、紀念塔、佛塔、寫作，設立慈善基金作為供養及祈福法會的用途。<br>尊者傳予數百名喇嘛及數千民眾菩薩戒和灌頂，廣傳六字真言、百字明咒、蓮師心咒及七句祈請文。<br>此外，傳予信眾希求的教法，禁止打獵殺生、救護野生動物。<br>攝服凶惡地神及殘暴的邪靈等，勾攝天神、取出天神命咒、滿足他們的需求，使發誓成為佛教護法。<br>尊者教導具善緣徒眾、著有許多文學和詩歌等作品。具有外內密奇妙的神通，在很多聖地岩石上留下很多手、腳印等奇蹟，見到無數共通與不共通的清淨景象，觀察到許多驚人的預兆，寫下很多對未來的預言等。<br>這些如一一詳盡記載，自傳的冊數會更多。然而，並無一位弟子堅持嘗試將這一切記錄整理下來。<br>此傳記，主要摘錄自尊者兩篇自傳，一是摘錄自《山谷葯林》的第一篇，另一為由土猴年到土蛇年所寫的《掌中蓮花》。<br>其中的年份、信件內容部份，均原封不動自作品中取出。為了避免增加字數及重覆，沒有附入詩歌及註釋的部分，僅加上一些從傳承上師那裏聽聞到的傳記。本書作者也因無神通，無法盡述一切。<br>總之，尊者有不可勝數內、外和密等奇妙神蹟，非常慈悲的弘揚佛法，對西藏人民尤有貢獻和恩德。<br>但從尊者圓寂到十四甲子土兔年相當於一個人一生的六十四年期間，不用說尊者的生平，連尊者名字都少有年輕人知道，尤其是西藏中部和前後藏地區。<br>尊者在七世達賴喇嘛領導期間，承擔簽訂協調拉達克的合約，對噶舉紅帽冠、黑帽冠及寧瑪巴直接巨大的貢獻等等這些，在尊者的自傳中都已提過了……。<br>至今，除了一些噶瑪巴、竹巴、巴窩及寧瑪巴[ 於咕扎的寧瑪巴宗教史和克增桑波的西藏八大傳承詳細史內，都有記載尊者的的名字及貢獻，由於政治的因素，很少人提到尊者的名字，深覺遺憾。]的弟子，幾乎無人聽過尊者名號。<br>甚至某些瞋心者，由心間種子字發出魔咒障礙尊者；由於維護十世夏瑪巴被冤枉的事件而遭受毀謗；也因寧瑪巴中部分人的偏頗、嫉妒及迷惑而批評，加上尊者的轉世十二年內未出現，弟子無集結共同整理蒐集尊者的作品等等諸因緣不具足，因此不能責怪別人。<br>而有些情況，為了怕模糊了傳記的重點，在此沒有詳細說明。<br>尊者的共與不共傳記廣泛如大海，這本摘錄彙整的傳記僅如以吉祥草沾取滴水般，無法詳述。在從未親見尊者容貌、親聞尊者法語，見到的尊者傳記也很少的狀況下，盡己所能地描述整個事蹟，這實在已超出作者的能力。<br>不是為名或表示自己是學者的身份，如前面所說，只因有關尊者完整事蹟的記錄已很少！<br>以這樣純淨的心念，懇祈上師，直至菩提間，生生世世慈悲攝受引導！<br>僅經由於敘述尊者傳記的一部份，或剎那對尊者生起信心，都能獲得人天福報，甚至究竟覺悟。<br>懷著清淨善念作此敘述，沒有私人的偏見，完全依據眾人耳聞能詳的事蹟，以相當大的努力，精進的彙整這些見證事跡。<br>࿉後 文࿉<br>如下所述：<br>如同聚集無盡無暇功德海<br>慈悲浪濤升起直至宇宙頂<br>充滿珍寶般豐富教證二法<br>廣大深邃智慧勢力與慈悲<br>天龍般具善根弟子均依靠<br>今生來世利樂安休之根本<br>無比上師相續如流水加持<br>不斷流入旋轉於吾心海中<br>࿉作者謙虛及懺悔文࿉<br>無先天智與後天慧<br>今更乏學習與精進<br>若於無知生過患<br>怙主智者前懺悔<br>࿉迴向及祈願文࿉<br>奇妙傳記如大海<br>如吉祥草取一滴<br>為生歡喜滅除苦<br>此為具信之禮物<br>自他二利願任運<br>不變大樂願獲得<br>生生世世得暇滿<br>自在功德皆圓滿<br>弘揚教法利眾生<br>吉祥善緣熾耀燃<br>我自童年起，即對吉祥大忿怒聖尊噶陀仁珍千寶──才旺諾布具大信心，最終，願成為此傳承持有者。<br>名為瑜伽士仁珍秋吉旺秋或米旁吉美竹巴秋吉嘉參（1775-1837），四十五歲時，尊者圓寂六十四年後，藏曆第十四甲子土兔年，西元1819年，寫於密勒日巴成就的札卡達索洞穴。筆錄者為侄子噶瑪朋措。</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-08-23T11:00:00Z",
    "updatedAt": "2023-08-23T11:00:00Z"
  }
]
