[
    {
    "id": "勝樂註解_001",
    "tibetanTitle": "༄༅། །བདེ་མཆོག་ཉུང་ངུའི་ཕྱག་མཆན།",
    "chineseTitle": "《勝樂簡略手印》",
    "author": "才旺諾布",
    "category": "勝樂註解",
    "tags": ["勝樂","勝樂金剛","勝樂註解","導引文"],
    "ContentTibetan": "<p class=\"tibetan-text\">༄༅། ། ཀཿཐོག་རིག་འཛིན་ཆེན་པོ་ཚེ་དབང་ནོར་བུ་མཆོག་གི་བདེ་མཆོག་ཉུང་ངུའི་ཕྱག་མཆན་འདི་འབྲས་ལྗོངས་མི་རྗེ་འབའ་ཉག་པའི་ཕྱག་དཔེའི་ཁྲོད་ནས་བྱུང་བ་ཡིན། འདིར་མགོ་ནས་ལྡེབ་མ་གསུམ་དང་། མཇུག་ལྡེབ་སུམ་ཅུ་བའི་ཤོག་སྣེ་ཆད་འདུག གློག་ཀླད་དུ་འཇུག་སྐབས་མ་དཔེར་བརྡ་རྙིང་དང་ཡང་འཇུག འཕྲད་དང་རྣམ་དབྱེ་དབྱངས་དང་མགོ་འདོག་སོགས་དེང་དུས་ཀྱི་བརྡ་དག་དང་མི་མཐུན་པ་མང་དུ་ཡོད་པ་མ་བཅོས་པར་རང་སར་བཞག་ཡོད། འབྲུ་མ་གསལ་བ་དང་། ངོས་འཛིན་ནོར་བ། མཆན་བཙུད་ཉེས་པ། རྟགས་ལ་མཆན་སྦྱོར་རྒྱུ་མ་རྙེད་པ་དང་མཆན་གང་དུ་འཇུག་དགོས་མ་ཤེས་པ་སོགས་ནོར་འཁྲུལ་ཅི་མཆིས་ཡོད་པས་མཁས་དབང་དམ་པ་རྣམས་ཀྱིས་མ་དཔེ་དང་བསྡུར་ནས་ཞུ་དག་ཟབ་ནན་གནང་བར་ཞུ། སྒྲིག་པ་པོས་༢༠༠༤་༡༢་༡༠་ལ། །༄༅། །ལ་ཁུ་ཚུར་གྱིས་བརྡེག་༼དང་ཟེར་༽དང་། མིག་རྒྱུའི་ཆུ་ནི་འཐུང་༼པ་དང་ངོམས་པ་མེད་༽དང་མཚུངས་༼ཏེ་དངོས་གྲུབ་མི་ཐོབ་༽། །༼༣་པ་རྒྱུད་ཀྱི་ཆེ་བ་བསྟན་པ་༽རྣལ་འབྱོར་༼འདུས་པ་ལ་སྟགས་པ་ལས་སཾ་བྷ་ར་༽འདི་ནི་༼སཾ་བྷ་རའི་དལ་དུ་འཇུག་པ་དང་དབང་ཐོབ་ན་༽མཆོག་རབ་དང་། །སྦྱོར་བ་ཀུན་གྱི་དམ་པ་ཡིན། །གང་ཞིག་རྟག་ཏུ་༼དེ་ལྟར་༽འདོད་འགྱུར་བ། །དེ་ནི་ལྷ་མི་༼ཐམས་ཅད་༽ཟིལ་༼གྱིས་༽གནོན་༼པར་༽འགྲོ། །དཀྱིལ་འཁོར་འདིར་ནི་དབང་བསྐུར་བ། རྒྱུད་རྣམས་ཀུན་གྱི་བསྒྲུབ་པོར་༼རྒྱུད་ཀྱི་ཆེ་བ་༽གསུངས། ༼ལྷ་དང་སྦྱར་ན་༽ །རྒོད་དང་ལྟ་བ་༼བྱ་བ་སྤྱོད་པ་༽ལག་༼རྣལ་འབྱོར་༽བཅངས་༼མི་དང་ལྷ་མི་མ་སྦྱོར་བ་ཉིད་་་་་༽དང་། །༼བླ་ན་མེད་པ་༽གཉིས་གཉིས་མཁྱུད་པ་ལ་སོགས་བདག །རྒྱུད་རྣམས་༼མ་བླ་ན་མེད་པའི་བར་དུ་༽ཀུན་ཏུ་མ་གསུངས་ཏེ། ༼གང་དུ་མ་གསུང་ན་༽ །དེ་ཉིད་བསྡུས་པ་༼དང་༽འཁོར་སྡོམ་༼རྒྱུད་རྒྱས་པར་མ་གསུང་པའོ་༽འམ། །གསང་པ༼འདུས་པའམ་༽འམ་རྡོ་རྗེ་འཇིགས་བྱེད་ལས། །དཀྱིལ་འཁོར་རྣམས་ཀྱི་མཆོག་འདི་ནི། ༼རྒྱུད་དེ་དག་ཏུ་སྔར་༽ །མ་བྱུང་༼ཕྱིས་༽འབྱུང་བར་མི་འགྱུར་རོ།༼འདིས་དངོས་གྲུབ་༽ །བཤད་དང་མ་བཤད་གང་ཅིའང་རུང་། །དེ་ཀུན་དཔལ་ལྡན་ཁྲག་འཐུང་༼གི་དལ་ལ་བརྟེན་ནས་༽གནས། །དཔལ་ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་ཡོན་དང་བཅས་པའི་དབང་བསྐུར་བའི་ཆོ་གའི་ལེའུ་སྟེ་གསུམ་པའོ། ། ༼དབང་བསྐུར་བ་དང་དེ་ཁོ་ན་འབྲེལ་བས་དབང་གི་རྗེས་ལ་དེ་ཁོ་ན་ཉིད་བསྟན། རིམ་པ་༢་ལ་དལ་དང་ལྷ་དང་སྔགས་དང་ཡེ་ཤེས་ཏེ་དེ་ཁོ་ན་ཉིད་༤་༤་བརྒྱར་བསྟན་ཏེ་མཆོག་དབང་༣་བ་སོང་བ་ ་དབང་བསྐུར་ནས་ནི་དེ་ཉིད་བསྟན་ཅེས་པས་འབྲེལ་རྙོག་ ་ལ་གུ་སཾ་བ་ར་འདིར་གསུངས་པ་འདི་ལ་༽ །དེ་ནས་༼དཀྱིལ་འཁོར་གྱི་དེ་ཁོ་ན་༽རྣལ་འབྱོར་མ་༼དལ་དང་ལྷའི་དེ་ཉིད་སྟན་པའི་ཚིག་གིས་༤་པར་ཡང་བཞེད་ ་རྒྱུད་གཞན་གྱི་སྐྱེད་པ་པས་མཚོན་ནས་རླུང་ནས་གཞལ་ཡས་ཁང་སྐྱེད་པའི་བར་དུ་༽རྣམས་ནི། །༼རྫོགས་པ་ལྟར་རྐང་མཐིལ་རླུང་ལ་སོགས་པ་ལུས་དལ་ལོ་རེ་ལ་རོལ་བ་རྩ་༽ས་ལ་རྣམ་པར་རོལ་པ་སྟེ། །༼ལྷའི་དེ་ཁོ་ན་ཉིད་༽བརྩོན་ཆེན་འཁོར་ལོ་༼མ་ནས་མ་བཀོད་པ་ནི་སློབ་དཔོན་མེད་པར་འཇུག་པ་དགག་པ་༽བསྒྱུར་མ་༼རྩོགས་པ་མཁའ་འགྲོ་མ་རྣམས་རྩའི་གཟུགས་༽དང་། །སྟོབས་ཆེན་མ་དང་རབ་དཔལ་མོ། །འཁོར་ལོའི་གོ་ཆ་༼ཤོན་དེ་ནི་༽ཆང་འཚོང་མ། །ཁཎྜ་རོ་ཧ་འཁོར་ལོའི་ཤུགས༼སྐུའི་བརྒྱད་༽ ། ༼ཁ་ག་ན་ ༽ །བྱ་གདོང་མ་དང་རྟ་རྣ་མ། །ཤིན་ཏུ་བཟང་མོ་ལྗང་ལྷ་མོ། །༼བསྐྱེད་པ་ཙཀྲ་༤་ལས་ ་ལྷ་བཅུ་༢་ཤུགས་ལ་ཤེས་པར་བྱ་༽ཆང་འཐུང་མ་དང་༼མངོན་པར་དགའ་བ་༤འི་རྟོགས་པ་སྐྱེ་བས་༽རླུང་ཤུགས་མ། །དེ་བཞིན་འཇིགས་བྱེད་ཆེན་མོ་དང་། ༼ཨེ་ར་བ་ཏི་༽ །ས་སྲུངས་མ་དང་༼གསུང་གི་བརྒྱད་ ་གསང་བའི་ལུས་རྩ་༽ཤིང་གྲིབ་མ། །ལང་ཀའི་བདག་མོ་མི་ཐུང་མ། །དཔའ་བོའི་བློ་མ་སྣ་ཆེན་མ། །འོད་ལྡན་མ་དང་གཏུམ་མིག་མ། །རབ་གཏུམ་མ་སྟེ་༼ཐུགས་ཀྱི་བརྒྱད་༽སྒྲུབ་བྱེད་ཡིན། །༼རྩ་ཉི་ཤུ་རྩ་༢་ཀྱི་ངོ་བོར་གནས་སོ་༽མཁའ་འགྲོ་མ་ནི་ཉི་ཤུ་བཞི། །སྐུ་གསུང་ཐུགས་ཀྱི་དབུས་སུ་ནི། །ཇི་ལྟར་ཕྱི་རོལ་ནང་དེ་བཞིན། །འདི་དག་སྔོན་ཉིད་༼ཞིང་ནཾ་གྲུབ་པའི་དུས་སུ་མཁའ་འགྲོ་མ་ཡང་གྲུབ་པས་༽གྲུབ་པ་ཡིན།༼རྫོགས་པ་ཙཀྲ་༤་དང་རྩ་༢་ལ་ཨ་ལི་ཀི་ལ་སོགས་པ་དགོད་༽ །རང་མིང་༼སྔགས་ཀྱི་དེ་ཁོ་ན་༽བརྗོད་པའི་སྔགས་ལ་ནི། །མཐར་ནི་ཧཱུྃ་ཧཱུྃ་ཕཊ་དང་སྦྱར། །རྣལ་འབྱོར་མཆོག་ནི་འདི་མཐོང་ན། །མེ་༼དང་འདྲ་༽སྟེ་༼རྒྱུད་སྡེ་༽གཞན་དག་རྩ་དང་མཚུངས། །ཨོྃ་ནི་ཐམས་ཅད་༼ཀྱི་དང་པོ་༽གསལ་བྱེད་སྟེ། །༼ཞི་བ་ལ་སོགས་པའི་ཕྲིན་ལས་དལ་དང་ལྷའི་དེ་ཉིད་སྟན་པའི་ཚིག་གིས་༤་པར་ཡང་བཞེད་བདེ་བ་ཆེན་པོའི་ཡེ་ཤེས་འཕེལ་བ་་་དངོས་༽གྲུབ་༼རྫོགས་པའི་རྩའི་ནང་ན་ཨ་ལི་ཀ་ལིའི་འོག་དང་ཞབས་སུ་ཨོཾ་དང་ཧཱུཾ་ཕཊ་ཡོད་༽སྩོལ་འདོད་༼ཅིང་༽པ་ཐམས་ཅད་༼སྟེར་བར་༽བྱེད། ༼ཡེ་ཤེས་ཀྱི་དེ་ཁོ་ན་༽ །དཔའ་བོ་༼ཡུམ་དང་ཞལ་སྦྱོར་དུ་༽ཉིད་འགྱུར་གྲུབ་པ་ནི། །༼རྩའི་༽ཁྱིམ་དུ་༼པད་མ་༽དཀྱིལ་འཁོར་༼ཐབས་དང་ཤེས་རབ་སྙོམས་འཇུག་བྱས་པ་ལས་བདེ་བ་དེ་ཁོ་ན་ཉིད་༽མཐོང་བ་ཡིན། །༼བདེ་བ་༽དེ་ཤེས་རྟག་ཏུ་བསྒོམ་པ་ནི། །དངོས་གྲུབ་༼ཐོབ་པར་༽དེ་བཞིན་གཤེགས་པས་གསུངས། །ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ལས་དཔའ་བོ་དང་རྣལ་འབྱོར་མ་གཉིས་སུ་མེད་པར་དགོད་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་པའོ། །༼དེ་ལྟར་དབང་ཐོབ་པས་འབྲས་བུའི་གསང་པ་བསྒྲུབ་པ་ལ་འཇུག་པས་ཐུན་མོང་གི་འབྲས་བུ་བསྒྲུབ་པའི་ཐབས་སྔགས་བཏུ་བ་བསྟན་ཏོ༽ །དེ་ནས་༼ཨ་ལི་དང་ཀ་ལི་༽ཐམས་ཅད་ཆོས་འབྱུང་༼གྲུ་༣་དུ་འབྱུང་པར་༽བར། །སྣ་ཚོགས་༼པད་མའི་༽ལྟེ་བར་མི་ཤིགས་༼ཨ་དགོད་༽དགེ །བྲིས་ནས་༼དེ་ནས་༽ཆོ་ག་བཞིན་དུ་༼ཨ་ལི་ཀ་ལི་བཀོད་ལ་མཆོད་པ་བྱས་ལ་རྟེན་ཆོས་འབྱུང་ལ་བརྟེན་པ་ཨ་ལི་ཀ་ལིའ་༽བསྔགས།༼ལེའུ་ལྔ་བ་འདིས་ལུས་བཏུ།བདུན་པས་ཡན་ལག་བཏུའོ། ནང་བྲི་དེས་འགྲེ་སྡེ་ཚན་གྱི་གྲངས་འདི་རྣམས་ཀའི་སྡེ་ཚན་ནས་བགྲང་པར་ཤེས་པར་བྱའོ༽ །ཆོས་ཀུན་གཅིག་ཏུ་བསྡུས་པ་བྱ། །སྔགས་ཀྱི་ཚིག་ནི་འདི་ཡིན་ཏེ། ༼སྡེ་ཚན་བརྒྱད་ལྷག་ཆད་མེད་པར་༽ །ཨ་ལི་ཀ་ལི་མཉམ་བྱས་ནས། ༼བསྒྱུར་གཞི་ཀ་ལི་བསྒྱུར་བྱེད་ཨ་ལི་༽ །སྡེ་ཚན་༼བརྒྱད་བཀོད་པ་དེ་༽རྣམས་ནི་བསྒྱུར་བར་བྱ།༼ཨ་ལིའི་མཚན་བསྒྱུར་བྱེད་༽ །བཞི་བཞི་རུ་༼སྟེ་བཅུ་དྲུག་བཅད་དེ་པད་མའི་འདབ་མ་༡་ལ་བྲི་༽ནི་ཤེས་བྱས་ལ། །ཐུབ་པ་༼འདི་བསྒྱུར་བའི་སྔགས་ཀྱིས་ཐམས་ཅད་ཐུབ་པས་བསྒྱུར་བྱེད་ཨ་ལི་ཡིས་བསྒྱུར་གཞི་ཀ་ལི་ཚན་༽མཆོག་གིས་བརྒྱན་པར་བྱ། །དེར་གནས་༼ནས་༽དཔའ་བོ་༼སྟེ་ཡབ་ཀྱི་རྩ་སྔགས་༽བཏུ་བར་བྱ་༼རྐང་བ་བརྒྱད་པ་༽། །འདོད་དོན་༼ཕན་ཡོན་དངོས་གྲུབ་༢་༽ཐམས་ཅད་་སྒྲུབ་བྱེད་པ། ༼རྐང་བ་བརྒྱད་པའི་རྐང་པ་དང་པོ་༽ །བཞི་པ་ཡི་ནི་ལྔ་པ་དང་། །ལྔ་པ་ཡི་ཡང་ལྔ་པ་དང་། །ལྔ་པ་ཡི་ནི་བཞི་པ་༼བྷ་༽དང་། །དང་པོའི་གསུམ་པ་༼ག་༽གང་ཡིན་དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་དགུ་པ༼་ཝ་༽། །བཞི་པའི་དང་པོ་༼ཏ་༽གང་ཡིན་དང་། །མཐར་གནས་པ་ཡི་བཞི་པ་༼ཝ་༽དང་། །དེ་ཉིད་ཀྱི་ནི་གཉིས་པ་༼ར་༽དང་། །སུམ་བཅུ་པ་༼ཤ་ས༽ནི་ཡང་དག་བླང་། །ཉི་ཤུ་དྲུག་པ་༼ཡ་༽ཉིད་དང་ནི། །དེ་བཞིན་བརྒྱ་ཡི་ཕྱེད་ཕྱེད་༼ཉི་ཤུ་རྩ་ལྔ་པ་མ་༽དང་། །དེ་ནས་སུམ་བཅུ་གསུམ་པ་༼ཧ་༽དང་། །དང་པོའི་དང་པོ་༼ཀ་༽ཉིད་དག་དང་།༼ལ་ལ་པ་བཏགས་པ་ལ་ཨ་བཏགས་པ་ཡང་འོང་ཀས༽ །༼བར་འདིར་པ་དང་ཨ་ནི་བཏུ་བ་ལེའུ་བདུན་པ་ལས་འབྱུང་ངོ་༽མཐར་གནས་པ་ཡི་གསུམ་པ་དང་། །དང་པོ་ཡི་ནི་གསུམ་པ་༼ག་༽ཉིད། །སུམ་བཅུ་རྩ་གཉིས་པ་༼ས་༽ཉིད་ནི། །བཞི་པ་ཡི་ནི་ལྔ་པ་༼ན་༽དང་། །ལྔ་པ་ཡི་ནི་བཞི་པ་༼བྷ་༽དང་།༼  ཀ་ནས་བགྲང་བའི་དེས་འོག་ཐམས་ཅད་ལ་ཡང་འགྲེའོ།༽ །མཐར་གནས་པ་ཡི་དང་པོ་༼ཡ་༽ གཉིས་པ་༽དང་། །གཉིས་པ་ཡི་ནི་གསུམ་པ་༼ཛ་༽དང་། །གསུམ་པའི་དང་པོ་༼ཊ་༽གང་ཡིན་དང་། །ལྔ་པ་ཡི་ཡང་པ་ལྔ་པ་༼མ་༽དང་། །དང་པོ་ཡི་ནི་དང་པོ་༼ཀ་༽དང་། །དེ་བཞིན་བཅུ་གཅིག་པ་༼ཊ་༽ཉིད་དང་། །དེ་བཞིན་མཁས་བས་བཅུ་དྲུག་པ་༼ཏ་ལ་འདོགས་པའི༽། །གསུམ་པའི་དང་པོ་༼ཊ་༽གང་ཡིན་དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་༼གསུམ་པ་༽དྲུག་པ་༼ཡ་༽། །བཞི་བའི་གསུམ་པ་༼ད་༽གང་ཡིན་དང་། །ཨུཥམ་༼ཤ་ཥ་ས་ཧ་༤་སྟེ་ དྲོད་༽ཡི་ནི་གཉིས་པ་༼ཥ་༽དང་། །དང་པོའི་དང་པོ་༼ཀ་༽གང་ཡིན་དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་བདུན་པ་༼ར་༽། །ཉི་ཤུ་རྩ་བརྒྱད་པ་ལ་ཡང་ངོ། །དང་པོ་ཡི་ནི་གསུམ་པ་༼ག་༽དང་། །ལྔ་པ་ཡི་ཡང་བཞི་པ་༼བྷ་༽དང་། །དེ་བཞིན་སུམ་བཅུ་རྩ་གཅིག་༼ཥ་༽བླང་། །བཅྭ་ལྔ་པ་༼ཎ་༽ནི་ཉིད་དག་དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་ལྔ་པ་༼མ་༽། །དང་པོའི་གཉིས་པ་༼ཁ་༽གང་ཡིན་དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་གཅིག་པ་༼པ་༽། །ཨན་ཏསྡྱ་ཡི་གཉིས་པ་༼ ར་༽དང་། །དེ་བཞིན་ཡང་ནི་སུམ་བཅུ་པ༼ཤ་༽། །ལྔ་པ་ཡི་ནི་དང་པོ་༼པ་༽དང་། །ཨུཥ་མ་ཡི་ནི་དང་པོ་༼ཤ་༽དང་། །དེ་བཞིན་ཡི་གེ་དྱ་ཉིད་དང་། །བཞི་པའི་དང་པོ་༼ཏ་༽གང་ཡིན་དང་། །ཨུཥ་མའི་དང་པོ་༼ཤ་༽གང་ཡིན་དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་བརྒྱད་༼ལ་༽པ། །དང་པོའི་གཉིས་པ་༼ཁ་༽གང་ཡིན་དང་། །གསུམ་པའི་དང་པོ་༼ཊ་༽ཉིད་དག་དང་། །དང་པོའི་གསུམ་པ་༼ག་༽གང་ཡིན་དང་། །བཞི་པའི་བཞི་པ་༼དྷ་༽གང་ཡིན་དང་། །ཨན་ཏསྡྱ་ཡི་གཉིས་པ་༼ ར་༽དང་། །གསུམ་པ་ཡི་ཡང་ལྔ་པ་༼ཎ་༽དྲུག་པ་༽དང་། །ཡི་གེ་བྱ་ནི་དེ་བཞིན་བླང་༼ལས་ཟེར་༽། །དང་པོ་ཡི་ནི་བཞི་པ་༼གྷ་༽དང་། །དེ་ནས་བརྒྱད་པ་༼ཛ་༽ཉིད་དག་དང་། །བཞི་པའི་ལྔ་པ་༼ན་༽གང་ཡིན་དང་། །ལྔ་པ་ཡི་ཡང་ལྔ་པ་༼མ་༽དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་བདུན་པ་༼ར་༽། །བཞི་པ་ཡི་ནི་བཞི་པ་༼དྷ་༽དང་། །སླར་ཡང་ཉི་ཤུ་རྩ་བདུན་པ་༼ར་༽། །དེ་བཞིན་ཉི་ཤུ་རྩ་དྲུག་པ་༼ཡ་༽བདུན་པ་༽། །ཉི་ཤུ་རྩ་ལྔ་༼མ་༽ཡང་དག་བླང་། །སུམ་བཅུ་རྩ་གསུམ་༼ཧ་༽ཉིད་དག་དང་། །བཞི་པ་ཡི་ནི་བཞི་པ་༼དྷ་༽དང་། །ལྔ་པ་ཡི་ནི་ལྔ་པ་༼མ་༽དང་། །བཞི་པ་ཡི་ཡང་ན་ལྔ་པ་༼ན་༽དང་། །དང་པོའི་དང་པོ་༼ཀ་༽ཉིད་དག་དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་བདུན་པ་༼ར་༽། །ཨན་ཏསྡྱ་ཡི་བཞི་པ་༼ཝ་༽དང་། །དེ་བཞིན་ཉི་ཤུ་རྩ་གཅིག་པ་༼པ་༽། །ཨུཥ་མ་ཡི་ནི་གཉིས་པ་༼ཥ་༽ཉིད། །དེ་བཞིན་རྩ་ཉི་ཤུ་དྲུག་པ་༼ཡ་རྐང་པ་བརྒྱད་དོ་༽འོ། ཀ་ར་ཀ་ར། ཀུ་རུ་ཀུ་རུ། བྷན་དྷ་བྷན་དྷ་། ཏྲ་ས་ཡ་ཏྲ་ས་ཡ། ཀོཥ་བྷ་ཡ་ཀོཥ་བྷ་ཡ། ཧྲོཾ་ཧྲོཾ་། ཧྲ་ཧྲ་། ཕེཾ་ཕེཾ་། ཕཊ་ཕཊ། ད་ཧ་ད་ཧ། པ་ཙ་པ་ཙ། བྷཀཥ་བྷཀཥ། བ་ས་རུ་དྷི་རཱ་ནྟྲ་མཱ་ལཱ་བ་ལཾ་བཱི་ནེ། གྷྲིཧྣ་གྷྲིཧྣ་ས་པྟ་པཱ་ཏ་ལ་ག་ཏཱ་བྷུ་ཛཾ་ག་སརྦཾ་བཱ་ཏརྫ་ཡ་ཏརྫ་ཡ། །ཨཱ་ཀ་ཊ་ཧ། །ཨཱ་ཀ་ཊ་ཧ། །ཧྲཱིཾ་ཧྲཱིཾ། ཛྣོཾཛྣོཾ་། ༼ཀཾ་ཥ་ན་མཱ་ཀཾ་ཥ་ན་མཱ། །ཧཱུཾ་ཧཱུཾ། ཧཱི་ཧཱི།ཀི་ལི་ཀི་ལི། །སི་ལི་སི་ལི། །ཧི་ལི་ཧི་ལི།དྷི་ལི་དྷི་ལི། །ཧཱུཾ་ཧཱུཾ་ཕཊ།མཆོད་པའི་དུས་སུ་༼དཔའ་བོ་ཉི་ཤུ་རྩ་བཞི་༽ །རིག་པའི་རྒྱལ་པོ་གསང་སྔགས་༼ཏེ་ཟེར་༽ཏེ། །བསྒྲུབ་པ་༼ལ་མི་ལྟོས་ཏེ་ཀླགས་པ་ཙམ་གྱིས་འགྲུབ་པའོ་༽ཐམས་ཅད་རྣམ་སྤངས་པའོ། །འདི་ལས་ཤིན་ཏུ་མཆོག་གྱུར་པ། །འཇིག་རྟེན་གསུམ་ན་ཡང་མེད་དེ་ ༼ཡོད་མིན་ཟེར་༽། །དཔལ་ལྡན་ཁྲག་འཐུང་༼གི་རྩ་སྔགས་༽སྔགས་ཤེས་ན། །༼སྔགས་༽གཞན་དག་སྙིང་པོ་མེད་རྩར་མཚུངས། དཔལ་ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་རྩ་བའི་སྔགས་ཀྱི་ཡི་གེ་བཏུ་བ་ཞེས་པའི་ཆོ་གའི་ལེའུ་སྟེ་ལྔ་པའོ། ། ༼སྙིང་པོའི་སྔགས་དང་ཉེ་སྙིང་གི་སྔགས་རང་འོག་ནས་འབྱུང་ཡང་འདིར་རྩ་བའི་སྔགས་དང་ཕྱོགས་༡་ཏུ་བསྟན་པའི་ཕྱིར་འདིར་ཡང་ཟུར་ཙམ་བསྟན་༽ །གཞན་ཡང་ཡི་གེ་ཉི་ཤུ་གཉིས་༼པ༽། །སྙིང་པོ༼འི༽་ཡིག་༼གེ་༽བདུན་ཉེ་སྙིང་པོ༼འོ༽། །ཡ་ཚོགས་༼ཡ་ནས་བགྲངས་པའི་༽བརྒྱད་པའི་ས་བོན་དང་། །དེ་བཞིན་༼བཅུ་༢་བྲིས་ལ་ཨ་ལི་ལ་བྱ་༽གུག་བསྒྱེད་༼རི་རཱི་ལི་ལཱི་༤་བོར་བ་༽བཅུ་གཉིས་ཀྱིས། །ཡི་གེ་བར་མ་༼རིང་པོ་དྲུག་༽དོར་བྱས་ལ་༼རིང་པ་དྲུག་བོར་བས་ཐུང་པ་དྲུག་གོ་༽། །༼ཧ་དྲུག་པོའི་ཡན་ལག་ཏུ་སྦྱར་བའོ་༽ཡན་ལག་དྲུག་༼ལ་དགོད་པ་༽ནི་ཧེ་རུ་ཀ །༼ཡི་གེ་དྲུག་པོ་༽དཔའ་བོ་དྲུག་དང་མཉམ་སྦྱོར་བ་༼ཧ་དྲུག་བཀོད་པ་དེ་ཉིད་ལ་ཨ་ལི་ཐུང་པ་དྲུག་་་་བས་ཧི་ཧེ་་་་༽། །ཡི་གེ་རེ་རེ་ཡང་དག་སྦྱར། ༼དེ་རྣམས་ཀྱི་གོང་དུ་ཨོཾ་སོགས་རེ་རེ་སྦྱོར། ཧའི་མགོ་ སྦྱར་བས་ཨོཾ་ཧ་རུ་འགྲོ་དེས་འགྲེ་༽ །ཨོཾ་ན་མ་སྭཱ་ཧཱ་པོ་ཥཊ༽ །ཧཱུཾ་ཧཱུཾ་ཕཊ་དང་ཡང་དག་ལྡན། །བསྒྲུབ་བོས་༼དཔའ་བོ་དྲུག་གི་༽སྙིང་པོར་ཤེས་པར་བྱ། ༼ ལེའུ་ལྔ་པ་རུ་ལུས་ཐུ་བའི་ཡི་གེ་འདྲི་ཙ་ན། ན་མ་བྱ་བའི་གོང་དུ་ཨོཾ་བྲི་བའི་གོག་པ་གཅིག་བཞག་ནས་ཡོད་པ་དེར་ལྔ་བའི་ཡན་ལག་ཐུ་ཙ་ན་དབྱངས་ཡིག་བཅུ་༣་ཉིད་ཟེརཅི་ན་དེར་ཨོཾ་བྲིའོ༽ །དང་པོ་སྙིང་ཁ་ཉིད་དུ་སྟེ། །གཉིས་པ་སྦྱི་བོར་ཤེས་པར་བྱ། །གསུམ་པ་སྤྱི་གཙུག་དག་ཏུ་སྦྱར། །བཞི་པ་གོ་ཆར་གྱུར་པ་༼སྦྲགས་པ་༽ཡིན། །ལྔ་པ་མིག་ཏུ་གྱུར་པ་སྟེ། །དྲུག་པ་མཚོན་བྱ་ཞེས་བྱར་འདོད། །ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་དཔའ་བོ་དྲུག་གི་གོ་ཆ་བཏུ་བའི་ཆོ་གའི་ལེའུ་སྟེ་དྲུག་པའོ། ། དེ་ནས་༼ཨོ་༽དབྱངས་ཡིག་བཅུ་གསུམ་པ། ༼ཡི་གེ་གཉིས་པ་ཅེས་པ་ལ་སོགས་པའི་གྲངས་རྣམས་སྔར་ཀ་ལི་ལས་ལུས་བཏུས་པའི་ཡི་གེ་བཀོད་པ་རྣམས་ཀྱི་གྲངས་སུ་ཤེས་པར་བྱའོ༽ །ཡི་གེ་གཉིས་བ་དག་དང་སྦྱར༼མ་ལས་ཨོ་སྦྱར་བས་མོ་རུ་འགྲོ་དེས་འགྲེ༽། །དབྱངས་ཡིག་བཅུ་གཅིག་༼ཨེ་༽ཡང་དག་ལྡན། །ཡི་གེ་དྲུག་པ་༼ཏེའུ་སོང་༽ཡང་དག་བརྒྱན། །དབྱངས་ཀྱི་བཞི་པ་༼ཨཱི་༽ཉིད་དང་ནི། །ཡི་གེ་བདུན་པ་༼ཝ་༽ཉིད་དང་སྦྱར། །དབྱངས་ཡིག་བཅུ་གཅིག་པ་༼ཨེ་༽ཉིད་ནི། །མཁས་པས་ཡི་གེ་བརྒྱད་པ་༼ར་༽སྦྱར། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དང་ལྡན་པ། །ཡི་གེ་དགུ་པ་༼ཤ་༽བརྒྱན་པར་བྱ། །༼རྐང་པ་དང་པོ་༽དབྱངས་ཀྱི་ཡི་གེ་གཉིས་པ་༼ཨཱ་༽ཉིད། །ཡི་གེ་བཅུ་གཉིས་པ་༼ཧ་༽དང་སྦྱར། །༼འོག་མ་འདིས་པ་རིང་པོར་སོང་སྟེ་ཨར་རླག་འགྲོ་༽དབྱངས་ཡིག་གཉིས་པར་༼ཨཱ་༽ལྡན་པ་ནི། ༼ཀ་ལི་རང་གི་ཀ་ནས་བགྲངས་པའི་༽ །ཡི་གེ་ཉི་ཤུ་གཅིག་པ༼འོ་པ༽་གཟུང་། ༼མཁས་པས་༽ །ཡི་གེ་བཅུ་བཞི་པ་༼ལ་༽དང་༼ བས་ལ་ལས་པ་རིང་པོར་ལཱ་བཏགས་པ་༡་ཏུ་འགྱུར་རོ། ལས་འོག་ཏུ་སྦྱར་བའོ་༽སྦྱར། །ཡི་གེ་ཉི་ཤུ་པ་༼ན་༽དང་ནི། ༼ག་དང་ན་ཉ་ཀ་ལ་༽ །དབྱངས་ཀྱི་༼ཨི་གུ་གུར་སྦྱིན་༽གསུམ་པ་༼ཨི་༽ཉིད་དག་དང་། །ཡི་གེ་༼པ་ཨ་ལུས་ན་མེད་པས་བོར་བས་༽བཅྭ་ལྔ་པ་༼དེ་༢་ཀ་༽དང་སྦྱར། །དབྱངས་ཡིག་བཅྭ་ལྔ་༼ཨཾ་༽ཡང་དག་༼སྟེང་དུ་༽ལྡན་༼པའི༽། །ཡི་གེ་བཅུ་དྲུག་བས་༼ས་༽མཛེས་བྱ་༼སཾ་དུ་སོང་༽། །དབྱངས་ཡིག་གསུམ་པ་༼ཨི་༽དང་ལྡན་པའི། །ཡི་གེ་བཅུ་བདུན་པ་༼ན་༽རུ་འདོད། །དབྱངས་ཀྱི་གཉིས་པ་༼ཨཱ་༽ཉིད་དང་ནི། །ཡི་གེ་བཅྭ་བརྒྱད་པ་༼བྷ་༽རུ་སྦྱར་༼༢་པ་༽། །དབྱངས་ཡིག་གི་ནི་གཉིས་པ་༼ཨཱ་༽ཉིད། །ཡི་གེ་ཉི་ཤུ་གཅིག་པར་༼ཊ་༽སྦྱར། །མ་མོའི་ལྔ་པ་༼ཨུ་༽ཉིད་དང་ནི། །ཡི་གེ་ཉི་ཤུ་གསུམ་པར་༼ཀ་༽སྦྱར་༼ཀུ་རུ་འགྲོ༽། །དབྱངས་ཡིག་བཅུ་གསུམ་པ་ཨོ་༽ཉིད་ནི། །ཡི་གེ་ཉི་ཤུ་བཞི་པར་༼ཊ༽་སྦྱར། །དང་པོའི་དང་པོ་༼ཀ་༽བླངས་ནས་ནི། །ཡི་གེ་ཉི་ཤུ་ལྔ་པར་༼ཏ་༽སྦྱར་༼ཀཾ༽། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དང་ལྡན་པར། །ཡི་གེ་ཉི་ཤུ་དྲུག་པར་༼ཊ་༽འགྱུར་༼༣་པ༽། །ཉི་ཤུ་བརྒྱད་པ་༼ཌ་༽ཉིད་དག་ནི། །༼ཨ་ལི་༽དབྱངས་ཡིག་བཅྭ་ལྔ་པ་༼ཨཾ་༽དང་སྦྱར། །ཡི་གེ་ཉི་ཤུ་རྩ་དགུ་པ་༼ཥ་ལ༽། །གསུམ་པའི་དང་པོ་༼ཊ་༽ཡང་དག་ལྡན་༼དེ་ལ་ཡང་༽ ། ༼འོག་ཏུ་བཏགས་པས་ཥཊ་༽ །འོག་གི་ཆ་༼ར་༽ནི་མེ་དང་བཅས། ༼དེ་ལ་༽ །དེ་བཞིན་དབྱངས་ཡིག་གཉིས་པར་༼ཨཱ་༽སྦྱར་༼ཥཊ་༽། །ཡི་གེ་སུམ་བཅུ་རྩ་གཅིག་པ་༼ར་༽། །དབྱངས་ཡིག་གཉིས་པར་༼ཨཱ་༽ཡང་དག་སྦྱར། །ཡི་གེ་སུམ་བཅུ་རྩ་གཉིས་པ་༼ལ་༽། །དབྱངས་ཡིག་བཅུ་གསུམ་བར་༼ཨོ་༽ལྡན་བྱ། །ཡི་གེ་སུམ་བཅུ་རྩ་གསུམ་པ་༼ག་༽། །ཉི་མར་༼ར་༽ཡང་དག་ལྡན་པར་བྱ། །ཕྱི་མོའི་བཞི་བ་༼ཨཱི་༽ཉིད་དག་དང་། །ཡི་གེ་སུམ་བཅུ་བཞི་༼བྷ་༽ལྡན་པ། ༼སྔགས་ཀྱི་ཆེ་བ་བསྟན། དེས་ཐམས་ཅད་ལ་འགྲེའོ་༽ །འདོད་པའི་དོན་ཀུན་སྒྲུབ་བྱེད་ཡིན། །ཕྱི་མོའི་ལྔ་པ་༼ཨུ་༽ཉིད་དང་ནི། །སུམ་བཅུ་བདུན་པར་༼མ་༽ཡང་དག་ལྡན། །མཁའ་འགྲོ་མ་རྣམས་སྒྲུབ་བྱེད་ཡིན། །སུམ་བཅུ་བརྒྱད་པ་༼ཁ་༽ཉིད་དག་ནི། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དང་སྦྱར་བ་༼བཞི་བ་༽། །ལྷ་རྣམས་ཐམས་ཅད་བསྒྲུབ་པ་ནི། །འདི་ཉིད་ཡིན་པར་ཐེ་ཚོམ་མེད། །བཞི་བཅུ་རྩ་གཉིས་པ་༼ས་ ༽ཉིད་ནི། །མེ་༼ར་༽་དང་འོག་ཏུ་བསྒྲུབ་པོས་སྦྱར། །བཞི་བཅུ་གསུམ་པ་༼བྷ་༽ཉིད་དང་ནི། །དབྱངས་ཡིག་ལྔ་པ་༼ཨུ་༽ཉིད་དང་སྦྱར། །ཡི་གེ་བཞི་བཅུ་ལྔ་པ་༼བྷ་༽ནི། །དབྱངས་ཀྱི་ཡི་གེ་གཉིས་པར་༼ཨཱ་༽སྦྱར། །དབྱངས་ཀྱི་ལྔ་པ་༼ཨུ་༽ཉིད་དག་དང་། །བཞི་བཅུ་རྩ་དྲུག་པར་༼ས་༽ལྡན་པ། །༼འདིས་༽དཔའ་བོ་ཐམས་ཅད་རབ་མཆོད་ཡིན། །བཞི་བཅུ་རྩ་བདུན་པ་༼ར་༽ཉིད་ནི། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དང་སྦྱར་བ། །རྡོ་རྗེ་སེམས་དཔའ་མཆོག་ཏུ་འདོད། །དེ་བཞིན་ལྔ་བཅུ་རྩ་གཅིག་པ་༼ཤ་༽། །དབྱངས་ཡིག་ལྔ་པ་༼ཨུ་༽ཉིད་དག་གིས། །མཛེས་པ་མཆོག་ནི་ཡིན་པར་འདོད། །ལྔ་བཅུ་རྩ་གཉིས་པ་༼པ་༽ཉིད་ནི། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དང་སྦྱར་བ། །ལྷ་རྣམས་ཐམས་ཅད་སྒྲུབ་བྱེད་པ། །འདི་ཉིད་ཡིན་པར་ཐེ་ཚོམ་མེད། །དེ་བཞིན་ལྔ་བཅུ་རྩ་གསུམ་པ་༼ཤ་༽། །དབྱངས་ཡིག་བཅུ་གསུམ་པ་༼ཨོ་༽དང་སྦྱར། །ཡི་གེ་རྣམས་ལས་འདི་མཆོག་སྟེ། །དགྲ་རྣམས་ངེས་པར་གསོད་བྱེད་ཡིན། །ཡི་གེ་ལྔ་བཅུ་རྩ་དྲུག་པ་༼ཤ་༽། །དབྱངས་ཡིག་དྲུག་པ་༼ཨཱུ་༽དག་དང་ལྡན། །ཡི་གེ་ལྔ་བཅུ་རྩ་དགུ་པ་༼ཊ་༽། །ཨན་ཏསྡྱ་ཡི་༼ཝ ༽བཞི་པ་༼ཊ་ ཝ་༽དང་། །༼དེ་ལ་༽དབྱངས་ཡིག་གཉིས་པར་༼ཨཱ་༽ལྡན་པར་བྱ། ༼དེ་ལ་༽ །དེ་བཞིན་༼ ཨོཾ་༽བཅྭ་ལྔ་པ་༼ཊཾ་༽དང་༼སྟེང་དུ་༽སྦྱར། །དངོས་གྲུབ་ཐམས་ཅད་བསྒྲུབ་པ་ཡིན། །ཡི་གེ་དྲུག་བཅུ་རྩ་གཅིག་༼དྷ་༽ཉིད། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དག་དང་སྦྱར། །འདི་ཉིད་མཆོག་ནི་ཡིན་པར་བཤད། །དེ་བཞིན་དྲུག་བཅུ་རྩ་གཉིས་པ་༼ར་༽། །དབྱངས་ཡིག་གསུམ་པར་༼ཨི་༽སྦྱར་བ་ནི། །མཁའ་འགྲོ་མ་ཡི་མཆོག་ཏུ་འདོད། །ཡི་གེ་དྲུག་བཅུ་རྩ་གསུམ་༼ཎ་༽ཉིད། །དབྱངས་ཡིག་བཅུ་གཅིག་༼ཨེ་༽དག་དང་ལྡན། །མཛེས་པའི་ཡི་གེ་ཀུན་མཆོག་༼དྲུག་པ་༽ཡིན། །དྲུག་བཅུ་རྩ་བཞི་པ་༼བྱ་༽ཉིད་ནི། །དབྱངས་ཡིག་གཉིས་པར་༼ཨཱ་༽ཡང་དག་ལྡན། །གྲུབ་སྦྱིན་ཐར་པའི་སྦྱན་ཆེན་པོ། །ཡི་གེ་དྲུག་བཅུ་རྩ་ལྔ་པ་༼གྷ་༽། །རྡོ་རྗེ་སེམས་དཔས་༼ར་༽ཕྱེ་བ་དག །ཡི་གེ་དྲུག་བཅུ་རྩ་དྲུག་པ་༼ཛ་༽། །དབྱངས་ཡིག་གསུམ་པར་༼ཨི་༽ཡང་དག་སྦྱར། །དངོས་གྲུབ་ཀུན་སྦྱིན་བདེ་གཤེགས་གསུངས། །ཡི་གེ་དྲུག་བཅུ་རྩ་བདུན་པ་༼ན་༽། །ཡི་གེ་གཉིས་པར་༼ཨཱ་༽ཡང་དག་ལྡན། །རྣལ་འབྱོར་མ་ཡི་དགོས་པ་ཀུན། །འདི་ཉིད་བྱེད་པར་ཐེ་ཚོམ་མེད། །དྲུག་བཅུ་བརྒྱད་པ་༼མ་༽ཉིད་དག་ལ། །འདི་ནི་ཡི་གེ་བ་སྦྱར་བ། །འོག་གི་ཆར་ནི་བརྟག་པར་༼མ༠༽བྱ། ༼མ་ལ་ནི་བཏགས་པས་༽ །ཡི་གེ་བདུན་བཅུ་རྩ་གཅིག་པ་༼ར་༽། །༼དབྱངས་ཀྱི་༽ཡི་གེ་གཉིས་པར་༼ཨཱ་༽ཡང་དག་སྦྱར། །ཡི་གེ་ཀུན་ལ་མཛེས་པ་ནི། །འདི་ཉིད་ཡིན་པར་ཐེ་ཚོམ་མེད་༼བདུན་པ་༽། །བདུན་བཅུ་རྩ་བཞི་པ་༼ཏ་༽ཉིད་ནི། །དབྱངས་ཡིག་གཉིས་པར་༼ཨཱ་༽སྦྱར་བ་དག །གདོད་ནས་གྲུབ་པ་ཡིན་པར་ནི། །དེ་བཞིན་གཤེགས་པའི་ཞལ་ནས་གསུངས། །ཡི་གེ་བདུན་བཅུ་ལྔ་པ་༼དྷ་༽ཉིད། །མ་མོའི་དྲུག་པ་༼ཨཱུ་༽དང་ལྡན་པ། །འདི་ནི་རྣལ་འབྱོར་མཆོག་ཡིན་ཏེ། །དགེ་བ་ཀུན་ལ་དམ་པ་ཡིན། །བདུན་བཅུ་རྩ་དྲུག་པ་༼མ་༽ཉིད་ནི། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དང་ལྡན་ཞིང་། །འཏག་ཏུ་མེ་དང་ལྡན་པ་ལས། །ཡི་གེ་པ་དང་སྦྱར་བར་བྱ་༼རའི་འོག་ཏུ་ཡང་་ལག་ལེན་ཡིན་ནོ་༽མ༠། །གཞན་དག་མཛེས་པ་ཡོད་མ་ཡིན། །ཡི་གེ་བདུན་བཅུ་རྩ་བདུན་པ་༼ན་༽། །དེར་ནི་དྷ་དང་སྦྱར་བར་བྱ། །༼ན་ལ་ཧ་བཏགས་པས་གྷ་༽མཁའ་འགྲོ་མ་ཡི་མཛེས་པར་འདོད། །བདུན་བཅུ་རྩ་བརྒྱད་པ་༼ཀ་༽ཉིད་ནི། །དབྱངས་ཡིག་གཉིས་པ་༼ཨཱ་༽དག་དང་སྦྱར། །རྒྱུ་ཡི་མཆོག་ནི་ཡིན་པར་འདོད། །ཡི་གེ་བརྒྱད་བཅུ་རྩ་གཅིག་པ་༼པ་༽། །༼ཨའི་༤་བའི་མཐར་ཨུ་༽བཞི་པའི་མཐའ་ཡིས་ཁྱད་པར་༼པ་ལ་ ་ས་ལ་ ཨུ་བཏགས་པས་པུའོ་ ་༽དབྱེ། །གདོད་ནས་གྲུབ་བྱེད་༼དངོས་གྲུབ་༽འདི་ཡིན་ཏེ། །༼འབྲས་བུའི་༽དངོས་གྲུབ་ཀུན་ལ་འཇུག་བྱེད་པའོ། །ཡི་གེ་བརྒྱད་བཅུ་རྩ་གཉིས་པ་༼ཥ་༽། །དེ་བཞིན་དབྱངས་ཡིག་གཉིས་པར་༼ཨཱ་༽སྦྱར།༼ བརྒྱད་དོ་༽ །འདི་ནི་རྩ་བའི་གསང་སྔགས་སུ། །མཁས་པ་རྣམས་ཀྱིས་ཤེས་པར་བྱ། །དངོས་གྲུབ་ཀུན་གྱི་གནས་ཡིན་ཞིང་། །མཁའ་འགྲོའི་སྙིང་ནི་འཇོམས་པ་༼འགུགས་པ་༽ཡིན། །དཔལ་ལྡན་ཁྲག་འཐུང་ལྟ༼འི་༽རིག་༼སྔགས་༽རྒྱལ་༼པོ༽། །ཀླགས་པས་འགྲུབ་པ་དོན་ཡོད་པ། །ཨོཾ་ནི་དང་པོར་སྦྱར་བར་བྱ། །ཧཱུཾ་༼ཧཱུ་༽དང་ཕཊ་ནི་༼ཀུན་གྱི་༽མཐའ་མར་སྦྱར། ༼རྐང་བ་རེ་རེའི་བར་དུ་ཧཱུཾ་ཕཊ་སྦྱར་བ་འོག་ནས་ཀྱང་འབྱུང་ངོ་༽ །འདི་ནི་རྩ་བའི་གསང་སྔགས་ཏེ། །བསྒྲུབ་པ་ཐམས་ཅད་༼དངོས་གྲུབ་༽འགྲུབ་བྱེད་ཡིན། །ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་སྔགས་བཏུ་བའི་ཆོ་གའི་ལེའུ་སྟེ་བདུན་པའོ། །དེ་ནས་༼དངོས་གྲུབ་༽ཐམས་ཅད་བདག་ཉིད་ཀྱིས། །དཔའ་བོ་ཐམས་ཅད་༼དང་༽མཉམ་སྦྱོར་བ།༼ཡབ་ཡུམ་ཞལ་སྦྱོར་མི་བྱེད་པར་བཞུགས་པའོ་གསུང་༽  །མཁའ་འགྲོ་མ་ཡི་༼ཚོགས་པའམ་༽དྲ་བ༼འི༽་སྡོམ་༼པ༽། །༼གཙོ་བོའི་མཚན་༽འཁོར་ལོ་བདེ་མཆོག་ཡིན་པར་འདོད། །ཧཱ་སྭཱ་ར་བྷ་སཾ་ལཱ་ཛྭ་ནཱི་ཀཱི་ཌཱ་ཊཕ་ཧཱུཾ་ཧཱུཾ་ཀཾ་རུ་རུ་ཧེ་ཧེ་ཛྲབ་ཤྲི་ཨོཾ།༼ཡི་གེ་འགོད་པ་དང་ཀློག་པ་ནི་ཨོཾ་ནས་རིམ་པས་བྱའོ་༽ །རིག་པའི་རྒྱལ་པོའི་སྙིང་པོ་ནི། །མ་བྱུང་འབྱུང་བར་མི་འགྱུར་རོ། །ཕཊ་ཧཱུཾ་ཧྲཱིཾ་ཧྲཱིཾ་ཧིཾ་ཨོཾ་། ༼གོང་མ་རྣམས་ཨོཾ་ནས་རིམ་པས་འགོད་པ་ལ་འདི་དག་རིམ་པས་སྦྱར་ཏེ་འགོད་དོ་༽ །ཡི་གེ་༼ཨོཾ་ལས་རིམ་པས་སྦྱར་༽བཾ་༼ཧཾ་ལ་༽དང་ཡོཾ་དང་ནི། །ཡི་གེ་མོཾ་དང་ཧྲཱིཾ་༼ཧྲཱིཾ་ལ་༽ཉིད་དང་། །ཧཱུཾ་༼ཧཱུཾ་ལ་༽དང་ཕཊ་༼ཕཊ་ལ་སྦྱར་༽ཅེས་བཤད་པ་ནི། །རྣལ་འབྱོར་མ་ནི་དྲུག་ཏུ་གྲགས། །ཨོཾ་བཛྲ་བཱཻ་རོ་ཙ་ནི་ཡེ་ཧཱུཾ་ཧཱུཾ་ཕཊ་སྭཱ་ཧཱ། །མཁའ་འགྲོ་མ་ཡི་རིག་པ་ཆེ། །མ་བྱུང་འབྱུང་བར་མི་འགྱུར་རོ། ༼གསང་སྔགས་༢། སྙིང་པོ་༢༡་་་་ཆ། ཉེ་སྙིང་༡་ཏེ་བཞི་༽ །ས་སྟེངས་ན་ནི་རིན་ཆེན་བཞི། ༼དེ་དག་༽ །ཕྲེང་བའི་སྔགས་ནི་དམ་པ་ཡིན། །མཁའ་འགྲོ་མ་ཡི་རིག་པ་ཆེ། །རིག་པའི་རྒྱལ་པོ་ཧེ་རུ་ཀ །ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་གོ་བཟློག་པའི་སྙིང་པོ་དང་རྣལ་འབྱོར་མ་དྲུག་གི་སྔགས་བཏུ་བའི་ཆོ་གའི་ལེའུ་སྟེ་བརྒྱད་པའོ། །༼དེ་ལྟར་ཡི་གེ་བཏུ་བས་འབྲས་བུའི་གསང་པ་ལ་འཇུག་པའི་ཡན་ལག་བསྟན་ནས་འཇུག་པ་དངོས་སྟོན་ཏེ་༽དེ་ནས་༼ལེའུ་དང་པོར་འདོད་པའི་དོན་ཀུན་སྒྲུབ་བྱེད་པ་ལ་སོགས་པས་བསྟན་པའི་འབྲས་བུའི་གསང་པ་འདིར་རྒྱས་པར་བཤད་དེ། དེ་ལས་ཀྱང་མཆོག་བསྒྲུབ་པ་ལ་བསྟན་ཏེ་༽རྩ་བའི་སྔགས་ཀྱི་ནི། །ལས་མཆོག་༼དུ་མ་འགྲུབ་པར་བྱེད་པའི་༽གོ་རིམས་ཇི་བཞིན་དུ། །དེ་ནི་རྣམ་པར་བཤད་བྱ་སྟེ་། ༼སྤྱི་དོན་གཉིས་ལས་དང་པོ་ལོ་ཀ་བ་མནན་པའི་ལས་༽ །འཇིག་རྟེན་གསུམ་ན་གང་ཡོད་རྣམས། །༼རབ་ཀྱིས་༽ཐམས་ཅད་༼དུས་མྱུར་པར་༽སྐད་གཅིག་གིས་༼རྩ་བའི་སྔགས་ཀྱིས་༽འགྲུབ་པར། །ལས་རྣམས་ཐམས་ཅད་བྱེད་པའོ། ༼དེ་གང་ཞེ་ན་དབང་པོ་རབ་ལྷའམ་རྩ་བའི་སྔགས་དྲན་པ་ཙམ་གྱིས་འགྲུབ་པ་སྟེ་འོང་། རབ་ཀྱིའོ༽ །ལྷ་ཐམས་ཅད་ཀྱི་སྐྱེ་གནས་༼ནས་བསྐྱོད་པར་བྱེད་ཀླུ་ལ་སོགས་པ་སྐྲོད་པར་བྱེད་༽དང་༼ཏེ་རིགས་དྲུག་གི་མ་ལ་ཡང་འཇིགས་པར་བྱེད་པ༽། །ལྷ་ཐམས་ཅད་ཀྱི་གནས་དང་། །ཀླུ་ཐམས་ཅད་དང་། །གནོད་སྦྱིན་ཐམས་ཅད་དང་། །དྲི་ཟ་ཐམས་ཅད་༼ལྷའམ་རྩ་བའི་སྔགས་ཡིད་ལ་༽དྲན་པ་ཙམ་གྱིས་གསོད་པར་བྱེད་དོ༼དབང་པོ་རབ་ཀྱིས་འདི་ལྟར་འབྲིང་བསམ་གཏན་དང་སྔགས་༢་ཀྱིས། ཐ་མས་འཁྲུལ་འཁོར་དང་༣། དེ་བས་ཀྱང་ཐ་ཤལ་གྱིས་སྦྱིན་སྲེག་དང་བཅས་པས་འགྲུབ་གསུང་༽ ༼ཐ་མ་འང་༢་ཀྱིས་སོ་༽ །སྤྲིན་རྣམས་འཐོར་བར་བྱེད་པ་དང་། ༼ རྡོ་རྗེ་མཁའ་འགྲོ་མ་ལ་བརྟེན་ ༼༢་པ་ཙཀྲ་ལ་བརྟེན་པ་པད་མ་བརྟེན་པའི་ལས་དུ་མ་བསྟན་པའོ། རས་རིས་ལ་བརྟེན་པ་དང་འཁྲུལ་འཁོར་ལ་བརྟེན་པ་༢་ཀྱིས་སོ༽ །ཆར་འབེབས་པར་བྱེད་དོ།༼རས་རིས་ཡིན་ན་སྤེལ་ཚིག་སྤོས་པས་ཆོག འཁྲུལ་འཁོར་ཡིན་ན་འོ་མས་བཀྲུ་བ་དང་སྤེལ་ཚིག་སྤོ་བའོ་༽ །༼ཆར་ཆེས་ཆེ་བ་༽བཟློག་པར་བྱེད་དོ། །༼འཁོར་ལོ་དེ་གྱོ་མོ་ལ་བྲིས་ལ་རབ་གནས་ལ་སོགས་པ་ཐམས་ཅད་བྱས་ཏེ། དེ་ནས་བཅག་ཏེ་རྒྱ་མཚོར་དོར་ན་༽རྒྱ་མཚོ་སྐེམས་པར་བྱེད་དོ། །ཆུ་བོ་རྒྱུན་ཕྱོགས་ལས་༼གྱེན་ལ་༽བཟློག་སྟེ་འབབ་པར་སྟོན་སྟོ། ༼འཁོར་ལོ་སྔ་མ་ཉིད་བྲིས་ཏེ་རབ་གནས་བྱས་ཏེ་ལུས་ལ་བཏགས་པའམ་ཙཀྲ་དེ་ལག་པ་གཡོན་པ་ལ་བྲིས་ཏེ་སྔགས་སྤེལ་ཚིག་དང་བཅས་པ་བཟླས་ན་༽ །དབང་པོ་༼ཐོག་༽བཟློག་པར་བྱེད་དོ། །གསང་སྔགས་འདི་བཟླས་བརྗོད་འབུམ་བྱས་ན། ༼ལག་པ་གཡོན་པ་ལ་སྤེལ་ཚིག་དང་བཅས་འཁོར་ལོ་བྲིས་ཏེ་སྤེལ་ཚིག་ངངར་བཅས་པ་བཟླས་ཏེ་ས་ལ་བརྟབས་ན་༽ །ས་གཡོ་བར་བྱེད་དོ། ༼བ་རུ་རའི་ཤིང་ལ་ལྷམ་ལྟ་བུར་བྱས་ཏེ་དེའི་ཞབས་སུ་ཙཀྲ་བཅུག་ནས་༽ །ཤིང་ལ་འཛེགས་ཏེ་གང་དུ་འདོད་པ༼འི་ཡུལ་དུ་༽དེར་༼ནམ་མཁའ་ལ་༽འགྲོ་བར་བྱེད་དོ། ༼འཁོར་ལོ་དེ་ཉིད་སྤེལ་ཚིག་དང་བཅས་པ་བྲིས་ཏེ་རབ་ཏུ་གནས་པ་བྱས་ཏེ་བཏགས་ན་ཕ་རོལ་གྱི་༽ །སྔགས་༼དངོས་གྲུབ་༽ཐམས་ཅད་འཕྲོག་པར་བྱེད་པ་དང་། ༼ཕ་རོལ་པོས་གཏེར་དང་རལ་གྲི་ལ་སོགས་པ་བསྒྲུབ་པ་དེ་༽ །དངོས་གྲུབ་ཐམས་ཅད་འཕྲོག་པར་བྱེད་དོ། ༼དཔའ་བོའི་ཐོད་པའི་ཁྲག་ལ་སོགས་པས་བྱ་བའི་སྦྱོར་བ༽ །ཁྲག་འདྲེན་པར་བྱེད་པ་དང་། །སླར་ཡང་༼དེ་སོས་པར་༽གཏོང་པར་བྱེད་དོ། ༼པར་དུ་བ་ ་ཐོད་པ་དུ་མ་བསགས་པ་དེར་ཉུངས་དཀར་བཏབ་ཏོ། དེ་སྨིན་པར་བྱས་ནས་བླངས་ཏེ་ལུས་ལ་བཏགས་ན་༽ །གཟུགས་བརྒྱ་ཕྲག་སྟོང་དུ་མར་༼རྫས་དེདཾ་བསམས་པའི་བྱེ་བྲག་གིས་བགྲུབ་སྟེ་༽བྱེད་དོ། ༼ལུས་༽ །འདོད་ན་སྣང་བར་བྱེད་ཅིང་། ༼བསམས་པས་༽ །མི་འདོད་ན་༼ལུས་༽མི་སྣང་བར་བྱེད་དོ། ༼འཁོར་ལོ་སྔ་མ་ཉིད་རྫ་གསཾ་པ་ལ་བྲིས་ལ་རབ་གནས་བྱས་ཏེ་བཅག་ནས་༽ །ཁང་བཟང་༼ལ་བསྣུན་ན་ཡང་༽དང་ཤིང་གི་རྩེ་མོ་ལ་སོགས་པ་༼མཐོན་པོ་ལ་བསྣུན་དེ་ ཁབ་ལོང་སྣ་བདུན་གང་རུང་ལ་བྱས་པའི་ཁ་ཊཾ་ཀ་བྱས་ལ་དེའི་ཐོད་པ་ལ་ཡང་སྤེལ་ཚིག་བྲིས་ཏེ་བཙུགས་པས་བསྣུན་་་་ ་ཡིན་གྱི་ངོ་བོ་ངེས་པ་མེད་གསུང་དྲིས་པས་༽ཕྱེ་མར་བྱེད་དོ། །༼ལག་པ་གཡོན་པ་ལ་ཙཀྲ་བྲིས་ཏེ་སྦྱོར་བ་བྱས་ན་༽དུག་བདུད་རྩིར་བྱེད་པ་དང་། །༼བདུད་རྩི་ལག་པར་བླུགས་ན་༽བདུད་རྩིར་ཡང་དུག་ཏུ་བྱེད་དོ། ༼ཆང་འོ་མར་ཨརྒའི་ཤིང་གི་ཕྱེ་མ་ལ་རྩ་བའི་སྔགས་བཟླས་ཏེ་འོ་མར་བྱས་པའི་སྤེལ་ཚིག་དང་བཅས་པར་བྱས་ན༽ །ཟླ་བ་ཆུར་བྱེད་པ་དང་། །༼འོ་མ་ཆང་ཆུར་༽ཆུ་ཟླ་བར་བྱེད་དོ། །དྲི་རྣམས་༼ངན་པ་བཟང་པོར་བཟང་པ་ངན་པར་༽འཕྲོག་པར་བྱེད་དོ། །གང་དུ་འདོད་པ་༼རིགས་བཟང་པོ་ངན་པར་༽དེར་འཕོ་བར་བྱེད་དོ། །༼ཤིང་གི་འབྲས་བུ་ཁའི་མཆུ་ལྟར་འོང་བ་༽ནམ་མཁའ་ལྡིང་གི་གདོང་དང་། ༼དེ་ཞུ་ཚོད་ཙ་ན་༽ །ཟླ་བ་འདུས་པ་ལ་ལྷ་མོ་དང་ཀུན་དུ་སྤྱོད་པས་འགྲོ་བ་འབྱིན་པར་བྱེད་པ་༼དཔལ་དང་བསོད་ནམས་༽དང་། །མིའི་མཆོག་དེའི་ལག་མཐུལ་ལ་ཡོད་པའི་དཔལ་༼དང་བསོད་ནམས་༽གང་གིས་ཀྱང་མི་འཕྲོགས་པར་༼དང་འཕེལ་བར་༽འགྱུར་རོ། །རྣམ་པ་དེ་ལྟ་བུ་དང་ལྡན་པའི་༼གང་འདོད་པའི་༽དངོས་གྲུབ་ཐམས་ཅད་འབྲས་བུ་དང་བཅས་༼དེ་མི་འགྲུབ་མི་སྲིད་༽པར་འགྱུར་རོ། ༼དེདི་ནུས་པ་བརྟན་པའི་༽ །དྲན་པ་ཙམ་གྱིས་གསོད་པར་བྱེད་པ་དང་༼གསོ་བ་ཡང་ནུས་༽ ། ༼དུར་ཁྲོད་ཐལ་བ་དང་ཁྲག་གི་སྦྱོར་བས་ཤིང་མེར་སྣང་པ་ཡོད། ཁབ་ལེན་ལྕགས་ལས་རྡོ་རྗེ་རྩེ་༡་པ་བྱས་པའི་སྦྱོར་བས་༽མ་བསྐྱེད་པར་བྱེད་དོ། །ས་འོག་རྣམ་བར་འཇོམས་པར་བྱེད་༼གཏེར་ཐོན་པར་འགྱུར་༽པ་དང་། ༼ཐ་ཆེན་དང་ཤ་ཆེན་གྱི་སྦྱོར་བས་ གུ་གུམ་དང་ཤ་ཆེན་དང་དབང་པོ་ལྔའི་བདུག་པས་༽ །སེར་བ་འབེབས་པ་དང་། ༼ཀ་ར་བི་རའི་ཕྱེ་མ་ལ་སྔགས་བཟླས་པས་༽ །དྲན་པ་ཙམ་གྱིས་གློག་བསྐྱེད་བར་བྱེད་དོ། ༼ཕྱི་རོལ་པའི་༽ལྷ་ཐམས་ཅད་ཀྱི་༼རྐང་རྗེས་ཀྱི་ས་ལ་སོགས་པའི་རྫས་ལས་གཟུགས་བརྙན་བྱས་ལ་སྙིང་ཁར་ཙཀྲ་གཞུགས་པ་ལ་སོགས་པ་༽གཟུགས་བརྙན་གར་བྱེད་དུ་འཇུག་གོ གང་ཞིག་བསྒྲུབ་པའི་མིང་ནས་བཟུང་སྟེ། ལན་གཅིག་བཟླས་ན་དེ་དེའི་མོད་ལ་འཆི་པར་འགྱུར་རོ། །ས་མ་ལུས་པ་༼སྟེ་ས་གསུམ་༽རྣམས་ལ་ལོངས་སྤྱོད་༼པའི་བདག་པོར་༽པར་འགྱུར་རོ། འདོད་ན་སྡུད་པར་འགྱུར་རོ། བཅོམ་ལྡན་འདས་༼ཞེས་བོས་ནས་སུ་ ཞེས་བོས་པའི་ཚིག་འདི་ལ་བྷ་བ་པའི་བཞེད་པས་བཤད་རྒྱུད་རྣམས་ནི་ཡབ་ཀྱིས་གསུང་ནས་ཡུམ་གྱིས་བསྡུས་པ་ཡིན་ལ་རྩ་བའི་རྒྱུད་འདི་ནི་ཡུམ་གྱིས་གསུང་པས་ན་བ་ག་བན་ལ་་་ བོད་པའོ་ཞེས་འདོད་༽འདི་ལ་ནི་བརྟུལ་ཤུགས་མ་དགོས། ༼ལུས་ངག་གི་༽སྤྱོད་པ་དང་བསྙུང་བ་མི་དགོས་ཏེ། ཆོ་ག་༼འདི་ཀླགས་པ་ཙམ་གྱིས་འགྲུབ་པ་ཡིན་པས་སོ་༽འདིས་ཅི་འདོད་པའི་ལས་རྣམས་བྱའོ། གལ་ཏེ་ཁྲོས་པས་༼ སྣ་ནས་འོད་ཟེར་ནག་པོ་འཕྲོས་པའི་སྦྱོར་བས་སྦྱོར་བ་ རེ་རེ་ལ་སྤེལ་ཚིག་ཡོད་པ་ནག་པོའི་བསམ་པས་སྦྱར་ན་༽ལན་གཅིག་བཟླས་ན་བྱེ་བ་གསོད་པར་བྱེད་དོ། ཞི་བས་༼འོད་ཟེར་དཀར་པོས་༽བཟླས་ན་འཚོ་བར་བྱེད་དོ། དུར་ཁྲོད་ཀྱི་སོལ་བ་ལ་ལན་གཅིག་བཟླས་པས་གང་ལ་༼དངོས་སམ་གཟུགས་བརྙན་ལ་༽ཕོག་པ་དེ་དེའི་མོད་ལ་ལྟུང་བར་༼དོན་ལ་གསོད་པར་སུ་༽བྱེད་དོ། ༼ཁྱི་ཤི་བ་དང་ལྷན་༡་ཆུང་མ་བསྲེགས་པའི་ཐལ་བ་༽ཐལ་བ་ལ་ལན་གཅིག་བཟླས་ཏེ་གང་ལ་ཕོག་པ་དེ་༼དངོས་སམ་གཟུགས་བརྙན་ལ་༽དེའི་མོད་ལ་ཤ་ཟས་བཟུང་བར་༼དོན་ལ་འཆི་བར་༽འགྱུར་རོ། དུར་ཁྲོད་ཀྱི་སོལ་བ་ལ་ལན་གཅིག་བཟླས་ནས་སྤང་ལེབ་བམ་རྩིག་པའམ་མཚན་མ༼འི་ལྟེ་བ་༽་ལ་༼གཟའ་མིག་དམར་གྱི་མཚན་མ་ཕུར་བུ་འམ་རལ་གྲི་ལ་སོགས་པའི་༽གང་གི་མིང་བྲིས་པ་དེ་གདོན་ཆེན་པོས་བཟུང་བར་འགྱུར་རོ། །ཨ་ཏི་མུག་ཏའི་ལྕུག་མ་ལ་༼  མེ་ཏོག་དམར་པོ་ཁྲུ་ཕྱེད་དང་༢་ཙམ་ན་སྐྱེ་བ་༡་ཡོད་གསུང་༽ལན་གཅིག་བཟླས་ནས་༼དངོས་སམ་གཟུགས་བརྙན་༽གང་ལ་བསྣུན་པ་དེ་དེའི་མོད་ལ་རླུང་གི་ཤུགས་ཀྱིས་༼གམ་དུ་འོང་བའམ་དབང་དུ་༽འོང་བར་འགྱུར་རོ། ༼རྫ་ལ་ཙཀྲ་བྲིས་ཏེ་བཅག་ལ་༽གསེག་མ་ལ་ལན་གཅིག་བཟླས་ནས་གང་ལ་༼དངོས་སམ་གཟུགས་བརྙན་ལ་༽བརྡེག་པ་དེ་རེངས་པར་འགྱུར་རོ། ༼དུམ་བུ་བསྡུས་ཏེ་སླར་གཏོར་ན་ཡང་ཡུལ་གང་འདོད་པར་སྐྲོད་པར་འགྱུར་གསུང་༽ །གང་འདོད་པ་དེར་འགྲོ་བར་འགྱུར་རོ། །གུ་གུལ་གྱི་བདུག་པ་༼དང་རའི་ཡན་ལག་ལྔའི་ཤ་༽ལ་ལན་གཅིག་བཟླས་ཏེ་སྤོས་སུ་སྦྱར་ན། །སེམས་ཅན་ཐམས་ཅད་༼བསྙོ་ཞིང་འབབ་ཅོལ་སྨྲ་བ་ལ་སོགས་པར་འགྱུར་རོ་༽འབེབས་པར་འགྱུར་རོ། ལག་པ་༼གཡོན་པ་ལ་འཁོར་ལོ་བྲིས་ཏེ་༽ལ་ལན་གཅིག་བཟླས་ཏེ་༼ལག་པ་གཡས་པས་༽བཀབ་ན་དུག་གིས་ཟིན་པའི་དུག་སོས་པར་བྱེད་དོ། ༼སྔར་གྱི་འབེབས་གསོ་་་་བ་ཡང་གསུང་༽མཁའ་འགྲོ་མས་རྒྱས་བཏབ་པ་༼རྨོངས་ཤིང་སྨྲ་མི་ཤེས་པ་ལ་སོགས་པ་༽ལ་ལན་གཅིག་བཟླས་པའི་ཆུས་བཏབ་ན་རེངས་པ་གྲོལ་བར་བྱེད་དོ། ༼མེ་ཏོག་དམར་པོ་༽ཀ་ར་བི་རའི་ལྕུག་མ་ལ་ལན་གཅིག་བཟླས་པས་མངལ་གང་དུ་འདོད་པ་༼མི་ནས་ཕྱུགས་ལ་སོགས་པའི་མངལ་དུ་༽དེར་འཕོ་བར་འགྱུར་རོ། ༼ལྡོག་པའི་སྒོ་ནས་ཕན་ཡོན་བསྟན་༽ །དཔལ་ལྡན་ཁྲག་འཐུང་༼རྩ་བའི་༽གསང་སྔགས་ནི།༼ གིས་སི་ཏི་བསྒྲུབ་པ་ལ་གསུང་༽ །༼རྩ་བའི་སྔགས་ཀྱིས་སི་ཏི་མི་ཤེས་པར་གོ་ཆ་ལ་སོགས་པ་སྔགས་གཞན་གྱིས་སི་ཏི་བསྒྲུབ་པར་འདོད་ན་༽མི་ཤེས་༼པར་༽དངོས་གྲུབ་མངོན་འདོད་པ། །༼དེ་ནི་༽རྨོངས་པ་ཕུབ་མ་བརྡུང་༼པ་ལ་ནས་མི་འོང་། ཆུ་བཤིགས་པ་རང་ལས་མར་དང་འདྲ་༽མཚུངས་ཏེ། །གསང་སྔགས་འདི་ནི་མེདཔ་རུ། །དངོས་གྲུབ་༼༢་༽དང་ནི་བདེ་བ་དག །༼བསྒྲུབ་པ་༽མི་ཡིས་༼དངོས་གྲུབ་༽ཐོབ་པར་མི་འགྱུར་རོ། །༼རྩ་བའི་༽གསང་སྔགས་འདི་ནི་མི་ཤེས་པ། །རྣལ་འབྱོར་པ་ནི་རྣལ་འབྱོར་འདོད། །དེ་ཡི་༼མྱུར་དུ་མི་འགྲུབ་༽ངལ་བ་དོན་མེད་དེ། །འབྲས་བུ་༼༢་༽ཐོབ་པར་མི་འགྱུར་རོ། །༼རྗེས་སུ་འཕྲོ་བའི་སྒོ་ནས་ཕན་ཡོན་བསྟན་པ་༽གསང་སྔགས་འདི་ནི་འདོད་༼པ་༽སྤྱོད་པའི་༼དམིགས་པ་གསལ་བས་ན་གསལ་བས༽། །༼འབྲས་བུ་༽དངོས་གྲུབ་༼རབ་འབྲིང་༣་༽ཐམས་ཅད་སྦྱིན་བྱེད་ཡིན། །དེ་བཞིན་གཤེགས་པས་གསུངས་པ་ཡི། །ཕྱག་རྒྱ་༼དང་༽སྔགས་ནི་བསྒྲུབ་པ་པོས། །༼ལག་མཆོད་གསུང་༽བཟའ་བཏུང་༼གི་༽དངོས་གྲུབ་སྟོན་མོ་དང་། །བཅུད་ལ་སོགས་པའི་དངོས་གྲུབ་བསྒྲུབ་༼བསྒྲུབ་པ་བརྒྱད་༽ །ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་རྩ་བའི་ཆོ་གའི་ལེའུ་སྟེ་དགུ་པའོ། །༼དེ་ལྟར་རྩ་བའི་སྔགས་ཀྱི་ལས་བསྟན་ནས་སྙིང་པོའི་བསྒྲུབ་པ་སྟོན་༽དེ་ནས་༼འབྲས་བུ་༽ཧེ་རུ་ཀ་གཉིས་༼སུ་༽མེད་༼པའི༽། །༼སྐུ་གསུམ་གྱི་༽སྦྱོར་པ་གང་གིས་ཤེས་ཙམ་གྱིས། །འགྲུབ་པར་ཐེ་ཚོམ་མེད་པ་ཡི་༼བསྒྲུབ་པོ་ཕྱག་རྒྱ་སྔགས་ཤེས་པས་ཟེར་༽ ། ༼མཆོག་ཐུན་མོང་༢་ལ་དངོས་མཆོག་བསྒྲུབ་པ་༽ །སྐུ་གསུམ་པོ་ནི་བཤད་པར་བྱ། །༼ལེའུ་དང་པོ་རུ་རིམ་པ་རྣམ་པ་༤་སྐུ་༤་དང་སྦྱར་བ་གསུང་ཀྱང་ཕྱག་རྒྱ་བཞི་གསུང་པའི་དེའི་སྐུ་༤་པ་འདིར་བསྟན་སྐུ་༣་རོ་༡་པ་ངོ་བོ་ཉིད་ཀྱི་སྐུ་བསྟན་༽ཆོས་ཀྱི་སྐུ་ཡི་༼དོན་རྣམ་པ་༢་ལས་དང་པོ་བཀའ་ལས་འདས་པའི་འབྲས་བུ་བསྟན་ཏེ་༽ལུས་ཅན་གྱི༼ པྲ་པེག་་་དང་བཞི་བ་གཉིས་མཚོན༽། །གང་ཚེ་བསྒྲུབ་པ་པོ་འགྱུར་བ། །དེ་ཚེ་དེ་ཡིས་ཆོས་སྐུར་བཤད། །༼གསང་དབང་མཚོན་༽ལོངས་སྤྱོད་རྫོགས་སྐུའི་ལུས་ཅན་དུ། །གང་ཚེ་བསྒྲུབ་པ་པོ་འགྱུར་བ། །དེ་ཚེ་ལོངས་སྤྱོད་རྫོགས་པར་སྨྲ། །༼བུམ་དབང་མཚོན་༽སྤྲུལ་པའི་སྐུ་ཡི་ལུས་ཅན་དུ། །གང་ཚེ་བསྒྲུབ་པ་པོ་འགྱུར་བ། ༼དེ་ཡན་ཆད་དུ་རྩོལ་ལམ་ལ་སྐུ་གསུམ་སྦྱར་༽ །དེ་ཚེ་སྤྲུལ་པར་ངས་བཤད་དེ། ༼འདི་མན་ཆད་གཙོ་བོར་འབྲས་བུ་༽ །ཆོས་དང་ལོངས་སྤྱོད་རྫོགས་སྤྲུལ་པ། །ཡང་དག་ཐོབ་པར་གདོན་མི་ཟ། །བདག་ཉིད་ཤྲཱིི་ནི་ཧེ་རུ་ཀ །འགྲུབ་འགྱུར་འདི་ལ་ཐེ་ཚོམ་མེད། ༼དོན་༢་པ་ལོ་ཀའི་འབྲས་བུའི་ཡོན་ཏན། དེ་ལྟར་མཆོག་བསྒྲུབ་པར་བསྟན་ནས་ཐུན་མོང་གི་འབྲས་བུ་གསང་པ་ཡང་བསྒྲུབ་པར་སྟོན། ༢་པ་ཐུན་མོང་བསྒྲུབ་པ་༽ །གསང་སྔགས་འདི་ཡི་སྙིང་པོ་ནི་༼སྙིང་པོ་ཡི་གེ་ཉི་ཤུ་རྩ་༽། །བཤད་ཀྱིས་བསྒྲུབ་པ་པོ་རྣམས་ཉོན། ༼སྐྱེ་བ་བདུན་པའི་གོ་རོ་ཙ་ན་བླངས་ཏེ་དཔྲལ་བར་ཐིག་ལེ་བྱས་པའི་སྦྱོར་བས་༽ །སྙིང་པོ་བཟླས་པས་དཔག་ཚད་བྱེ་བ་འཕགས་པར་འགྱུར་ཞིང་། །འགྲོ་བ་དང་འོང་བར་འགྱུར་རོ། ༼ཐོད་པར་ཉུངས་དཀར་གྱི་སྦྱོར་བའམ་གཟུགས་སྣ་ཚོགས་ཀྱི་གྷི་ཝང་གི་སྦྱོར་བ་བཅས་པའི་ཐིག་ལེས་༽ །གཟུགས་བརྒྱ་སྟོང་དུ་མར་བྱེད་དོ། ༼བ་རུའི་ཤིང་ལ་སྙིང་པོའི་ཡི་གེ་ཉི་ཤུ་༢་པའི་ཙཀྲ་བྲིས་ཏེ་རབ་གནས་བྱས་ཏེ་གོན་ནས་༽ཁང་བཟངས་དང་ཤིང་དང་ཁྱིམ་ལ་འཛེགས་ཏེ་རྣལ་འབྱོར་མ་རྣམས་དང་དཔག་ཚད་བྱེ་བའི་བར་དུ་འགྲོ་བར་འགྱུར་རོ། ནམ་མཁའ་ལ་འགྲོ་ཞིང་འོང་ལ། གཞན་དུ་༼མི་འགྲུབ་པར་༽མི་འགྱུར་རོ། ༼ སྐྱེ་བ་བདུན་པའི་གོ་རོ་ཙ་ནའི་སྦྱོར་བས་ཐིག་ལེ་༽འདོད་ན་སྣང་བར་འགྱུར་ཞིང་། ༼ ཐིག་ལེ་བྱས་པས་༽འདོད་ན་མི་སྣང་བར་འགྱུར་རོ། ༼སེམས་ཅན་སྣ་ཚོགས་ཀྱི་གོ་རོ་ཙའི་སྦྱོར་བས་༽འདོད་ན་བྱིས་པ་དང་། རྒན་པོ་དང་། དར་ལ་བབ་པའི་གཟུགས་འཛིན་པར་འགྱུར་རོ། འདོད་ན་གླང་པོ་དང་། མ་ཧེ་དང་། བ་ལང་དང་། སྟག་དང་། སེང་གེ་དང་། ཁྱུ་མཆོག་དང་། བྱི་བ་དང་། རི་བོང་དང་། རྔ་མོའི་གཟུགས་འཛིན་པར་འགྱུར་བ་དང་། འདོད་་ན་རྨ་བྱ་དང་། ཁྱིམ་བྱ་དང་། ངང་པ་དང་། དུར་པ་དང་། ཆུ་སྐྱར་དང་། འུག་པ་དང་། ཁྲ་དང་། བྱ་རྒོད་དང་། ཁྲའི་གཟུགས་འཛིན་པར་འགྱུར་རོ། གང་དུ་འདོད་པ་དེའི་གཟུགས་སུ་བྱེད་དོ། ༼སྨྲ་མི་ཤེས་པ་༽ཚིག་འཕྲོག་པ་དང་། ༼མི་མཐོང་པར་༽མཐོང་བ་འཕྲོག་པ་དང་། ༼མི་ཐོས་པར་༽རྣ་བ་འཕྲོག་པ་དང་། །༼དྲི་མི་ཚོར་པར་༽་འཕྲོག་པ་དང་། ལྕེ་འཕྲོག་པ་༼རོ་མི་ཚོར་༽བྱེད་དོ། གང་གི་འདོད་པའི་ཁྲག་འདྲེན་པར་བྱེད་པ་དང་། གནོད་པར་བྱེད་དོ།་མིང་རུས་ལས་བྱ་པའི་ཕུར་བ་ལྕེ་ལ་བཙུགས་པས་སྨྲ་མི་ཤེས་དེས་འགྲོཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་སྐུ་གསུམ་འགྲུབ་པའི་སྙིང་པོའི་སྔགས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་བཅུ་པའོ་༼སྦྱོར་བའི་རྩ་བའི་སྔགས་དང་འདྲ་བ་ལས་སྔགས་ཉི་ཤུ་རྩ་གཉིས་པའོ༽། །༼སྐྱེ་བ་བདུན་པ་བརྟགས་པ་འདིར་མདོར་བསྟན་བཞི་བཅུ་རྩ་དགུ་པས་རྒྱས་པར་བཤད། བསྒྲུབ་པ་ལེའུ་བཅུ་བཞི་པར་གསུངས་༽ །དེ་ནས་གཞན་ཡང་༼སྙིང་པོའི་ལས་༽བསྒྲུབ་པ་པོས་༼བཤད་དེ་༽། །༼སྐྱེ་བ་བདུན་པ་༽གང་ཞིག་བརྟེན་པ་༼བསྒྲུབ་པ་༽ཙམ་གྱིས་ནི། །མྱུར་དུ་དངོས་གྲུབ་ལ་འཇུག་པའི། །དངོས་གྲུབ་ཐོབ་ཐབས་༼སྐྱེ་བ་བདུན་པའི་གོ་རོ་ཙ་ན་ལ་བརྟེན་པ་༽བཤད་པར་བྱ། ༼དང་པོ་སྐྱེ་བ་བདུན་པ་བརྟག་པ་བསྟན་༽སྐྱེས་བུ་གང་གི་༼སྐྱེ་བའི་བདུན་པའི་ལུས་ལ་༽རྡུལ་དྲི་ཞིམ་པར་༼གླ་རྩིའི་དྲིར་༽འགྱུར་བ་དང་། ༼ངག་འཇམ་པ་༽བདེན་པར་༼རྫུན་མི་༽སྨྲ་བ་དང་། ༼གཞན་གྱི་འབྱེད་འཛུམས་བདུན་གྱི་བར་དུ་འབྱེད་འཛུམས་རེ་རེ་ལས་མི་བྱེད་པ་༽ཡུན་རིང་པོར་མིག་མི་འཛུམ་པ་དང་། ཁྲོ་བ་མེད་པར་འགྱུར་བ་དང་། ཁ་ནས་དབུགས་དྲི་ཞིམ་པ་འབྱུང་བ་དེ་ནི་སྐྱེ་བ་བདུན་དུ་མིར་གྱུར་པ་ཡིན་ཏེ།དེ་༼ལ་༽བསྣམས་ན་༼སྙིང་ཀའི་ཐད་ཀ་ནས་བླ་རྩི་དང་ཙན་དན་ལ་སོགས་པའི་དྲི་ཞིམ་པོ་ཡོང་བ་༽དེའི་སྙིང་ཁ་ལ་བརྟེན་པའི་གོ་རོ་ཙ་ན་ཡོད་དེ༼བྷ་ཏན་ཀ་ན་ཀའི་རྫས་སུ་་ ནས་བསྒྲལ་བའི་ཐ་དགོས་གསུང་སྟེ་ཨ་བྷི་ད་ན་བྷ་དན་ཏ་ལྷར ༽། །དེ་བླངས་པ་ལ་༼སྐྱེ་བ་བདུན་པ་དེ་བསྒྲུབ་པ་བསྟན་༽དཔལ་ཧེ་རུ་ཀའི་༼སྙིང་པོའི་༽སྔགས་བརྒྱ་རྩ་བརྒྱད་བཟླས་༼ཕྱིས་བརྒྱ་དཔེ་ལས་བཟླས་ཟེར་༽ནས་ཐིག་ལེ་བྱས་ན་༼དེ་ལ་བསྙེན་བསྐུར་བྱས་པས་བོད་པར་ཡིན་པས་ལུས་བགྲེས་པ་འདོར་གསུང་༽སྟེང་དུ་༼ཚངས་པའི་གནས་སུ་༽ལྡིང་བར་འགྱུར་ཞིང་༼མཁའ་སྤྱོད་དུ་༽དཔག་ཚད་བྱེ་བར་འགྲོ་བར་འགྱུར་རོ། །དེ་ཟོས་པ་ཙམ་གྱིས་༼མངོན་ཤེས་༽དུས་གསུམ་གྱི་ཡེ་ཤེས་ཅན་དུ་འགྱུར་རོ། །དཔག་ཚད་ལྔ་བཅུར་སོང་ནས་ཉིན་མཚན་གཅིག་གིས་༼རྐང་མགྱོག་༽འོང་བར་འགྱུར་རོ། །ལྷའི་ལུས་ཀྱང་ཐོབ་པར་༼མངོན་ཤེས་ཅན་ལུས་ལ་འབྱུང་པའི་གནོད་པ་མེད་པ་ལུས་ཀྱི་བཅུད་ལེན་དུ་༽འགྱུར་རོ། དཔལ་ཧེ་རུ་ཀའི་སྙིང་པོ་༼སྐྱེ་བ་བདུན་པའི་རོ་ཙ་ན་༽གང་གིས་ཤེས་པ་དེ་གང་དང་གང་འདོད་པ་དེ་དང་དེ་༼སའི་བདག་པོ་༽ཐོབ་པར་འགྱུར་རོ། ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས། སྐྱེ་བ་༼མའི་སྐྱེ་བ་༽བདུན་པའི་མཚན་ཉིད་ཀྱི་༼ཕན་ཡོན་༽ཆོ་གའི་ལེའུ་སྟེ་བཅུ་གཅིག་པའོ། །༼སྙིང་པོའི་ལས་བསྟན་པ་དེ་ནས་༽ །དེ་ནས་ཉེ་བའི་སྙིང་པོ་ནི། །༼ཐུན་མོང་གི་༽དངོས་གྲུབ་ཐམས་ཅད་འགྲུབ་བྱེད་ཅིང་། །འཇིག་རྟེན་གསུམ་ན་གང་ཅུང་ཟད་༼ཡོད་པའི་ལས་ཀྱི་ཚིག་རྣམས་༽། །དེ་ཀུན་སྐད་ཅིག་གིས་འགྲུབ་༼དུས་མྱུར་བ་ལ་དགོངས་༽བཤད། །ཊཕ་ཧཱུཾ་ཧཱུཾ་ཧ་ཧ་ཧྲི་ཨོཾ། །འདི་ནི་སྙིང་པོའི་ཉེ་བའི་སྙིང་པོའོ།༼ཉེ་སྙིང་གི་༽སྔགས་འདི་ལན་འབུམ་བཟླས་པས་༼འདི་ན་མར་གྱི་ལས་ཚོགས་འདི་ཐམས་ཅད་བསྒྲུབ་པ་ལ་འཁོར་ལོ་དང་ལག་པ་༢་མི་འབྲལ་བས་བསྒྲུབ་དགོས་གསུང་། ཡི་གེ་བདུན་པའི་འཁོར་ལོ་བྲིས་ཏེ་རབ་གནས་བྱས་ནས་ལུས་ལ་བཏགས་པའམ་ལག་པ་ལ་བྲིས་ཏེ་ས་ལ་བརྡབས་ན་ས་བླ་ས་འོག་ས་སྟེངས་༣་༽འཇིག་རྟེན་གསུམ་ཡང་གཡོ་བར་བྱེད་དོ། ༼ཙན་དན་དམར་པོ་ལ་སོགས་པས་བྲིས་པའི་འཁོར་ལོར་བྲིས་ཏེ་རབ་གནས་བྱ་སྟེ་བཅངས་པ་པོ་༽ལྷ་དང་། ལྷ་མ་ཡིན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཀླུ་དང་། དྲི་ཟ་དང་། མིའམ་ཅི་དང་བཅས་པ་རྣམས་འགུགས་པར་བྱེད་དོ། ༼ཉེ་སྙིང་གི་སྔགས་བཟླས་པ་ཐམས་ཅད་ལ་འདྲ། ཙཀྲ་རྫ་ལ་བྲིས་ཏེ་རབ་གནས་བྱས་ནས་དུམ་བུར་བཅག་ཏེ་ཆུ་བོ་ལ་སོགས་པ་ལ་གཏོར་ན་༽རྒྱ་མཚོ་དང་ཆུ་བོ་དང་རྫིང་བུ་ལ་སོགས་པ་སྐེམས་ཤིང་རེངས་པར་བྱེད་དོ། ༼གནས་༽གང་དུ་༼བསྒྲུབ་པ་པོས་སྔགས་༽ཟློས་པའི་གནས་དེར་མཁའ་འགྲོ་མ་ཐམས་ཅད་བསྒྲུབ་པའི་མངག་གཞུག་བྱེད་པར་འགྱུར་རོ། ༼ལག་པ་གཡོན་པ་ལ་འཁོར་ལོར་ཙན་དན་དཀར་པོས་བྲིས་ཏེ་རབ་གནས་བྱས་ནས་བཀྲུས་ནས་བཀྲུས་པས་༽དེ་ཆུ་ལ་ཡོངས་སུ་བཟླས་ལ། ༼ཆུ་དེས་༽བདག་ཉིད་ཀྱི་མིག་བཀྲུས་ན་སྐྱེ་བ་བདུན་པ་༼གང་ཡིན་༽ཤེས་པར་འགྱུར་རོ། ༼ཡང་སྦྱོར་བ་དེས་༽ཚེ་ཟད་ཅིང་འཆི་བ་༼གཞན་༽ཉིད་དུ་སྣང་བ་དང་༼ཤེས་༽ ། ཚེ་རིང་བ་དང་སྲོག་དང་བཅས་པ་༼འཁོར་ལོར་བཀྲུས་པའི་ཆུ་དེས་མིག་ལ་བྱུག་ན་༽མཐོང་བར་འགྱུར་རོ། །མིག་ལ་མངོན་པར་༼སྔགས་ཉེ་སྙིང་ཡི་གེ་བདུན་པའི་འཁོར་ལོ་དང་ལྡན་པས་༽བསྔགས་ནས། གང་ལ་བལྟས་པ་དེ་༼ལུས་ངག་༽རེངས་བར་འགྱུར་རོ། ༼དཔའ་མོ་ཤི་བའི་ཞེས་རྒྱ་དཔེ་ལས་འབྱུང་༽མི་རོའི་རྐང་མཐིལ་གྱི་ལྤགས་པ་བླངས་ཏེ།༼ ཆོས་བསྲུངས་ལ་སོགས་པ་མངག་གཞུག་བྱེད་དུ་མ་འདོད་པ་དང་དེ་ལྟ་བུ་མངག་གཞུག་པར་བྱེད་ན། ཟངས་ལ་འཁོར་ལོ་དང་ཡི་གེ་གཟོང་རིས་བྱས་པ་ལ་སོགས་པ་སྟེ། སྦུབས་བྲུས་པའི་ཤུལ་ཙན་དན་དམར་པོ་དང་གཡོན་པའི་སྲིན་ལག་གི་ཁྲག་གིས་དགང་པ་ལ། དེའི་སྟེང་དུ་ཁྱིམ་གྱི་དུ་བས་དང་སྟེང་དུ་ཁ་བཀང་ལ་རབ་གནས་བྱ་སྟེ། དེ་ལ་ལག་པས་རེག་ལ་སྔགས་སྟོང་ལ་སོགས་པ་བཟླས་ནས་མངག་གཞུག་བྱེད་དོ༽ ༼དེ་རང་གི་གསུང་༽མིའི་ཁྲག་དང་བཏགས་ལ་རི་ལུའི་ནང་དུ་ལིག་བུ་མིག་བཅུ་ལ་ལྡོང་རོས་དང་། གྷི་ཧཾ་དང་གུར་གུམ་དང་། ༼སྔར་རང་གི་ལ་གསུང་༽ཁྲག་དང་བསྲེས་ཏེ༼རི་ལུ་བྱ༽། ༼འཁོར་ལོའི་ལྟེ་བ་ལ་ཧཱུཾ་གི་མཐའ་མ་རུ་ལྷ་གང་ཡིན་པ་དེ་དབང་དུ་གྱིས་ཅིག་པའི་སྤེལ་ཚིག་བྲིའོ༽ ༼རི་ལུ་དེ་༽གྲིབ་མ་ལ་བསྐམས་ལ་ལྕགས་གསུམ་གྱིས་༼གསེར་དངུལ་ཟངས་༽དཀྲིས་ཏེ་༼དེ་རོའི་སྙིང་ཁར་བཅུག་ནས་༽ ། ཡང་༼དེ་ལྡོང་པ་ལ་རི་ལུ་བསྐྱེད་ལ་ལྷའི་ཙཀྲ་བསྟིམ་པ་ལ་གསུང་༽ལྷག་པར་གནས་པར་བྱས་ལ། སྐར་མ་རྒྱལ་ལ་བབ་་པ་ན། ༼རོའི་ཁ་ནས་རི་ལུ་མྱུག་བྱུང་པ་དེ་རང་གི་ལྕེས་བླངས་དེ་༽དཔལ་ཧེ་རུ་ཀའི་ཞལ་དུ་བཅུག་ལ། ལག་པ་གཡོན་པས་༼རང་གི་༽ཁ་བཀབ་ལ། ཡང་༼ཉེ་སྙིང་༽སྟོང་རྩ་བརྒྱད་བཟླས་ན། དེ་དེའི་མོད་ལ་༼ལུས་༽མི་སྣང་བར་འགྱུར་ཞིང་། གྲིབ་མ་ཡང་མི་སྣང་བར་འགྱུར་ཏེ། ལྷ་རྣམས་ཀྱིས་ཀྱང་༼དེ་ལུས་༽མི་མཐོང་བར་འགྱུར་ན་༼ཐ་མལ་བའི་༽མི་རྣམས་ཀྱིས་ལྟ་སྨོས་ཀྱང་ཅི་དགོས། ༼རི་ལུ་དེ་ཡང་༽ཁ་ནས་བཏོན་ན་ནི་༼ལུས་༽སྣང་བར་འགྱུར་རོ། རྒྱུད་འདིར་མཁའ་སྤྱོད་གྲུབ་པའི་རི་ལུ་འདི་ནི་༼མ་འོངས་པའི་ཡིད་ཆེས་པ་བསྐྱེད་པའི་ཕྱིར་ཏེ་སྡུད་པ་པོའི་ཚིག་༣་༽དཔའ་བོ་རང་ཉིད་ཀྱིས་གསུངས་པ་ཡིན་ནོ་༼ཐེ་ཚོམ་མི་བྱ༽། །དཔལ་ཧེ་རུ་ཀའི་སྙིང་པོའི་ཉེ་བའི་སྙིང་པོའི་སྔགས་འདིས་འཛུབ་མོ་རྩེ་མོ་དང་། །༼དཔའ་བོ་ཤི་བའི་༽མགོ་བོའི་ཐོད་པ་ཤ་མེད་པར་བྱས་ལ་༼ དེ་ལ་ཙཀྲ་བྲིས་ཏེ་རབ་གནས་བྱ་སྟེ་འཛུབ་མོ་གཡོན་པའི་རྩེ་མོ་འཁོར་ཏེ་མཉེ་ཞིང་ཁྲག་འདྲེན་པར་བསམ་ཞིང་སྔགས་བཟླས་ན༽། །མཉེས་ན་དེའི་ཁྲག་འདྲེན་པར་བྱེད་དོ་༼སྦྱོར་བ་རྩ་བའི་སྔགས་ཀྱི་སྐབས་དང་འདྲ༽། །༼གཡོན་༽གཡོན་པ༼འི་འཛུབ་མོ༽ས་༼འཁོར་ལོ་དེ་༽ཡང་དང་ཡང་དུ་མཉེས་པས་ནི་༼ཁྲག་སླར་ལུས་ལ་༽འཇུག་པར་འགྱུར་རོ། ༼ཡི་གེ་བདུན་པ་ལ་སྔོན་དུ་བསྙེན་པ་བསྐྱལ་ཏེ་༽མངོན་པར་༼ཉེ་སྙིང་༽བཟླས་ཏེ་༼དཔའ་བོ་ཤི་བའི་༽མགོ་བོའི་ཐོད་པ་ལ་༼བསྒྲུབ་པ་པོའི་ཙཀྲ་བྲིས་ཏེ་རབ་གནས་བྱས་ཏེ་དེ་ལ་༽ཁུ་ཚུར་བསྣུན་ན་གང་གི་མིང་༼ཨ་ཀར་ཤ་ཡ་ཛ་ཅེས་པའི་སྤེལ་ཚིག་དང་བཅས་པ་༽ནས་སྨྲོས་པ་དེའི་ཀླད་པ་ན་བར་འགྱུར་རོ། གསང་སྔགས་༼གསོ་བའི་བསམ་པ་ཡིད་ལ་༽དྲན་༼པ་ཙམ་གྱིས་༽ལ་༼དཔའ་བོ་ཡི་༽ཐོད་པ་༼དེ་༽འོ་མས་བཀང་ན་དེ་ཉེ་བར་ཞི་བར་འགྱུར་རོ། ༼དུད་འགྲོ་ལ་སོགས་པ་གང་ཡང་རུང་པའི་༽གྷི་ཧཾ་ལ་བཟླས་ཏེ་ཐིག་ལེ་བྱས་ནས་གང་ལ་བལྟས་པ་༼རེངས་པ་ལ་སོགས་པ་ལ་༽དེ་རྒྱས་བཏབ་པར་འགྱུར་རོ། ༼འཁོར་ལོ་དང་ལྡན་པས་༽འཛུབ་མོ་ལ་༼ཡི་གེ་བདུན་པ་༽ཡོངས་སུ་བཟླས་ཏེ། ༼དངོས་སུ་༽གང་ལ་སྡིགས་འཛུབ་བྱས་པ་དེ་དེའི་མོད་ལ་ལྟུང་༼འགྱེལ་༽བར་འགྱུར་རོ། །༼འཁོར་ལོ་དང་ལྡན་པའི་ལག་པས་༽སྔགས་བཟླས་པས་ས་ལ་༼ཟེར་ཡང་གཟུགས་བརྙན་ལ་བསྣུན་པས་གསུང་༽བསྣུན་ན་གང་གི་མིང་ནས་སྨོས་པ་དེ་དེའི་མོད་ལ་འཆི་བར་འགྱུར་རོ། །༼གསོ་བ་༽ཆུ་ལ་བཟླས་ཏེ་ས་ལ་༼གཟུགས་བརྙན་ལ་གསུང་༽བཏབ་ན་སླར་འཚོ་བར་འགྱུར་རོ། །༼འཁོར་ལོ་དང་ལྡན་པའི་ལག་པས་༽སྔགས་བཟླས་ལ་༼གཡོན་པའི་༽འཛུབ་མོའི་རྩེ་མོ་དེས་སྟོང་ལ་སྡིགས་འཛུབ་བྱས་ན། །ཡང་དེ་ཐམས་ཅད་གནོན་༼ཏེ་རེངས་གསུང་༽པར་འགྱུར་རོ། །ཚིག་གིས་༼སོས་པའི་སྨོན་ལམ་བཏབ་པས་༽ནི་གྲོལ་བར་འགྱུར་རོ། །༼ཤན་པ་༽རྨེ་ཤ་ཅན་གྱི་༼འདི་ཡང་ཙཀྲ་དང་ལྡན་པས་༽ཐལ་བ་ལ་བཟླས་བརྗོད་བརྒྱ་བྱ་སྟེ། །༼བྲམ་ཟེ་ལ་སོགས་པ་༽སེམས་ཅན་གང་རྗེས་སུ་དྲན་ཏེ་༼དེ་ལ་༽། །བསྣུན་པ་༼ན་༽དེ་དེའི་གཟུགས་འཛིན་པར་འགྱུར་རོ། །༼དྲག་པོའི་༽སྦྱིན་བསྲེག་གི་༼ད་རུ་ར་ལ་སོགས་པ་བསྲེགས་པའི་༽མེའི་ཐལ་པ་ལ་བཟླས་བརྗོད་བརྒྱ་བྱས་ཏེ་༼གཟུགས་བརྙན་ལ་ལོ་ཀ་བའི་༽བསྣུན་ན་དེ་ལྷ་དེ་ཉིད་ཀྱིས་ཀྱང་༼རང་གིས་རང་༽མི་མཐོང་རོ། །ཆུ་ལ་༼ལན་༽བདུན་བཟླས་པས་༼ལུས་ལ་༽གཏོང་ན་སླར་༼རང་གིས་མཐོང་པའམ་ལུས་༽སྣང་བར་འགྱུར་རོ། ༼སྐྱེས་པའི་ཐོད་པ་ལ་ཙཀྲ་བྲིས་ལ་རབ་གནས་བྱས་ལ་ལག་པ་ལ་ཙཀྲ་བྲིས་པས་བཟུང་མ་བསྒྲུབ་པའམ་ཡང་ན་ལག་པ་ལ་ཙཀྲ་བྲིས་ལ་རབ་གནས་བྱས་ལ་ལག་པར་སྦྱར་ལ་ཐོད་པའི་ཕྱག་རྒྱ་བྱས་ལ་ལས་བསྒྲུབ། བསྒྲུབ་ལུགས་གསུམ་མོ་་་ ཁྱིའི་ཐོད་པ་ལ་འཁོར་ལོ་བྲི་ལག་པ་༢་ལ་ཡང་འཁོར་ལོ་བྲིས་ལ་རབ་གནས་བྱས་ཏེ། དེ་ནས་ལག་པ་༢་ཁ་སྦྱར་བའི་འཁོར་ལོའི་བར་དུ་ཀྱི་ཐོད་ཙཀྲ་བྲིས་པ་དེ་བཅུག་ལ་ལག་པ་སྟེང་འོག་བསྒྱུར་ཅིང་ཉེ་སྙིང་བཟླས་གསུང་༽ །ཐོད་པའི་ཕྱག་རྒྱ་ཁ་སྦྱར་བཅིངས་ལ་༼ལག་པ་༢་བསྡམས་པའི་དབུས་སུ་ཐོད་པ་བཅུག་སྟེ་སྟེང་འོག་ཡང་ཡང་བསྒྱུར་བ་ཡང་གསུང་། ཐལ་མོ་ཁོང་སྟོང་དུ་སྦྱར་ཏེ་སྟེང་འོག་ཡང་ཡང་བསྒྱུར་གསུང་༽དབུགས་༼ཕྱིར་མི་རྒྱུ་བར་བྱ་༽མི་འབྱིན་པར་གང་གི་མིང་ནས་སྨོས་ཏེ་བཟླས་པ་དེ་སྨྱོ་བར་འགྱུར་རོ། །སྐྱེ་བོ་སྟོང་ཡང་མྱོས་པར་འགྱུར་རོ། །ཡིད་ཀྱིས་༼གསོ་བ་༽ནི་གྲོལ་བར་༼གྱུར་༡་ཅེས་བྱ་བ་ཙམ་གྱིས་༽འགྱུར་རོ། །༼འདི་ཡང་འཁོར་ལོ་དང་ལྡན་པའི་ལག་པས་༽གང་གི་མིང་ནས་སྨོས་ཏེ་གཙུག་ཕུད་ལ་༼སྔགས་༽ལན་བདུན་བཟླས་ཏེ་མདུད་༼པ་བྱས་ན་༽ན་མཁའ་འགྲོ་མ་ཐམས་ཅད་འོང་བར་འགྱུར་རོ། ༼ཙཀྲ་དང་ལྡན་པས་༽ཁང་སྟོང་༼རྒྱལ་པོའི་སྐོར་ཁང་ལ་སོགས་པར་གསུང་༽དུ་སོང་སྟེ་ལན་བརྒྱ་བཟླས་ནས་༼ལག་པ་༢་ཀས་སྐྲ་༽སྤྱི་བོར་བཅིངས་ལ་མིག་བགྲད་དེ་ཇི་སྲིད་དུ་བཟླས་པ་དེ་སྲིད་དུ་མི་སྣང་བར་འགྱུར་རོ། །༼གསོ་བ་ཙུག་ཕུད་༽བཀྲོལ་ན་སྣང་བར་འགྱུར་རོ། །༼དཔའ་བོའི་༽ཐོད་པའི་ནང་དུ་༼འཁོར་ལོ་བྲིས་ཏེ་རབ་ཏུ་གནས་པ་བྱས་ནས་བཅག་ནས་༽གསེག་མ་༼གྱོ་དུམ་༽བླུགས་ལ་མངོན་པར་བཟླས་ཏེ། །སྟེང་དང་འོག་དང་ཕྱོགས་འཚམས་རྣམས་སུ་གཏོར་ན་༼ཆིངས་༡་ཅེས་བྱ་བ་ལ་སོགས་པས་སྤེལ་ཏེ་ཕྱོགས་ཕྱོགས་སུ་གཏོར་ཏེ་༽ ། ལྷ་དང་ལྷ་མ་ཡིན་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཀླུ་དང་། དྲི་ཟ་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཐམས་ཅད་ཀྱང་བཅིངས་པར་འགྱུར་རོ་༼དེ་གནོད་པ་མི་ནུས་སོ༽། །༼སྦྱོར་བ་དེས་༽མཁའ་འགྲོ་མའི་སྤྱོར་བ་༼སྟེ་གནོད་པ་དུ་མ་༽འཕྲོག་པར་འགྱུར་རོ། །སྟན་དང་མལ་ཁྲི་ལས་སྐྱེས་པའམ་བུད་མེད་༼ཉལ་བ་༽འདུག་པ་ལ་༼ཙཀྲ་དང་ལྡན་པ་དེས་༽བལྟས་ཏེ། །སྔགས་ལན་བརྒྱ་བཟླས་ན་༼ལྕེ་སྤྱང་གི་མཇུག་མ་ལ་བཟླས་ཏེ་མལ་འོག་ཏུ་སྦས་ན་༽མི་འབྱེ་བར་འགྱུར་རོ། །ཡིད་ཀྱིས་ནི་༼གྲོལ་བར་སྨོན་ལམ་བཏབ་ན་༽གྲོལ་བར་འགྱུར་རོ།༼ལེའུ་བཅུ་པས་སྙིང་པོའི་ལས་བསྒྲུབ་པ་དང་༡༡་པས་སྐྱེ་བ་བདུན་པ་བརྟག་པ་དང་སྙིང་པོའི་ལས་བསྒྲུབ་པ་བསྟན་ལ་ལེའུ་བཅུ་༢་པས་ཉེ་སྙིང་གི་ལས་བསྒྲུབ་པ་བསྟན་པ་༽ །གསེག་མ་ལ་ཡོངས་སུ་བཟླས་ཏེ་༼གྱོ་མོ་ལ་ཙཀྲ་བྲིས་ཏེ་རབ་གནས་བྱས་ཏེ་བཅག་ནས་༽། །ཆུ་བོར་བཅུག་ན་རྒྱུན་ཕྱོགས་ལས་བཟློག་སྟེ་འབབ་པར་འགྱུར་རོ། །གསེག་མ་དེ་ཉིད་ཀྱིས་རྦ་རླབས་༼ཆེན་པོ་ལ་གཏོར་ན་༽གནོན་པར་འགྱུར་རོ། །ཡིད་ཀྱི་སྟེང་དུ་བལྟས་ཏེ། །༼སྔགས་༽སྟོང་བཟླས་ན་༼གསེག་མ་དེ་སྟེང་དུ་གཏོར་ན་༽ཆར་ཆེན་པོ་གཅོད་པར་འགྱུར་རོ།༼ མཁའ་འགྲོ་ལྟར་དགྲ་བོ་མཚོན་ཆ་ལྔ་བཟློག་པའི་སྨན་ལྔའི་ཆུས་ཙཀྲ་བྲིས་ཏེ་རབ་གན་ལ་སོགས་པ་བྱས་ཏེ་དེ་བཅང་དེ་༽ །གཞན་གྱི་དཔུང་མངོན་པར་༼མདའ་སོགས་༽།འཕྲུལ་འཁོར་གྱི་༼རལ་གྲི་སོགས་༽འཕན་མི་འཕན་དང་། །དེ་༤ན་༼འཁོར་ལོ་སོགས་༽ལག་པས་འཕེན་པ་དང་། འཕངས་་ནས་བཟུང་བ་ཉིད་དག་ནི། །ལག་པས་མཚོན་ཆ་༼སྤར་འཛིན་དང་ཅོད་ཀ་༽འགྱེད་དང་ལྔ། །འཇིག་རྟེན་༣་པོ་མ་ལུས་ན། །འདི་ལྔ་མཚོན་ཆར་རབ་ཏུ་གྲགས། སྨན་ལྔ་ལ་ཀྲོ་ཏ་ཀ་བྱ་བ་ཁ་ཏོག་དམར་པོ་༼དོ་བ་འདྲ་༡་ཡོད་གསུང་༽རྡོག་པོ་ཆེ་བ་༼དེས་འགྲེ་བ་༽༡་ཡོད། ཧོ་མི་ནི་བྱ་བ་ཏ་རུ་ར་རྡར་ལ་ཤ་ན་བྱ་བའི་ཤིང་ཏོག་གཅད་ན་འཁོར་ལོ་ལྟ་བུ་འོང་བ་༡་ཡོད། འཛབ་མནན་ཏ་པ་ ་ས མ་ཡ་བྱ་བ་ལུག་མིག་པ་ཨ་པ་ར་ཛི་ཏ་དཀར་པོའི་མེ་ཏོག དེ་ལྔའི་ཁུ་བས་ལག་པ་གཡོན་པའི་ལག་མཐིལ་དུ་འཁོར་ལོ་བྲིས་ཏེ་ཁུ་ཚུར་བཅངས་ནས་གཡུལ་དུ་ཞུགས་ན་མཚོན་གྱིས་མི་ཚུགས་སོ་་་་ལྔ་ལ་སོགས་པས་་༼མིག་གི་རྟགས་ཅན་འདི། བར་འདི་ནས་ཡིན་མིན་དཔྱོད༽ཕྱོགས་པ་ནི། །བཟླས་བརྗོད་སྟོང་བཟླས་ཏེ་གཡུལ་དུ་ཞུགས་ན། །མཚོན་ཆ་བརྒྱ་བསྣུན་ཀྱང་གནོད་པའི་ཚོར་བ་འབྱུང་བར་མི་འགྱུར་ཞིང་། །མཚོན་གྱིས་ཀྱང་༼ལུས་༽ཆོད་པར་མི་འགྱུར་རོ། །རྡོ་རྗེའི་ལུས་ཅན་དུ་འགྱུར་རོ། །དཔལ་ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས། ཉེ་བའི་སྙིང་པོའི་ལས་ཀྱི་ཆོ་ག་སྟེ་བཅུ་གཉིས་པའོ། །དེ་ནས་གོ་ཆའི་༼དཔའ་བོ་དང་དཔའ་མོའི་གོ་ཆ་༢་དུས་༡་ཏུ་བསྟན་༽ལས་རྣམས་ཀྱིས། །འཇིག་རྟེན་༼ལས་༽གསུམ་ན་༼ལས་༽གང་ཡོད་པ༼འི་སི་ཏི་༽། །ཡིད་ལ་འདོད་པ་ཀུན་༼བསྒྲུབ་པར་༽བྱེད་པ། །གོ་རིམ་བཞིན་དུ་༼དཔའ་བོ་དང་དཔའ་མོའི་གོ་ཆ་ལ་བརྟེན་པའི་ལས་མཆོག་གི་སི་ཏི་ལག་པ་༢་ལ་གོ་ཆའི་ཙཀྲ་བྲིས་ཏེ་རབ་ཏུ་གནས་པ་༽བཤད་པར་བྱ། །དེ་ལ་༼དེ་ལ་འཁོར་ལོ་གྲོ་ག་ལ་སོགས་པ་ལ་ཇི་ལྟ་བ་༤ན་བྲིས་ཏེ་རབ་གནས་བྱས་ཏེ་དཔུང་པ་ལ་བཏགས་ནས་༽གོ་ཆ་བཟློས་བཞིན་དུ་ལམ་དུ་ཞུགས་ན་༼ཡང་ན་གོས་ཀྱི་ཐུ་བ་ལ་རླངས་པ་ཕྱིར་མི་འཆོར་བར་བྱས་ཏེ་གོ་ཆའི་སྔགས་བརྗོད་ཅིང་འཁོར་ལོ་བསམས་ནས་མདུད་པ་བྱས་ཏེ་ལམ་དུ་ཞུགས་ན༽། །རྐུན་མ་འམ་སྟག་གིས་འཇིགས་པར་མི་འགྱུར་བའམ། །མི་སྣང་བར་འགྱུར་རོ། །༼འཁོར་ལོ་དང་ལྡན་པས་༽གོ་ཆ་ཟློས་བཞིན་དུ་ཡང་རྒྱལ་པོའི་ཕོ་བྲང་དུ་༼སྐོར་མཛོད་དང་བཙུན་མོའི་ནང་དུ་༽སླས་ཀྱི་ནང་དུ་ཞུགས་ན་ཡང་མི་སྣང་བར་འགྱུར་ལ། །གང་འདོད་པ་དེ་བླངས་ཏེ་འགྲོ་བར་འགྱུར་རོ། །ལྷ་རྣམས་ཀྱིས་ཀྱང་མི་མཐོང་ངོ། །གོ་ཆའི་སྔགས་བརྒྱ་བཟླས་པའི་ལག་པས་གང་ལ་རེག་པ་དེ་མདུང་བཞིན་དུ་རེངས་པར་འགྱུར་ཏེ། །༼རེངས་པ་དེ་༽སུམ་བཅུ་རྩ་གསུམ་པས་ཀྱང་མི་གཡོའོ། །༼གོང་གི་ལག་པའི་འཁོར་ལོ་དེ་བྲིས་པའི་ཆུ་གཏོར་ཞིང་༽སྔགས་བཟླས་ཏེ་༼བདགགི་༽རྐང་པས་བསྣུན་ན་༼རེངས་བ་དེ་༽ཐར་པར་འགྱུར་རོ། །༼མིའི་ཐོད་པར་རང་གི་མཛུབ་མོའི་ཁྲག་གིས་མནངས་ཏེ་༽རང་གི་ཁྲག་གིས་ཐིག་ལེ་བྱ་སྟེ་༼གོ་ཆའི་སྔགས་༽ལན་གསུམ་བཟླས་ན།༼ཐོད་པ་ལ་ཙཀྲ་བྲིས་ཏེ་རབ་གནས་བྱས་ཏེ་མཛུབ་མོ་ལས་ཁྲག་གཏོན་ལ་ཐོད་པའི་ཙཀྲ་ལ་བསྐུས་ལ་འཛུབ་མོས་ཙཀྲ་དེ་མཉེས་ནས་དཔྲལ་བར་ཐིག་ལེ་བྱས་ན་བལྟས་ན་རྫས་ལ་སོགས་པ་༽ །གང་གིས་མཐོང་ཞིང་གང་མཐོང་བ་ཐམས་ཅད་ཀྱི་ཁྲག་འདྲེན་པར་བྱེད་དོ། །གང་གི་ཁྱིམ་དུ་ཁྲོ་བ་དང་བཅས་པས་ལན་སྟོང་བཟླས་ན་ཐམས་ཅད་རིམས་ཀྱིས་བཏབ་པར་འགྱུར་རོ། །༼འཁོར་ལོ་བཀྲུས་པའི་ཆུས་༽ཆུ་ལ་ལན་ལྔ་བཟླས་ཏེ་གཏོར་ན་སླར་འཚོ་བར་འགྱུར་རོ།༼གང་གི་སྣ་གཡས་ནས་ཐུགས་ཀའི་ཧཱུཾ་ལས་གོ་ཆའི་སྔགས་སྤྲོས་ཏེ་བསྒྲུབ་བྱའི་ལྕེ་ལ་ཐིམ་པར་བསམ་ཞིང་སྔགས་བཟླས་ན་ ༤་བ་ཙན་དན་ག་བུར་གྱིས་རྒྱས་པ་དང་བསྲུང་བ་ལ་གྷི་ཧཾ་དང་ཁྲག་གིས་སོ། དབང་དང་དགུག་པ་ལ་ཁྲག་དང་རྒྱ་སྐྱགས་ཀྱིས་སོ། མངོན་སྤྱོད་ལ་དུག་དང་ལན་ཚྭ་དང་སྐྱེ་ཚེས་སོ། དེ་བཞིན་དུ་ཞི་དྲག་གི་ཡིག་མགོ་ནང་དུ་བསྟན༽ །གང་གི་གདོང་ལ་བལྟས་ཏེ་བཟླས་ན་དེའི་ཚིག་འཕྲོག་པར་འགྱུར་རོ།༼སོ་ པོ་ན་ཀའི་ཤིང་རྟོག་སྐྱུར་པོ་དང་པར་མའི་རོ་དང་བསྲེས་ཏེ་ལུས་ལ་བྱུགས་ན༽ །ཆུ་བོ་དང་རྫིང་བུར་གནས་ཏེ། །སྟོང་བཟླས་ན་ཆུའི་སྟེང་དུ་འགྲོ་སྟེ་། ༼ ་་་་་་་་་་་ཞི་དྲག་གཉིས་སུ་ཕྱེ་ནས་ཞི་བའི་ཁོངས་སུ་རྒྱས་པ་དང་དབང་བསྡུད། མངོན་སྤྱོད་ཀྱི་ཁོངས་སུ་བརྒྱལ་བ་དང་རེངས་པ་དང་དབྱེ་བ་དང་བསྐྲད་པ་ལ་སོགས་པ་བསྡུད་གསུང་།ཞི་བའི་ཡིག་མགོ་ནང་དུ་བསྟན་དྲག་པོའི་ལས་རྣམས་ལ་ཕྱིར་བསྟན་གསུང་༽ །ཐང་ལ་ཇི་ལྟ་བ་བཞིན་དུ་ཆུ་ལའང་དེ་བཞིན་དུ་འགྲོའོ། །༼པདྨའི་སྐྱལ་བུར་ཉ་ལྕིབས་ལ་སོགས་པ་བརྫངས་ཏེ་རང་གི་དེ་ཁའི་གཏིང་དུ་བཅུག་སྟེ་ཡང་ན་རང་གི་ལུས་ལ་བཅངས་པ་རང་གིས་ཆུའི་གཏིང་དུ་བསྡད་ཀྱང་མི་འཆི་གསུང་། རང་གི་ཁའི་ཁར་བཏོན་ན་མི་འབྱིང་པའོ་༽ཆུ་ལ་ཞུགས་ན་ཆུ་བོ་ཡང་རྒྱ་མཚོ་བཞིན་དུ་གནས་སོ། །༼ཁྲག་དང་རྒྱ་རྐྱགས་རྗེས་པས་༽ལག་པ་གཉིས་ཉེད་བཞིན་དུ་ལན་སྟོང་བཟླས་ན་༼ ཡང་རྒྱལ་ལ་རས་སུ་འཐག་པའི་དུས་ངན་ཡང་རྒྱལ་ལ་བྱ་སྟེ་རྒྱལ་༣་གྱི་སྦྱོར་བས་སོ་༽རྣལ་འབྱོར་མ་ཐམས་ཅད་དབང་དུ་འགྱུར་རོ། །རྣལ་འབྱོར་སྣ་ཚོགས་པའི་གཟུགས་ཅན་མཁའ་འགྲོ་མ་དང་། ལཱ་མ་དང་། ༼ཚིགས་པ་མཐོ་དམན་དུ་ཡོད་པའི་ཤ་དཀར་པོར་འོང་། དམའ་མོའི་ཤ་ནག་པོར་འོང་སྟེ་༽ཁཎྜ་རོ་ཧར་གྲགས་པ་ཐམས་ཅད་དེའི་དབང་དུ་འགྲོ་བར་འགྱུར་རོ། ༼དེ་ཡང་སྦྲུལ་གྱི་རྒྱལ་པོ་བྱ་བ་དཀར་ནག་ཁྲེའུར་ཡོད་པ་དེ་སོ་སོར་ཕྱེ་སྟེ་དཀར་པོའི་ཞག་རས་སྐུད་འཐག་པ་ཆ་༡་ལ་བསྐུ་ནག་པོའི་ཞག་རས་སྐུད་འཐག་པ་ཆ་༡་ལ་བསྐུས་ཏེ་སྦྲུལ་གྱི་གཟུགས་བརྙན་དེ་ནས་བརྟགས་ཏེ་སོ་སོར་ཤེས་པར་བྱས་ལ་དཀར་པོའི་ཕྱོགས་ལ་དཀར་པ་བྱུགས་ལ་གྱོན།ནག་པོའི་ཕྱོགས་ལ་ནག་པོ་གྱོན་ནའོ།ཡར་ངོ་ལ་དཀར་པོ་གྱོན།མར་ངོ་ལ་ནག་པོ་གྱོན།དང་པོ་རས་བལ་འདེབས་པ་ན་ཡང་རྒྱལ་ལ་བཏུས་ཏེ་རླམ་པ་ལ་སོགས་པ་ན་༽ །སྐར་མ་རྒྱལ་ལ་རས་བྱས་ལ་དེ་གྱོན་པའི་ལུས་ཀྱིས་སྟོང་ཕྲག་བཅུ་བཟླས་ན། །དེའི་འོག་ཏུ་འགྲུབ་པར་འགྱུར་རོ། །དེ་གྱོན་པའི་ལུས་དཔག་ཚད་སྟོང་གི་བར་དུ་ནམ་མཁར་༼འགྲོ་ཞིང་༽མི་སྣང་བར་འགྱུར་རོ། །༼ཡུལ་ཕྱོགས་༽གང་དུ་འདོད་པ་དེར་༼རྐང་འགྱོགས་ཀྱིས་༽འགྲོ་བར་འགྱུར་རོ། །དེས་རྒྱ་མཚོའི་མཐར་ཐུག་པའི་ས་རྣམས་སུ་འགྲོ་བར་འགྱུར་རོ། །༼མཁའ་སྤྱོད་དུ་ལོ་ཀ་དང་དུ་ཁའི་གནས་༽སྟེང་གི་རྒྱུན་དུ་འགྲོ་བར་འགྱུར་རོ། །༼དེ་ལྟར་དངོས་གྲུབ་འགྲུབ་པ་དེ་ཡང་དཔེར་ན་༽དབང་པོ་༼དྲུག་༽དང་གང་ལམ་༼དུ་ཡུལ་གསལ་བར་༽འགྱུར། །དེ་དང་དེ་ཡི་ངོ་བོར་བྱ། །༼དེ་༤ན་དུ་༽མཆོག་ཏུ་༼བསྐྱེད་རྫོགས་༢་ལ་༽མཉམ་བཞག་སྦྱོར་བ་ཡིས། །༼དངོས་པོ་༽ཐམས་ཅད་༼དེ་ཁོ་ན་ཉིད་ཀྱི་ངོ་་བོར་རྟོགས་པར་འགྱུར་གསུང་༽སངས་རྒྱས་རང་བཞིན་༼མཆོག་དུ་༽འགྱུར། །ཤིང་ཡོངས་འདུའི་ཁུ་བཅུད་བླངས་ལ་༼མེ་ཏོག་སྔོན་པོ་ཡོད་པ་དེ་ཡང་ཆོས་གང་ཡང་འཛིན་པའི་རྩི་ཡིན།གོ་ཆའི་སྔགས་༢་ཅར་ལས་སྦྱོར་དུས་སུ་༽བཟླས་བརྗོད་སྟོང་བྱ་སྟེ་གང་ལ་ཐིག་ལེ་བྱས་པ་དེ་༼རེངས་པར་༽ཤིང་དུ་འགྱུར་རོ། །༼ཐིག་ལེ་དེ་ཉིད་བཀྲུས་པའི་ཆུས་༽ཆུ་ལ་༼གོ་ཆའི་སྔགས་༢་པོ་དེ་༽ལན་བདུན་བཟླས་ཏེ་གཏོར་ན་སླར་འཚོ་བར་འགྱུར་རོ། །འདི་དག་གླང་པོ་ཆེའི་རྐང་རྗེས་ཀྱི་༼ས་འམ་དམིགས་པའི་དུམ་བུ་༽བསྒྲུབ་བྱའི་༼རྐང་རྗེས་ཀྱི་༽རྡུལ་བླངས་ཏེ། །ལན་སྟོང་བཟླས་ན་གང་ལ་བསྣུན་པ་དེ་གླང་པོ་ཆེར་འགྱུར་རོ་༼རྟ་ལ་སོགས་པ་ཡང་དེས་འགྲེའོ་༽། །དཔལ་ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་གོ་ཆའི་སྔགས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་བཅུ་གསུམ་པའོ། །དེ་ནས་བོང་བུའི་རྣལ་འབྱོར་བདག་༼ཉིད་བྱས་པས་རྟེན་འབྲེལ་གྱི་ཆེ་བ་ཡིན་གསུང་༽ །༼མྱུར་དུ་༽ཡིད་ཀྱིས་ཤུགས་ནི་༼མི་འགྲུབ་པ་བཟློག་ཏེ་མྱུར་དུ་འགྲུབ་པ་༽བཟློག་པའི་ཕྱིར། །གང་གིས་བསྒྲུབ་པ་པོ་༼མྱུར་དུ་༽འགྲུབ་པའི། །༼དེ་ལྟ་བུའི་༽བསྒྲུབ་པ་དེ་ནི་བཤད་པར་བྱ་༼སྔོན་དུ་བསྙེན་པ་སོང་བས་དལ་བྲི་བ་ན་སྙིང་པོའི་གཞི་འདི་ལྟར་བྱས་ཏེ་བྲི་ཐུགས་ཀྱི་རྣམས་ནམ་མཁའ་ལྡིང་གི་གདོང་ཅན་དུ། གསུང་གི་རྣམས་རྨ་བྱའི་གདོང་དུ། སྐུའི་རྣམས་སེང་གེའི་གདོང་ཅན་དུ། སྒོ་མ་༤་འདྲ འཚམས་༤་ཧེ་ཀྲི་སྣ་པ་རི་སྟག་དང་དོམ་མགོ་ཅན་དུ་བྲི་༽། །རྣལ་འབྱོར་མ་ནི་ལཱ་མའི་གཟུགས། །དེ་བཞིན་དུ་ནི་མཁའ་འགྲོ་མ། །ཁཎྜ་རོ་ཧའི་འདོད་གཟུགས་ཅན། །བོང་བུའི་༼གདོང་པ་༽རྣམ་པ་ཁྲག་གི་གདོང་།༼དེ་ནས་ལྷོ་ཕྱོགས་སུ་འབྲས་ཕུབ་མས་མིའི་སྐྱེ་བ་བདུན་པ་ལ་སོགས་པ་གང་འདོད་ཀྱི་གཟུགས་བོང་ཁོང་སྟོང་དུ་འཇུག་དུ་འདོད་པ་བྱས་མདོག་ཅན་བྱས་ལ་སྙིང་ཁར་འཁོར་ལོ་བཅུག་སྟེ་མདུན་དུ་མེ་ལོང་བཞག་ཏེ་བལྟས་ན་གང་འདོད་པའི་སྐྱེ་བ་བདུན་ན་གང་ན་ཡོད་པ་དེའི་གཟུགས་མཐོང་བའམ་ཚེ་དེ་ལུས་འདོར་བ་དང་མ་ཟད་པ་སོགས་ཟད་པ་ལ་སོགས་པ་དེའི་གཟུགས་ནག་པོར།མ་ཟད་པ་དཀར་པོ་མཐོང་བ་ལ་སོགས་པ་འབྱུང་ངོ་༽ །མཁའ་འགྲོ་རྩེ་གསུམ་ལག་ན་ཐོགས། །༼རང་གཞན་༢་ཀ་༽ཚེ་ཟད་པ་དང་ཚེ་རིང་བ། །སྣང་བ་ཡིད་དུ་གྲུབ་པ་ཡིན། །འདི་ནི་བོང་འདྲའི་རྣལ་འབྱོར་པས། །དེ་ཚེ་བོང་བུར་༼འི་ནང་ནས་༽བལྟ་བར་བྱ། །གླང་པོ༼འི་སྐྱེ་བ་བདུན་པ་༽་ཉིད་དུ་སྔོན་དུ་གང་། །མཐོང་སྟེ་གླང་པོའི་གཟུགས་ཅན་ཡིན། །༼མིའི་སྐྱེ་བ་བདུན་པའམ་གླང་པོ་ཆེ་སོགས་བདུན་༽གང་དང་གང་ནི་སྐྱེ་བ་ནི། ༼སྔར་གྱི་༽ །སྔོན་གྱི་སྐྱེ་༼བ་བདུན་༽བར་འགྱུར་བ་དག །༼སྐྱེ་བ་བདུན་༽དེ་ནི་དེ་འདྲའི་གཟུགས་དག་ཏུ། །རྣལ་འབྱོར་པས་ནི་འདི་ནི་མཐོང་། །དེ་ནི་གྲུབ་པའི་༼ཅི་འདོད་༽སྐྱེས་བུ་འགྱུར། །སྐྱེ་བ་བདུན་༼པ་རྙེད་ནས་༽གྱི་རིམ་པ་ཡིས།༼སྐྱེ་བ་བདུན་པའི་ཤ་མི་ཤ་༽ །དེ་ཡིས་༼ཊ་ཀི་ནིའི་ལ་༽གཏོར་མ་༼སྦྱིན་བསྲེག་ཟེར་༽རིམ་པར་བྱས། །བསྒྲུབ་པ་པོ་ནི་༼དངོས་གྲུབ་ཐམས་ཅད་༽འགྲུབ་པར་འགྱུར།༼སྐྱེ་བ་བདུན་པ་དེའི་ཤ་ཟོས་པའམ་གོ་རོ་ཙ་ནས་ཐིག་ལེས་བྱས་ནས་༽ །དེ་བཞིན་དཔག་ཚད་བརྒྱ་ཕྲག་ནི། །སྟོང་༼སྟེང་ཟེར་༽གི་སྟེང་དུ་༼མཁའ་སྤྱོད་དུ་༽སྐད་ཅིག་༼གིས་༽འགྲོ། །རྣལ་འབྱོར་༼སྙིང་པོའི་ཡི་གེ་ཉི་ཤུ་༢་པའི་༽སྔགས་མཆོག་དམ་པ་སྟེ། །མཁའ་འགྲོ་མ་ཡི་སྦྱོར་༼བས་ ཕྱིའི་རིགས་ལྡན་མ་མཆོད་པ་ལ་ངོ་ཤེས་དགོས་ངོ་ཤེས་པ་ལ་བརྡའ་དགོས་པ་༽གྲུབ་བྱེད། །རྣལ་འབྱོར་མཚན་མས་༼སྔོན་དུ་བསྙེན་པ་ལ་མཚན་མ་ཐོབ་ནས་༽གང་༼ཐོབ་ནས་༽ཟློས་པ་༼དེ་ནས་༽ །༼ཐུན་༤་ངེས་པ་༽ །ཟླ་བ་གཅིག་གིས་འགྲུབ་པར་འགྱུར། །གསང་བ་ཡི་ནི་སྔགས་༼ཉི་ཤུ་༢་པ་༽འདི་ནི། །སྙིང་པོ༼འི་སྔགས་༽་ཤིན་ཏུ་དགེ་བ་ཡིན། །གང་ཞིག་༼སྔགས་༽དེ་ཉིད་༼སྙིང་པོའི་སྔགས་སྐྱེ་བ་བདུན་པའི་བསྒྲུབ་པ་༽ཤེས་པ་ནི། །དེ་འདིར་རྣལ་འབྱོར་པ་ཉིད་དུ། །ཐེ་ཚོམ་མེད་དེ་༼ཛེ་ཀ་༽དེ་ཉིད་ནི། །ང་ཡིས་དེ་རྣམས་༼འགྲུབ་པར་༽བསྟན་པ་ནི། །མཁའ་འགྲོ་དྲ་བའི་བདེ་མཆོག་ཡིན་༼དང་པོ་ནམ་མཁའ་དང་མཉམ་པ་ལས་ཕྱིས་གུ་སཾ་བྷྲ་ར་ལས། ལས་བསྟན་པ་དེ་ཕྱིས་འདིར་བསྡུས་ཏེ་བསྟན་༽། །དཔལ་ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་དཔལ་ཧེ་རུ་ཀ་བོང་བུའི་རྣལ་འབྱོར་མཛད་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཅུ་བཞི་པའོ། །དེ་ནས་༼ནམ་མཁའ་དང་མཉམ་པ་དང་ཨ་བི་ར་ན་དང་ཧེ་རུ་ཀ་འབྱུང་པ་ལ་སོགས་པ་༽སྡོམ་པ་ཐམས་ཅད་ལ། །གང་ཞིག་༼དེ་ལྟ་བུའི་ལམ་དང་འབྲས་བུའི་གསང་པ་ཡང་རིགས་ལྡན་མ་མཆོད་པ་ལས་འགྲུབ་ལ་དེ་ལ་རིགས་ལྡན་མ་ངོ་ཤེས་དགོས་ལ་དེ་ལ་བརྡའ་དགོས་པས་ཡི་གེ་རེ་རེ་བའི་བརྡའ་བསྟན་ཏོ།འདི་ན་མར་ཡི་གེ་ལྡབས་པ་རྣམས་ནི་སྐབས་ཀྱི་སྟོབས་ཀྱིས་དོན་སོ་སོ་ལ་འཇུག་པ་ཡིན་ལ་སྐབས་ཀྱི་སྟོབས་དང་མ་འབྲེལ་ན་ནི་དོན་དེ་དག་དྲན་པས་ཆོག་གསུང་སྐད༽བརྡ་ནི་ཤེས་འབྱུར་བ། །དེ་ཉིད་ཀྱིས་དེ་འགྲུབ་པར་ནི། །ཐེ་ཚོམ་མེད་པར་བཤད་པ་ཡིན། །རྟ་ཞེས་བྱ་བ་སྐྱེས་བུར་བཤད། ༼ཕར་བྱེད་ན་ཡང་བྱེད་དང་ཚུར་བྱེད་ན་ཡང་བྱེད་དེ་ཡི་གེ་དེ་དང་དེའི་དོན་གྱི་གོ་བ་སྐྱེས་བུ་ཞེས་བྱ་བའམ་བུད་མེད་ཞེས་བྱ་བ་ལ་སོགས་པ་བསྐྱེད་པའོ༽ །༼ཡི་གེ་འདི་གསལ་པོ་མི་མཐོང་ཌི་༽ཞེས་བྱ་བ་༼དོན་གོ་བ་ཙམ་གྱིས་ཆོག་བྱ་མི་དགོས་གསུང་༽སྐྱེས་བུར་བཤད། །ཌི་ཞེས་བྱ་བ་བུད་མེད་ཡིན། །པུ་ཞེས་བྱ་བ་གནོན་པ་༼སྙོམས་འཇུག་༽ཡིན། །སུ་ཞེས་བྱ་བ་༼འབྲས་ཆན་ལ་སོགས་པ་༽ཟ་བ་ཉིད། །མ་ཞེས་བྱ་བ་མ་རུ་བཤད། །ཨ་༼ཨོ་༽ཞེས་བྱ་བ་ཆུང་མ་ཉིད། །བྷི་༼དྲི་ཟ་༽ཞེས་བྱ་བ་སྲིང་མོ་ཡིན། དྷི་ཞེས་བྱ་བ་མཛའ་མོར་བཤད། །ལུ་ཞེས་བྱ་བ་བུ་མོ་ཡིན། །སྟི་ཞེས་བྱ་བ་༼ཟླ་མཚན་གྱི་༽ཁྲག་ཏུ་བཤད། །ས་ནི་ཞི་བའི་༼ཆང་༽བཏུང་པ་ཡིན། །པེ་ཞེས་བྱ་བ་ཐུག་པ་སྟེ། །ཧེ་ཞེས་བྱ་བ་དེ་བཞིན་ཤ། བྷ་ཞེས་བྱ་བ་༼ཤ་༽ཟ་བ་ཡིན། བྷུ་ཞེས་བྱ་བ་༼འཕྲད་པའི་༽ཕྲད་པ་ཡིན། །པཱི་ཞེས་བྱ་བ་དུར་ཁྲོད་ཡིན། བྷུ་ཞེས་བྱ་བ་རོ་ཡིན་ནོ། དྷི་ཞེས་བྱ་བ་༼བྷ་ར་ཧི་༽རྣལ་འབྱོར་མ། །༼གོ་ཟེར་༽ལེ་ཞེས་བྱ་བ་ལཱ་མ་ཡིན་༼མཁའ་འགྲོ་མའི་རིགས་མས་བྱུང་བའོ༽། །སཏྲི་ཞེས་བྱ་བ་གཟུགས་ཅན་ཡིན། །ཀུ་ཞེས་བྱ་བ་མཁའ་འགྲོ་མ། །ཧ་ནི་ཁཎྜ་རོ་ཧ་ཉིད། །ཛ་ཞེས་བྱ་བ་བྱིན་པ་གཉིས༼འཁྲིལ་ལེ་བ་༽། །བྷ་ཞེས་བྱ་བ་༼གསང་བའི་རྡོ་རྗེ་བོ་ལའི་བརྡའ་ཡིན་༽དཔུང་བ་ཡིན། །སུ་ཞེས་བྱ་བ་༼བཀྲ་ཤིས་པའི་ཚིག་༽གསོང་པོར་སྨྲ། །ས་ཞེས་བྱ་བ་ལེགས་འོངས་ཡིན། །༼འདི་ཚོ་བྷ་དན་ཏའི་དཔེའ་ལས་མ་བྱུང་གསུང་༽མི་ཞེས་བྱ་བ་ཉ་ཡིན་ལ།བྷྱོ་ཞེས་བྱ་བ་བཟའ་བ་ཡིན། །བྱི་ཞེས་བྱ་བ་བཏུང་བ་ཡིན། །ག་ནི་༼བྲམ་ཟེ་མ་སོགས་༽བགྲོད་དང་བགྲོད་མིན་༼རྡོལ་བ་མོ་སོགས་༽ཡིན། །ཀ་ཞེས་བྱ་བ་འདོང་པ་ཡིན། །ས་ཞེས་བྱ་བ་གཞན་༼དུ་༽མི་འགྲོ་༼བ་༽། །ར་ཞེས་བྱ་བ་ཁྲོ་༼བ་༽མེད་མ། ༼འདི་མན་ཆད་ཡོད་༽ །དུ་ཞེས་བྱ་བ་སྤྱོད་ངན་མ་༼དྲིས་བའི་འདི་དག་མེད་གསུང་༽། །སུ་ཞེས་བྱ་བ་སྐལ༼་བ༽་བཟང་༼གཞོན་པ་༽མོ། །ན་ཞེས་བྱ་བ་༼རྒན་མོའི་༽སྐལ་ངན་མོ། །ས་ཞེས་བྱ་བ་དམ་ཚིག་ཅན། །ཨ་ཞེས་བྱ་བ་དམ་ཚིག་མེད། །ཨཱ་ཞེས་བྱ་བ་༼ཚོགས་ཀྱི་ནང་དུ་༽འོངས་པ་ཡིན། །ན་ཞེས་བྱ་བ་༼ཚོགས་ཀྱི་ནང་དུ་༽མ་འོངས་ཡིན། །སོ་ཞེས་བྱ་བ་༼བརྩེ་སེམས་ཆེ་བ་༽ཆགས་པ་ཡིན།༼ཡི་གེ་རེ་རེ་དོན་༢་སྟོན་པར་འདོད་པའམ་ཡི་གེ་སོ་སོས་དོན་༡་སྟོན་པར་འདོད་པ་འབྱུང་ཡང་བརྡ་དེས་དོན་གཉིས་སྟོན་པར་གོ་བར་ཆོག་གསུང་༽ །འདི་དག་ནི་ཡི་གེ་རེ་རེ་ཞིང་བརྡ་ཡིན་ཏེ། །དཔའ་བོ་དང་སྲིང་མོར་༼༡་གིས་༡་ངོ་༽ཤེས་པར་བྱའོ།༼བསྒྲུབ་པ་པོ་ཉན་ཐོས་ལ་སོགས་པ་༽ །དད་པ་དང་མི་ལྡན་པ་རྣམས་ལ་༼བརྡའ་ན་༽སྦྱིན་པར་མི་བྱའོ།༼ རིགས་ལྡན་མ་མཆོད་པ་ལ་སོ་སོའི་སྐྱེ་བོ་དང་ཏིར་ཏི་ཀ་དང་མཚན་ཉིད་ཐེག་པ་ལ་སྦྱིན་པར་མི་བྱ་གསུང་༽ །༼གསང་སྔགས་མཆོག་ལ་༽དམ་ཚིག་གི་མཆོག་ཡིད་དུ་འོང་བ་ལ་༼དད་ལ་༽དགོས་པ་དང་ལྡན་པ་རྣམས་ལ་སྦྱིན་པར་བྱའོ།༼ཌ་ཀི་ནི་སྤྱིའི་མཚན་ཉིད་ལྔ་ལྔར་བསྟན་ སྤྱིར་བསྟན་༽ །དཔལ་ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་བརྡ་བའི་ལེའུ་སྟེ་བཅྭ་ལྔ་པའོ། །དེ་ནས་༼མཧཱ་མུ་ཏྲ་༽དངོས་གྲུབ་ཆེན་པོ་༼གྲུབ་པའི་རྒྱུ་རིགས་ལྡན་མ་ཡིན་པས་དེའི་མཚན་ཉིད་ གཞན་ལ་༽གསང་། །བསྒྲུབ་པ་པོ་ལ་བཤད་བྱ་བ། ༼སི་ཏི་བསྒྲུབ་པ་ལ་༽ །དད་པ་རབ་དང་ལྡན་པ་དང་༼བླ་མ་དང་བུད་མེད་ཐམས་ཅད་ལ་དད་པ་བདེ་མཆོག་དང་ ལྡན་པ་༣༽། །༼ཤ་ལྔ་བདུད་རྩི་ལྔ་རྟེན་པ་ལ་ རྣམ་རྟོག་ཆུང་༽མཆོག་ཏུ་དམ་ཚིག་བརྟེན་པའི་སྣོད་༼དུ་གྱུར་པ༽། །དེ་ལ་རབ་ཏུ་བསྟན་པར་བྱ། །ཡིད་ནི་དགའ་བ་༼དང་ལྡན་གཞན་ལ་༽ཕན་བྱེད་པ།༼རིགས་བདུན་དུ་མངོན་པ་ནི་ཧེ་རུ་ཀ་རྡོ་རྗེ་སེམས་དཔའ་༡་ཡིན་༽ །དད་པ་ཅན་ལ་རབ་སྦྱིན་པ། །ཁ་དོག་༼གི་རྟགས་དང་༽དྲ་ལ་༼དབྱིབས་གོས་དགའ་བའི་ཡུལ་གྱི་སྤྱོད་ལམ་ཏེ་༽སོགས་པ་དང་། །༼དེ་ལྟ་བུ་དེ་སྙོམས་འཇུག་བྱས་ཏེ་དེ་ཁོ་ནའི་ པུ་ཙས་མཆོད་པ་༽གཉིས་མེད་དཔའ་བོས་བརྟེན་པར་བྱ། །༼ཌ་ཀི་ནི་༽དེ་ཉིད་༼ཀྱི་མཚན་ཉིད་༽ཤེས་པ་ཙམ་གྱིས་ནི། །༼མཧཱ་མུ་ཏྲའི་༽བསྒྲུབ་པ་པོས་ནི་དངོས་གྲུབ་ཐོབ་༼འདི་རྒྱུ་རྡོ་རྗེ་འཛིན་པའི་དབང་དུ་བྱས་པ་ནི། དབྱེ་བཞི་ལ་རིགས་དང་སྤྱོད་ལམ་དང་ལས་དང་པོ་རིགས་ཀྱི་དབྱེ་གཞི་ལས་ཕྱེ་བའོ༽། །༼རྒྱལ་རིགས་ཀྱི་བུ་མོ་དང་རྡོ་རྗེ་སེམས་དཔའི་རིགས་༽བུད་མེད་པད་༼མ་དཀར་པོ་༽རྩ་ལྟར་༼ཁ་ཏོག་གི་རྟགས་༽དཀར་ཞིང་། ༼བུད་མེད་གང་ཡང་རུང་སྟེ་མཚན་མ་འདི་དག་དང་ལྡན་ན་མིའི་རྒྱལ་རིགས་མར་གདགས། ལྷའི་རྡོ་རྗེ་སེམས་དཔའི་རིགས་ཞེས་བྱ་གསུང་། དེས་འོག་མ་རྣམས་འདྲེ། རེས་ཕལ་ཆེར་མཚན་མ་འདི་རྣམས་རྒྱལ་རིགས་ལ་འོང་གསུང་།༽ །༼དབྱིབས་ཀྱི་རྟགས་༽པད་མའི་འདབ་༼མ་༽ལྟར་དཀྱུས་རིང་༼པའི་༽མིག །༼གོས་ཀྱི་རྟགས་༽རྟག་ཏུ་གོས་ནི་དཀར་ལ་དགའ། །༼དྲིའི་རྟགས། དབུགས་དང་རྡུལ་༽ཙན་དན་གསར་བའི་དྲི་དང་ལྡན། །༼དགའ་བའི་ཡུལ་གྱི་སྤྱོད་ལམ། ཆོས་འཆད་པ་དང་ཆོས་བྱེད་པ་མཐོང་ན་དགའ་བ་དང་༽བདེ་གཤེགས་འདུས་པ་ཉིད་ལ་དགའ། །༼རྡོ་རྗེ་སེམས་དཔའ་དང་ཕག་མོའི་རིགས་༽རིགས་རྒྱུད་༼འདི་དང་འོག་གི་དམར་ཞིང་༽ལས་བྱུང་ཤེས་པར་བྱ། །བུད་༼མེད་༽གང་༼ཁ་ཏོག་༽བཙོ་མའི་གསེར་འདྲ་ཞིང་། །༼གོས་༽དམར་དང་སེར་བའི་གོས་ལ་དགའ། །༼དྲི་༽ཛཱ་ཏི་༼དོམ་པའི་༽ཙམ་པའི་དྲི་༼ནིའི་རིགས་༽དང་ལྡན། །དེ་ཡང་༼རད་ནའི་བསྒྲུབ་པ་པོ་༽དཔའ་བོའི་༼བཟང་ཟེར་༽རྗེས་འགྲོ་འགྱུར། ༼དབྱིབས་དང་དགའ་བའི་ཡུལ་སྔ་མས་ཤེས་པར་བྱ་སྟེ་སྔ་མ་ལ་ལྟོས་པ་འོག་མར་ཀུན་ལ་ཤེས་པར་བྱ་༽ །༼དམངས་མོ་ཧེ་རུ་ཀའི་རིགས་༽ཐམས་ཅད་ཨུད་པལ་ལྟར་༼ཁ་ཏོག་༽སྔོ་བསངས། །དྲི་དང་གོས་ནི་སྔོ་ལ་དགའ། །ཨུད་པལ་སྔོན་པོའི་དྲི་ཡོད་པ། །དེ་ནི་དཔའ་བོ་བཟང་༼མི་བསྐྱོད་པའི་བསྒྲུབ་པ་པོའི་༽རྗེས་འགྲོ༼་ཚོས་མ་དོན་གྲུབ་ཀྱི་རིགས་ལ་དགའ༽། །ཤིན་ཏུ་རྣམ་དག་༼གར་མ་དང་སྣང་བ་མཐའ་ཡས་ཀྱི་རིགས་༽བུད་མེད་ནི། །པད་མ་དཀར་འདྲའི་༼གཡུང་མོ་གསུང་༽མདོག་གང་ཡིན། །རྟག་ཏུ་༼དམར་པོ་༡་ཡོད་༽པད་མའི་རྩ་བའི་དྲི། །དེ་ཡང་དེ་བཞིན་དཔའ་བོའི་བློ་༼སྣང་བ་མཐའ་ཡས་བསྒྲུབ་པ་པོས་བསྟེན༽ །༼འདི་འབྲས་བུ་རྡོ་རྗེ་འཛིན་པའི་དབང་དུ་བྱས་པ་ཡིན་༽ །དམར་ཞིང་སེར་སྐྱའི་༼འདི་ཡང་རྡོ་རྗེ་སེམས་དཔའི་རིགས་ཏེ་གྱུང་མོ་ལ་བརྟག༽བུད་མེད་གང་༼ཁ་ཏོག་༽། །གཟུགས་བཟང་གོས་ནི་དམར་བ་དང་། །མ་ལི་ཀ་དང་ཨུད་པལ་དྲི། །༼བཛྲ་བྷ་ར་ཧིའི་རིགས་༽དེ་ནི་རྡོ་རྗེའི་༼སེམས་དཔའ་༽རིགས་བྱུང་བ། ༼རྡོ་རྗེ་སེམས་དཔའ་༢་འབྱུང་པ་སྔར་ནི་རྒྱུ་རྡོ་རྗེ་འཛིན་པའི་རིགས་ཏེ་༡་དུ་བྱས་པས་དྲུག་ལས་མེད་གསུང་།༽ །སེར་ཞིང་ལྗང་བའི་བུད་མེད་གང་། །གོས་ནི་དཀར་ལ་དགའ་བ་དང་། །ཤྲི་ཤའི་དྲི་ཡི་མེ་ཏོག་༼གི་དྲི་དང་༽ལྡན། །དེ་བཞིན་གཤེགས་རིགས་རྗེས་འགྲོ་ཡིན། །བུད་མེད་གང་ཞིག་༼བྲམ་ཟེ་མོ་དང་རྣམ་པར་སྣང་མཛད་ཀྱི་རིགས་ཀྱི་༽ཁ་དོག་དམར། །དེ་ཡི་མདོག་ཅན་གོས་འཆང་ཞིང་། །༼རད་ནའི་རིགས་ལ་༽རྟག་ཏུ་ག་བུར་དྲི་དང་ལྡན། །རྣམ་སྣང་རིགས་ཀྱི་རྗེས་འགྲོ་ཡིན།༼འདི་རྣམས་ནི་བསྒྲུབ་པ་པོས་བསྟེན་༽ །རྣལ་འབྱོར་མ་ཡི་རིགས་རྣམས་ནི། །དེ་ལྟར་༼བསྡུས་ན་དྲུག༽བདུན་པོ་༼སོ་སོར་བདུན་དུ་༽ངེས་བཤད་པ། །༼བྱ་བ་ཐམས་ཅད་ལག་པ་༽གཡོན་པའི་༼དབྱེ་གཞི་༢་པ་སྤྱོད་ལམ་གྱི་དབྱེ་བ་ནི། སྤྱིའི་མཚན་ཉིད་རྐང་བ་གཡོན་པ་སྔོན་ལ་འགྲོ་བ་མིག་གཡོན་པ་སྔོན་ལ་བལྟས་༽ཀུན་སྤྱོད་ལ་རྟག་དགའ། །༼སོ་སོའི་མཚན་ཉིད་༽འདི་དག་རང་གི་མདོག་གིས་ཁྱབ་༼འདི་ཡན་ཆད་ཕག་མོའི་རིགས་ཡིན་གསུང་། ཕག་མོ་ལ་རིགས་དྲུག་དུ་ཕྱེ་བའོ༽། །༼འདི་ན་མར་རྡོ་རྗེ་སེམས་དཔའི་རིགས་ཡིན་གསུང་༽རིགས་༼ཐམས་ཅད་ཀྱི་༽ཀྱི་རིག་པའི་ཡི་གེ་༼སྟེ་རིགས་ཐམས་ཅད་ཀྱི་མཚན་མ་དང་༽ཡང་། །ཁ་དོག་དྲུག་ཏུ་འགྱུར་བ་ཡིན་༼ཀ་སྟེ་སྣ་ཚོགས་དང་ལྡན་གསུང་༽། །རང་གི་༼རིགས་ཀྱི་༽ཕྱག་རྒྱ་༼ལུས་ལ་༽བཅིང་བ་དང་། །རང་༼གི་༽རིག༼ས་ཀྱི་སྔགས་༽ལས་༼ཏྲཾ་༽བྱུང་ཚིག་༼ངག་༽ཏུ་སྨྲ། །༼ཕྱོགས་༽གཡོན་ནས་འགྲོ་བའི་བུད་མེད་གང་༼སྤྱོད་ལམ་༽། །རྣལ་འབྱོར་པའི་ཡང་གཡོན་ལ་བརྟག །ལག་པ་གཡོན་གྱིས་༼བརྡའ་ཐམས་ཅད་༽མཚོན་པ་དང་། །གཡོན་༼གྱིས་མིག་ཟུར་དམིག་གིས་བལྟ་གསུང་༽ནས་བལྟ་བས་རྣམ་བར་བལྟ། །ལྷ་མོ་རྣམས་དང་༼བུད་མེད་གར་འཚོགས་པར་༽དགའ་སྨྲ་བ། །དེ་ནི་༼བྱིན་གྱིས་བརློབ་ནུས་པ་༽དམ་ཚིག་ལྡན་པར་༼དེ་མེད་ན་༽བཤད། །བུད་གང་གུས་པར་བྱེད་པ་༼པད་མའི་རིགས་ཀྱི་༽ཡིས། །༼རང་གི་༽རིགས་ཀྱི་༼སྔགས་བཟློས་པ་ཧྲི་ཉེས་པ་༽ས་བོན་རབ་སྟོན་ཅིང་། །རིགས་ཀྱི་བྱ་བ་༼པད་མའི་རིགས་ཀྱི་བྱ་བ་༽་མི་འདོར་ལ། །རང་གི་གཙུག་ལག་ཚིག་མི་སྤོང་། །རང་གི་རིག་པ་༼ཧྲི་༽ཟློས་བྱེད་པ། །༼རང་གི་རིགས་ཀྱི་༽དམ་ཚིག་ལྡན་པར་བསྟན་པ་ཡིན། །༼མི་བསྐྱོད་པའི་རིགས་ཀྱི།  ཐལ་མོ་གཉིས་སྤྱི་བོར་སྦྱོར་བ་༽ཕྱག་འཚལ་བ་ནི་གང་འཆིང་བ། །གཡོན་པའི་ལུས་ཀྱིས་རྟག་ཏུ་འདུད། །༼བུད་མེད་འདུས་པ་ལ་༽ལྷ་མོ་རྣམས་དང་གང་སྨྲ་བ་༼ཀུན་ཟེར་༽། །དེ་ནི་ངེས་པར་བདེན་པར་འགྲོ་༼བསྒྲུབ་པ་པོ་ལ་སི་ཏི་སྟེར༽། །༼དོན་གྲུབ་ཀྱི་༽མཐེ་བོང་གཡོན་པས་ས་ལ་ནི། ༼རིགས་ཀྱི་མཚན་མ་ཡང་ན་ཨོཾ་ཞེས་པ་༽ །རྟག་པར་རི་མོ་འབྲི་བྱེད་ཅིང་། །མགོ་ནི་འཕྲུག་པར་༼རྡོ་རྗེའམ་རལ་གྲིའམ་ཐོད་པ་གྲུ་༣་པ་འདྲི་༽བྱེད་པ་དང་།༼སྐྱེས་པ་དང་འཕྲད་ཙ་ན་༽ །༼དོན་བསྒྲུབ་ནི་བསྒྲུབ་པ་པོ་ལ་༽ཟུར་གྱིས་ལྟ་ཞིང་༼བརྡའི་༽ལག་པ་སྟོན། །བསྒྲུབ་པོའི་ཡུལ་ལ་ཕན་པ་རུ། །དེ་ཡི་རང་བཞིན་༼དེའི་སྔགས་སུ་ཁ་ཞེས་པ་༽དྲན་པ་དང་། ༼རྣམ་སྣང་གི་རིགས་སུ་༽ །མཁུར་བའམ་ཀོ་སྐོ་དག་དང་ནི། །སྣ་དག་ཏུ་ནི་སོར་མོ་སྟོན་༼རེག༽། །ཟུར་གྱིས་༼བ་རོའི་བསྒྲུབ་པ་པོ་ལ་༽ལྟ་ཞིང་ལན་གཅིག་༼བྲུཾ་ཞེས་པ་རང་གི་རིགས་ཀྱི་༽སྔགས། །ཟློས་ཤིང་རིག་པ་རྟག་པར་༼བསྒྲུབ་པ་པོ་ལ་༽ལྟ། །བདེན་པར་༼དངོས་གྲུབ་སྟེར་བར་༽འགྲོ་བའི་རྣལ་འབྱོར་མ། །ངེས་བར་དམ་ཚིག་ཅན་ཡིན་ནོ། །༼དེ་ལྟ་བུ་དེ་༽རྣལ་འབྱོར་མ་ནི་༼དངོས་གྲུབ་སྟེར་བ་༽ཡིད་ཆེས་འགྱུར། །ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས་རྣལ་འབྱོར་མ་བདུན་གྱི་མཚན་ཉིད་ངེས་པར་བརྟག་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཅུ་དྲུག་པའོ།། །དེ་ནས་༼ལོ་ཀ་དང་ལོ་ཀ་ལས་འདས་པའི་མིང་གི་རྣམ་གྲངས་༽རྙེད་དཀའི་རྣལ་འབྱོར་མ། །དེ་བཞིན་༼ཕྱོགས་༡་དུ་བསྟན་༽མཁའ་འགྲོ་མ་རྣམས་ཀྱིས་༼ངོ་ཤེས་པར་བྱ་སྟེ་བསྙེན་བསྐུར་ཞིང་བསྟེན་པ་ལ་༽ ། ༼ད་ནི་ལོ་ཀ་དང་ལོ་ཀ་ལས་འདས་པའི་མིང་གི་རྣམ་གྲངས་ཀྱི་སྒོ་ནས་རིགས་ངོ་ཤེས་པར་བྱ་བ་བསྟན། མཁའ་འགྲོ་མ་བདུན་པོ་འདི་ཨ་བི་ད་ན་ནས་ལས་ལས་སྐྱེས་པར་འདོད། ཀུན་སྤྱོད་ཞིང་སྐྱེས་སུ་འདོད། རྡོ་རྗེ་མཁའ་འགྲོ་དང་གཞུང་འདི་༢་སྔགས་སྐྱེས་སུ་འདོད་ན་གསུང་། ནང་དུ་བདུད་རྩི་ལྔ་ལ་བརྟེན་ནས་ཕྱི་རོལ་དུ་སི་ཏི་འབྱུང་བས་༽ །བདུད་རྩི་ལྔ་རྣམས་༼ཏེ་དངོས་གྲུབ་ལྔ་རྣམས་སུ་༽ཡང་དག་འབྱུང་། །༼ལོ་ཀ་དང་འདས་པའི་མིང་གི་རྣམ་གྲངས་༽ཡ་མི་ནི་དང་སྐྲག་བྱེད་མ་༼དབྱེ་༤་༢་ལས་དབྱེ་བ་ལྔ་དང་དྲུག༽། །འདོད་ལྡན་མ་དང་འཇིགས་གཟུགས་མ། །ཀུན་ཏུ་སྤྱོད་མ་མཛེས་མ་དང་། བྷ་སུ་ར་དང་རྣམ་པ་བདུན། ༼འདི་དག་འཇིག་རྟེན་ལས་འདས་པའི་ཁོ་ན་ལས་གྲགས་པ་དང་འདས་པའི་སྤྱོད་པ་དང་ལྡན་པས་སོ། དོན་གོ་ཆའི་དཔའ་མོ་དྲུག་གོ༽ །སྡུད་པ་མོ་ནི་འདིར་བཤད་བྱ། ༼འདི་ལོ་ཀ་པ་ནས་གྲགས་པ་དང་འདས་པའི་སྤྱོད་པ་དང་ལྡན་པས་༽ །གཟུགས་ཅན་མ་དང་༼ཡ་མི་ནི་གཟུགས་ཅན་མར་སོང་དེས་འདྲེའོ་༽ཙུམ་པི་ཀ་༼སྐྲག་བྱེད་མ་༽ །ལཱ་མ་ཡོངས་གྱུར་༼འདོད་ལྡན་མ་འཇིགས་གཟུགས་༽བྱིས་བཅས་མོ་༼ཀུན་སྤྱོད་༽། །༼མཛེས་མ་༽མི་ལྡོག་ཨེ་ཧི་ཀ་ལྷ་མོ་༼བྷ་སུ་རའོ༽། །མཁའ་འགྲོ་མ་ནི་བདུན་དུ་བཤད་༼ཨུ་ད་༽ ། ༼ནིར་དེ་༽ །མངོན་པར་༼བསྒྲུབ་པ་པོ་ལ་ཆགས་པས། ལོ་ཀ་བའི་བདུན་པའི་རྟགས་སམ་མཚན་ཉིད་སོ་སོར་བཤད་པའི་༽ཞེན་པས་ལྟ་བ་དང་། །སྨིན་མ་༼གཡས་གཡོན་ཡོ་མིན་༽འདེགས་པར་གང་བྱེད་ཅིང་། །༼ཕྱིས་ཀྱི་ རྒྱུ་བ་བོར་ནས་དང་པོའི་རྒྱུ་པ་འཛིན་པ་༽སྔོན་བཞིན་གཟུགས་ནི་སྡུད་བྱེད་ལ། ༼བཞི་སྡུད་པ་དང་འཇོག་པ་ལ་གསུང་། སྔར་གྱི་ རྒྱུ་བ་བོར་ནས་ཕྱིས་ཀྱི་རྒྱུ་བ་འཛིན་པ་༽ །ཕྱིས་ནི་འཇོག་པར་བྱེད་པ་ཡིན། །དེ་ནི་གཟུགས་ཅན་མར་ཤེས་བྱ། །དཔའ་བོ་༼རྣལ་འབྱོར་མ་དེ་༽གཉིས་༼སུ་༽མེད་༼པར་༽བསྟེན་བྱ་འོ་༼བསྟེན་དུ་བཏུབ་པོ་༽ ། ༼གཟུགས་བྱིས་པ་སྡུག་པའམ་མི་སྡུག་པ་ལ་༽ །སྡུག་པའམ་ཡང་ན་མི་སྡུག་པའི། །བྱིས་པ་༼ལ་༽མཁྱུད་ཅིང་ཙུམ་པ་༼འོ་བྱེད་པ་༽ན། །དེ་ནི་ཙུམ་པི་ཀར་ཤེས་བྱ་༼འོ་བྱེད་པར་༽། །༼དེ་བསྟེན་པ་པོ་༽མཁའ་འགྲོ་སྡིག་པ་ཟད་བྱེད་ཡིན་༼བརྟེན་དུ་བཏུབ༽། །ཟས་ཟ་བ་ན་ཟུར་དུ་༼གཡོན་དུ་༽ལྟ། །༼བཞིན་༽ཁྲོ་གཉེར་དང་ནི་གདོང་དག་༼འཁོར་༽དང་། །༼བར་བར་དུ་༽སྨིན་མ་བསྒྱུར་ཅིང་སྡིགས་འཛུབ་བྱེད། །འདི་ནི་གཞན་དུ་༼རྒྱུ་བ་དེ་ཉིད་ལས་གཞན་དུ།བསྒྱུར་༽མི་འབྱིན་ཅིང་། །༼གཞན་དེས་༽འཇིགས་པར་བྱེད་པ་གང་ཡིན་པ། །དེ་ནི་ལ་༼འདིར་བརྟེན་དུ་མི་རུང་གསུང་༽མ་ཡིན་པར་བསྟན། །ཕག་དང་སེང་གེ་བྱི་ལ་དང་། །ལྕེ་སྤྱང་ར་དང་རྟ་དག་དང་། །ཐམས་ཅད་༼སྐྲོད་ཅིང་སྐྲག་པར་བྱེད་པས་༽དེར་ནི་འཇིགས་བྱེད་པ། །༼དེ་ལྟ་བུ་སྐྲག་ཅིང་བསྒྱུར་བར་བྱེད་པས་༽ཡོངས་སུ་གྱུར་མར་དེ་༼མི་བསྟེན་༽བཤད་དོ། །༼བསྒྲུབ་པ་པོ་ལ་༽ཤིན་ཏུ་དགའ་བ་༼ཧ་ཧ་ཞེས་༽རྒོད་པ་༼པ་གསལ་བ་༽དང་། །༼གང་སོང་བར་༽སོང་ནས་སླར་ཡང་མི་ལྡོག་ལ། ༼སྐྱེས་པའམ་བསྒྲུབ་པ་པོ་ལ་༽ །རྗེས་སུ་ཆགས་ནས་གསལ་བར་རྒོད། ༼བྱིས་པའི་སྤྱོད་པ་དང་ལྡན་པས་བྱིས་བཅས་མོ་༽ །ཁཎྜ་རོ་ཧར་དེ་༼དེ་བསྟེན་ནོ་༽བཤད་དོ། །༼དེའི་རྒྱུ་ བ་གང་གིས་མཐོང་བ་དེའི་༽ཡིད་ནི་ཀུན་ཏུ་སྐྱོ་བ་དང་༼དེ་ལྟ་བ་ལ་སོགས་པ་མི་འདོད༽། །༼དེའི་༽རྐང་པ་༼འམ་༽ལག་པས་བོང་བའམ། །གོས་མཐའ་ཡང་ནི་ཤིང་དག་གིས། །དེས་རེག་པ་ནི་༼དེས་གང་ལ་རེག་པ་དེ་མི་འཚོ་༽འཚོ་མི་འགྱུར། ༼ འདི་སྔར་དྲན་པའི་མཚན་ཉིད་དམ་རྟགས་དང་། མི་འདྲ་བ། ཁ་དོན་དང་། དྲི་དང་། ཤའི་གཉེར་མ་ལ་སོགས་པའི་རྟགས་སྟན་གསུང་ ༽ །མི་ལྡོག་༼མར་༽མར་ནི་ཤེས་༼པར་༽བྱ་སྟེ། །བསྒྲུབ་པ་མིན་པར་དེ་གྲགས་སོ།༼  དྲུག་པོ་མེད་པར་དེ་༡་བུས་མཆོད་ཅིང་བསྟེན་དུ་མི་རུང་པས། དྲུག་པོ་ཡོད་ན་༡་གིས་༡་གྲོགས་བྱས་པས་མཆོད་ཅིང་བསྟེན་དུ་རུང་༽ །རྒོད་དང་རྒྱུ་མེད་པ་རུ་ནི། །༼དེའི་འཕྲོ་ལ་༽ངུ་ཞིང་རབ་ཏུ་ཁྲོ་བ་སྟེ། །དེ་ནི་ཨེ་ཧི་ཀར་དྲན་བྱ། །༼དེ་༽ལྷ་མོ་༼གསལ་པོར་༽གསོང་པོར་སྨྲ་བ་ཡིན་༼མི་བསྟེན་༽ ། ༼འདིར་སྡུད་པ་པོའི་དོད་ཡིན་གསུང་༽ །སངས་རྒྱས་པ་དང་རྟག་ཏུ་སྨྲ་༼སངས་རྒྱས་པ་གང་ན་ཡོད་པའི་སར་ཕྱིན་ཏེ་༽། །དེ་ཉིད་རྡོ་རྗེའི་རིགས་ལས་བྱུང་། ༼སྡུད་བྱེད་༽ །མཁའ་འགྲོ་མ་ཡི་རིགས་༼སྡུད་བྱེད་བརྒྱད་ཀྱིས་བསྡུས་པ་ཡི་ཌ་ཀི་ནི་བདུན་པོ་མཆོད་པ་ན། རྟེན་བྲིས་སྐུ་ལ་སོགས་པ་མ་འབྱོར་ན་མཚན་མ་བྲིས་ཏེ་མཆོད་པར་བསྟན༽་ཕྱག་རྒྱ་༼བརྒྱད་ཀྱི་༽། །དཔའ་བོས་བསྙེན་ཕྱིར་མཚན་མ་བལྟ། །༼རྒྱུ་བ་ཅན་གྱི་༽ཐོད་པ་༼ཙི་པི་ཀའི་༽དགྲ་སྟ་༼ལ་མའི་༽མཆེ་བ་དང་། ༼ཡོངས་གྱུར་མའི་༽ །འཁོར་ལོ་༼བྱིས་བཙེས་མོའི་༽རྒྱལ་མཚན་༼མི་ལྟོག་མའི་༽རལ་གྲི་དང་། ༼སྡུད་བྱེད་བརྒྱད་ཀྱིས་བསྡུས་བྱ་རྣལ་འབྱོར་མ་སུམ་བཅུ་བདུན་བསྡུས་ཏེ། དེ་ལ་ཡང་པྲཛྙ་ར་ཀྲི་ཏའི་ཏིག་ཆུང་དང་འབའ་དན་ཏ་གསུང་པས་ན། ན་རོ་པའི་དགོས་པ་འདི་ཡིན་གསུང་པ་དང་། བགྲེས་པོ་རྣམས་གསུང་པ་གསུམ་དུ་ཤེས་པར་བྱ་དགོས་སོ༽ །སྐྲག་བྱེད་༼རྡོ་རྗེ་༽བརྒྱད་པ་༼ཨོ་ཧི་ཀ་ལ་མོའི་སྡུད་པ་མོ་༽དུང་དུ་བཤད་༼ཕག་མོའིལ་རྒྱུ་འབྲས་༢་སུ་ཕྱེ་བའི་ཕྱག་མཚན༽། །དཔའ་བོའི་དབང་ཕྱུག་༼སུམ་བཅུ་བདུན་༽ཐམས་ཅན་ཀྱི། །རིགས་ཀྱི་ཕྱག་རྒྱ་༼བརྒྱད་དུ་བསྡུས་པ་༽ཡིན་པར་བཤད། །དཔལ་ཧེ་རུ་ཀ་མངོན་པར་བརྗོད་པ་ཞེས་བྱ་བ་ལས། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་གཟུགས་ཡོངས་སུ་བརྗོད་པ་དང་ཕྱག་མཚན་གྱི་ཕྱག་རྒྱ་བསྟན་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཅུ་བདུན་པའོ། །དེ་ནས་གཞན་ཡང་བཤད་བྱ་པ་༼ཙུན་བྷི་ཀས་བསྡུས་པའི་མཁའ་འགྲོ་མ་ལ་རིགས་དྲུག་དུ་ནང་ཚན་གྱི་དབྱེ་བ་སྟོན་༽། །མཁའ་འགྲོ་རྣམས་ཀྱི་༼རྟེན་མའི་བུ་མོ་ལ་ཡོད་པའི་༽མཚན་ཉིད་ནི་༼མཁའ་འགྲོ་མ་དྲུག་དུ་དབྱེ་བ༽། །༼དམ་ཚིག་ཅན་༽གང་གིས་༼བསྒྲུབ་པ་པོ་ཤེས་པར་བྱ་སྟེ་མཆོད་པས་དངོས་གྲུབ་གསོལ་བས་༽ཡང་དག་ཤེས་པ་ཡི། །མཁའ་འགྲོའི་དམ་ཚིག་ལ་གནས་པའོ། ༼པདྨའི་རིགས་ཀྱི་མཁའ་འགྲོ་མ༽ །དམར་ཞིང་སེར་བའི་བུད་མེད་གང་༼འདི་སྔར་བསྟན་པའི་བུད་མེད་དམ་རྟགས་དང་མི་འདྲ་བ་ཁ་དོག་དང་དྲི་དང་ཤའི་གཉེར་མ་ལ་སོགས་པའི་རྟགས་བསྟན་གསུང་༽། །༼ཁ་དང་ཆོས་འབྱུང་ནས་༽པད་མའི་དྲི་ནི་རྣམ་པར་གཏོང་། །ལྟ་སྟངས་རང་བཞིན་ཞི་བ་དང་། །ཞེན་པའི་༼ཆགས་པས་༽ལྟ་བ་རྗེས་འགྲོ་བ། །བུད་མེད་གང་གི་སེན་མོ་དམར། །མིག་ནི་ཀུན་ཏུ་དམར་བ་དང་། །ཁྱིམ་དུ་པད་མ་བྲི་བ་༼བྲིས་ནས་མཆོད་པ་༽ནི། །པད་མ་གར་དབང་རིགས་བྱུང་༼མ་༽ཡིན། །༼རྡོ་རྗེ་རིགས་ཀྱི་མཁའ་འགྲོ་མ་༽སྨིན་མའི་དབུས་ན་རྩེ་གསུམ་༼གྱི་རི་མོ་༽ཡོད། །ལུས་ནི་སྔོ་༼སྐྱ་༽བསངས་༼སྔོ་༽སྐྱ་མོ་དང་། །༼ཡི་དམ་དུ་༽རྟག་ཏུ་རྡོ་རྗེའི་རིགས་བསྒོམ་པ། །གང་གི་༼རང་གི་༽ཁྱིམ་དུ་རྡོ་རྗེ་འབྲི་༼ཞིང་དེ་ལ་༽། །རྟག་པར་མཆོད་པ་བྱེད་པ་ཡི། །མཁའ་འགྲོ་མ་དེ་༼བསོད་ནམས་ཆེ་བ་དང་༽དཔལ་ལྡན་ནི། །ཧེ་རུ་ཀ་ཡི་རིགས་བྱུང་༼ཞིང་སྐྱེས་ཀྱི་ཌ་ཀི་ནི་བྱིན་གྱིས་བརླབས་པ་ཡིན་པས་འདི་ཤིན་ཏུ་གྲུབ་ཐག་ཉེ་བས་བསྟེན་གསུང་༽ཡིན། །གང་གི་༼སྨིན་མ་བས་མཐོ་བ་ན་༽དཔྲལ་བར་༼བུད་མེད་རད་ནའི་རིགས་༽རྩེ་གསུམ་འམ་༼སོན་ཟེར་༽། །མདུང་ཐུང་༼འདྲ་བ་༽དག་ཀྱང་སྣང་འགྱུར་ཞིང་། ༼ཤ་རྩི་༽ །མིག་དམར་མདོག་ནི་དམར་སེར་ཡང་༼སེར་བ་ཡང་༽། །དེ་བཞིན་རྐང་པ་ལག་པ་དམར། །ར་སྐྱེས་ཁྱིམ་བྱ་དག་ལ་ཡང་། །རྟག་ཏུ་ཡིད་ནི་དགའ་འགྱུར་ཞིང་༼དེ་ཁྱིམ་དུ་བསྟེན་༽། །དེ་ཡི་ཁྱིམ་དུ་རྡོ་རྗེའི་མཚན་༼མ་བྲིས་ནས་དེ་ལ་༽། །རྟག་ཏུ་གང་ཞིག་མཆོད་བྱེད་པ། ཤྲཱི་ཧེ་ཀའི་༼རད་ནའི་རིགས་ཀྱི་༽རིགས་ལས་བྱུང་། །མཁའ་འགྲོ་ཡིན་པར་གདོན་མི་ཟ་༼དེ་བསྟེན་༽། །༼དེ་༤ན་གཤེགས་པའི་རིགས་ཀྱི་ཌ་ཀི་ནི་༽འཁོར་ལོ་གང་གི་དཔྲལ་བ་འམ། །ལག་པ༼འི་མཐིལ་དུ་༽ར་ཡང་ནི་སྣང་བར་འགྱུར། །སྤྲིན་སྔོན་དག་དང་༼མདོག་སྔོ་ནག་དུ་༽འདྲ་བ་ནི། ༼ ཐོད་དམ་སྟོད་གཡོགས་ཀྱིས་འགོ་འགྱེབས་པ་༽ །རྟག་ཏུ་དཔྲལ་བར་གོས་འཆང་བྱེད། །སྐལ་བ་ཆེན་པོ་༼བསྡུ་ན་༽ཕུན་འཚོགས་ཤིང་། །མཆོག་ཏུ་༼བརྫུན་མི་སྨྲ་བས་༽བདེན་པ་གང་ཡིན་༼པ་སྨྲ་༽དང་། །ཁྱིམ་དུ་འཁོར་ལོ་འབྲི་བྱེད་ཅིང་། །རྟག་ཏུ་དེ་ལ་མཆོད་བྱེད་པ། །རྡོ་རྗེ་ཕག་མོའི་༼ཐ་ཏའི་༽རིགས་བྱུང་བའི། །མཁའ་འགྲོ་མ་ནི་༼ང་རྒྱལ་ཆེ་བ་༽སྟོབས་ཀྱིས་དྲེགས། ༼འདི་ཡང་རྡོ་རྗེའི་རིགས་སུ་གསུང་༽ །གང་ཞིག་མིག་སྨན་༼གྱི་མཚམས་༽གནག་འདྲ་ཞིང་། །༼ཁྱད་པར་ནི་༽སོ་ནི་དཀར་ཞིང་མཐོ་བ་༼ སྟོ་ སྲོ་བ་༽དང་། །རྟག་ཏུ་གདུག་པར་༼ཞེ་སྡང་ཡུ་རིང་པ་༽འགྱུར་བ་དང་། །སེམས་སྟོབས་ལྡན་པར་༼འཇིགས་པ་མེད་པར་༽གྱུར་པ་དང་། །རྟག་ཏུ་༼གྲོགས་གཞན་པས་༽ཁྲུས་ལ་དགའ་བ་དང་། །མང་དུ་སྨྲ་བར་མི་བྱེད་ཅིང་། །ཁྱིམ་དུ་རྡོ་རྗེ་༼བྲིས་ནས་དེ་ལ་༽འབྲི་བ་དང་། ༼ རྣམ་སྣང་གི་རིགས་ཡིན་གསུང་༽ །རྟག་ཏུ་དགེ་བས་མཆོད་བྱེད་པ་༼དགེ་བ་དགའ་བ་རྡོ་རྗེའི་རིགས་༽། །རྡོ་རྗེ་ཕག་མོའི་རིགས་བྱུང་པ། །༼འཁོར་ ཐུན་མོང་པ་བུད་མེད་དམ་མཐོང་བའི་འཁོར་༽སྟོང་ཕྲག་༼ཌ་ཀི་ནིའིཁོར་༽བཅྭ་ལྔ་ལྡན་པ་ཡིན། །༼ལས་ཀྱི་རིགས་ཀྱི་མཁའ་འགྲོ་མ་༽སེར་ཞིང་གསེར་གྱི་མདོག་འདྲ་སྣང་། །༼སུ་ཡང་རུང་བ་ལ་༽མིག་མི་༼ཧ་རེ་ལྟ་བ་༽གཡོ་༼བར་བལྟ་༽ཞིང་བ་སྤུ་མང་། །༼རྩེ་༡་པའི་རི་མོ་༽རྡོ་རྗེ་གང་གི་དཔྲལ་བ་འམ། །ལག་པར་༼རྩེ་༡་པའི་རི་མོ་༽ཡང་ནི་སྣང་འགྱུར་བ། །གདུག་པའི་ལས་༼གསོད་པ་༽ལ་ངེས་པར་དགའ། །རྟག་ཏུ་རྒྱལ་སྲིད་༼ཀྱི་ལོངས་སྤྱོད་༽དག་ལ་གནས། །༼ང་རྒྱལ་ཆེ་བ་༽སྙེམས་ཤིང་བདེན་པར་སྨྲ་བ་དང་། །མ་ལ་ཀི་ཡི་དྲི་འབྱུང་ཞིང་། །གང་གི་ཁྱིམ་དུ་རྡོ་རྗེ་ནི། །རྟག་པར་འབྲི་ཞིང་༼དེ་ལ་༽ཆེར་མཆོད་པ། །ཁཎྜ་རོ་ཧའི་རིགས་༼ལས་ཀྱི་རིགས་༽ལས་བྱུང་། ༼ འདི་ཡང་རྡོ་རྗེ་སེམས་དཔའི་རིགས་ཡིན་གསུང་། བསོད་ནམ་ཆེ་བའི་སྒོ་ནས་མིང་བཏགས་པ་ཡིན་གསུང་༽ །རྣལ་འབྱོར་མ་ཡི་དབང་ཕྱུག་མཆོག །གང་ཞིག་རྟག་པར་༼གསོད་པའི་ལས་ལ་དག་ཟེར་བ་ཡང་ཡོད་༽ཤ་ལ་དགའ། །༼ཤ་༽སྐེམ་ཞིང་མིག་སྨན་༼ཁ་དོག་༽ནག་པོའི་མདོག །དཔྲལ་བར་༼རི་མོ་༢་༽མདུང་རྩེ་ལྟ་བུ་ཡོད། །གང་ཞིག་༼གསོད་པ་ལ་༽གདུག་པའི་ལས་ལ་དགའ། །༼འཇིགས་པ་མེད་པ་༽རྟག་ཏུ་དུར་ཁྲོད་དག་ཏུ་འགྲོ། །༼རོ་ལ་སོགས་པ་ལ་ཕྱག་བྱེད་པ་བག་མེད་པས་སོ་ མི་མ་ཡིན་གྱིས་༽འཇིགས་པ་མེད་ཅིང་གཙང་མེད་དེ། །གང་གི་དཔྲལ་བའི་ཐིག་ལེ་༼བྲིས་ནས་དེ་ལ་མཆོད་༽དང་། །༼ཡང་ན་༽ཁྱིམ་དུ་ཐོད་པ་འབྲི་ཞིང་༼དེ་ལ་༽མཆོད། །དཔལ་ལྡན་ཧེ་རུ་ཀ་དེ་ཡི། །མཁའ་འགྲོའི་རིགས་ལས་བྱུང་བ་ཡིན། །སྤྲིན་གྱི་མདོག་༼སྔོ་ནག་༽འདྲའི་བུད་མེད་གང་།༼ འདིར་ཡང་རད་ནའི་རིགས་ཀྱི་ཌ་ཀི་ནི་༽ །སོ་ནི་༼རིང་ཐུང་༽མི་མཉམ་པར་གནས་ཤིང་། །རྟག་ཏུ་གདུག་པའི་ལས་༼གསོད་པ་༽ལ་དགའ། །གཡོན་གྱི་མཆེ་བ་༼ཕྱིར་ནར་གྱིས་བྱུང་བ་༽གཙིགས་པ་དང་། །དེ་ཡི་ཁྱིམ་དུ་དགྲ་སྟ་ནི། །འབྲི་ཞིང་རྟག་ཏུ་མཆོད་བྱེད་པའི། །རྣམ་པར་འདྲེན་པའི་རིགས་༼རྡོ་རྗེ་སེམས་དཔས་བྱིན་གྱིས་རླབས་པའི་རད་ནའོ་༽བྱུང་པའི། །མཁའ་འགྲོ་མར་ནི་ཐེ་ཚོམ་མེད། །མཁའ་འགྲོ་མ་ཡི་ཚོགས་འདི་དག་༼ཕྱིའི་རིགས་རྡོ་རྗེའི་རིགས་ལས་བྱུང་པ་༽། ཤྲཱི་ཧེ་རུ་ཀའི་རིགས་བྱུང་པ། །བསྒྲུབ་པ་པོ་ལ་༼མཆོད་ན་དངོས་གྲུབ་གསོལ་པས་༽ཕན་པའི་ཕྱིར། །གསང་བའི་མཚན་ཉིད་བཤད་པ་༼གཏས་དང་མཚན་ཉིད་མི་འདྲ་བ་སྣཏད་མ་ཡིན་པ་ལ་མི་བཤད་༽ཡིན། །ཧེ་རུ་ཀ་མངོན་པར་བརྗཏད་པ་ཞེས་བྱ་བ་ལས། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་ཁ་དཏག་གི་མཚན་ཉིད་༼མཚན་མ་སཏ་སཏ་དགའ་བའི་ཡུལ་སཏགས་༽དང་། །༼ཐཏད་པ་སཏགས་གཉེར་མ་ལ་སོགས་པའཏ་༽མཚན་མའི་ཆཏ་གའི་ལེའུ་སྟེ་བཅྭ་བརྒྱད་པའོ། །དེ་ནས་གཞན་ཡང་བཤད་བྱ་བ།༼འདི་ཡང་ཙུམ་བི་ཀས་བསྡུས་པའི་མཚན་ཉིད། དབྱེ་བ་རིགས་ལྔར་དབྱེ་བ་བསྟན༽ །༼འདས་པའི་༽བསྒྲུབ་པ་པོ་ཡིས་ལཱ་མ་ཡི་༼ལས་ཀྱི་རིགས་ཀྱི་༽། །མཚན་ཉིད་ཀྱི་ནི་ཁྱད་པར་༼ནང་ཚན་གྱིས་ལྔར་དབྱེ་བ་༽དང་། །ཡན་ལག་༼དབྱེ་བ་༽ཚོགས་ནི་༼སྔར་༽ཤེས་བྱའོ། །༼བུད་མེད་༽གང་གི་གཞིན་གྱི་དཀྱིལ་འཁོར་ནི། །ཀུན་ནས་ཟླུམ་པོར་སྣང་གྱུར་ཞིང་། །ཁ་ཡི་སྨ་ར་༼སྐྱེས་པ་༤ན་༽རྟག་པར་ཡོད། །༼བ་༽སྤུ་དང་སྨིན་མ་རིང་བ་དང་། །གོས་བཟང་༼པོ་དང་༽གཙང་༼པ་ལ་དགའ་༽ཞིང་༼སྒྱུར་༽ཞི་བ་དང་། །༼སྤྱོད་པ་༽མི་གཡོ་བདེན་པར་སྨྲ་བ་དང་། །རྟག་ཏུ་དམ་པའི་ཆོས་ལ་དགའ། ༼ འདི་རང་ནའི་ལ་མ་གསུང་༽ །དཔའ་བོའི་སྲིང་མོར་དེ་ཤེས་བྱ། །པད་མའི་༼སྐོར་༽ཕྱག་རྒྱ་༼ལག་པ་༢་སྙིམ་པ་ཕྱེ་བར་བྱ་སྟེ་འཇུག་མ་ཅུང་བཀུག་པའོ་༽སྦྱིན་པར་བྱ། །ཡང་ན་༼གཡས་པས་གུང་མོ་ཅུང་ཟད་བརྐྱང་སྟེ་ལྷག་མ་ཁུ་ཚུར་བྱས་པ་༽རུས་སྦལ་ཕྱག་རྒྱ་བྱ་༼གཡོན་པའི་སྟེང་དུ་གཡས་པ་གཞག་ཏེ་༢་ཀའི་སོར་མོ་ཀུམ་མེ་བྱ་བར་གསུང་༽། །༼སྤགས་པ་ཟེར་༽རྒྱལ་བའི་༼གཡོན་ཆོས་གོས་གྱོན་པའི་ཚུལ་དུ་བྱ་༽བུམ་པ་སྤྱི་བླུགས་ཉིད། །ཕྱག་རྒྱའི་༼བུམ་པ་ཐོགས་པའི་ཚུལ་དུ་བྱ་༽ལན་དུ་ཤེས་པར་བྱ། །དེ་ནི་ཚེས་བཅུའི་རེས་དག་ལ། །ཁྱིམ་དུ་པད་མ་འབྲི་བར་འགྱུར་༼བྲིས་ནས་དེ་ལ་མཆོད་༽། །ལཱ་མ་ཡི་ནི་བུད་མེད་ཀྱི། །མཚན་ཉིད་གྱུར་པ་འདི་ཉིད་ཡིན། །མཆུ་ནི་འཕྱང་ཞིང་༼འདི་པད་མའི་ལ་མ་༽མིག་དཀྱུས་རིང་། །མིག་ནི་དམར་ཞིང་སེར་སྐྱར་གནས། །༼ནོར་༽ཕྱུག་ཅིང་༼ཁྱོ་༽བསྐལ་བཟང་༼བུ་ཡོད་པ་༽དཔལ་ཡོན་ཅན། །སེར་ཞིང་ཙམ་པ་༼དྲི་ཞིམ་པ་༽ལྟ་བུར་སྣང་། །མཆེ་བ་རིང་མིན་ཐུང་བ་མིན། །༼ཁ་དོག་༽སྣ་ཚོགས་པ་ཡི་གོས་ལ་དགའ། །༼དར་དཔྱངས་ལྟ་བུ་༽དཔྲལ་བར་རི་མོ་༼འགྲོང་བུ་༣་གསུང་༽གསུམ་ཡོད་ཅིང་། །མཚམས་ནི་གྱེན་དུ་༼དཔྲལ་བའི་རི་མོ་གྱེན་ལ་བལྟ་བ་གསུང་༽བལྟས་པས་གནས། །རྒོད་ཅིང་དགའ་བ་ཉིད་དག་དང་། །༼སྐྱེས་བུ་ལམ་དུ་འགྲོ་བའི་ལམ་འགྱོགས་པ་༽ལམ་ནི་རྣམ་པར་གནོན་ཅིང་གནས། །གཡུལ་དུ་འཆི་བ་རྣམས་ཀྱི་ནི། །གཏམ་དག་ལ་ནི་༼ཇི་ལྟར་འཐབ་པ་ཇི་ལྟར་གསད་པ་ལ་སོགས་པའི་གཏམ་ལ་དགའ་བ་༽རྟག་ཏུ་དགའ། །དེ་ལྟར་༼ང་རྒྱལ་ཆེ་བ་༽རབ་དྲེགས་མཐོང་ནས་ནི། །མདུང་གི་ཕྱག་རྒྱ་༼གཡས་པའི་འཛུབ་མོ་མདུང་ལྟར་བྱས་པ་ལ་གསུང་ན་ཡང་གཡོན་པ་ལ་ཡང་གསུང་༽བསྟན་པར་བྱ། །རྐང་པ་གཡོན་པ་བསྐུམ་པ་ཡི། །༼གཡས་བརྐྱང་པས་༽གར་ཉིད་ཀྱང་ནི་༼ ཕང་༽བསྟན་པར་གྱི། །༼བསྒྲུབ་པ་པོས་༽གཡོན་པ་དག་ནི་༼གཡོན་བརྐྱང་གཡས་བསྐུམ་ནས་༽ཡོངས་བཟློག་པ། །ཕྱག་རྒྱའི་ལན་ནི་ཡིན་པར་བཤད། །བཅུ་བཞི་དང་ནི་ཚེས་བརྒྱད་༼ཡར་མར་༢་ཀའི་༽ནི། །དེ་ཡི་དུས་ཚིགས་༼ལ་མཆོད་པ་༽ཡིན་པར་བཤད། །༼དུས་དེར་༽ཁྱིམ་དུ་མདུང་རྩེ་གསུམ་པ་ཡང་། །བྲིས་ནས་དེ་ནི་རྟག་ཏུ་མཆོད། །༼སྣང་བ་མཐའ་ཡས་ཀྱི་༽འཇིག་རྟེན་དབང་ཕྱུག་ལཱ་མ་ཡི། །མཚན་ཉིད་གྱུར་པ་འདི་དག་ཡིན། །༼འདི་ཏ་ཐཱའི་རིགས་ཀྱི་ལ་མ་༽གང་གི་ཁུར་ཚོས་དག་ཏུ་ནི། །ཁུང་བུར་གྱུར་པ་༼ཅུང་ཟད་སྐྱོང་པ་༽གནས་གྱུར་ཅིང་། །དེ་བཞིན་རྟག་ཏུ་དམར་ཞིང་སེར། །མིག་ནི་ལྗང་སེར་དག་ཏུ་སྣང་། །སྐྲ་ནི་དེ་བཞིན་འཁྱིལ་བ་དང་། །མགོ་དང་དཔྲལ་བར་༼རང་རྟག་དུ་༽དར་བཅིངས་སྣང་། །༼དཔྲལ་བར་གྱེན་ལ་༽རི་མོ་གཅིག་པར་རབ་ཏུ་གནས། །དེ་བཞིན་མགྲིན་པ་རིང་བ་དང་། །རྟག་ཏུ་གོས་དམར་ལ་དགའ་ཞིང་། །རྒོད་ཅིང་གླུ་ནི་ལེན་པ་ཉིད། །ལན་འགའ་ཞིག་ན་༼བར་བར་དུ་༽ཁྲོ་བ་དང་། །༼ཆགས་པ་སྐྱེས་པའི་སྟོབས་ཀྱིས་༽སེམས་ནི་རྣམ་པར་གཡོ་བ་དང་། ༼རེས་གང་ལ་དགའ་རེས་གང་ལ་དགའ་བ་དང་༽ །རྒོད་པ་ལ་ནི་དགའ་བ་སྟེ། །༼ང་རྒྱལ་ཆེ་བ་༽འདི་འདྲའི་རབ་དྲེགས་༼གོས་ཡོ་བར་གོན་པ་༽མཐོང་ན་ནི། ༼ལག་པ་༢་མདུང་འཛིན་པའི་ཚུལ་དུ་བྱ་གསུང་། ཡང་ན་གཡས་པའི་འཛུབ་མོ་མདུང་ལྟར་དུ་བྱ་གསུང་༽ །མདུང་གི་ཕྱག་རྒྱ་བསྟན་པར་བྱ། །༼ལན་༽གཉིས་པ་ཉིད་ནི་འབད་པ་ཡིས། །༼ལག་པ་༢་ཀྱི་སོར་མོ་རྣམས་མཐུར་ལ་དཔྱངས་ཏེ་སྨད་ཆེ་བའི་ཚུལ་དུ་བྱས་ལ་གསུང་༽དྲིལ་བུའི་ཕྱག་རྒྱ་རབ་བསྟན་བྱ། །གཡོན་གྱི་ཕྱོགས་སུ་ལྡོག་པ་ནི་༼ལན་བྱེད་ཙ་ན་༽། །ཕྱག་རྒྱའི་ལན་ནི་ཡིན་པར་བཤད།༼ མི་མི་བསྐྱོད་པའི་ལ་མ་༽ །ཐུང་ཞིང་བྱིན་པ་སྦོམ་པ་དང་། །རྟག་ཏུ་གོས་སེར་ལ་དགའ་ཞིང་། །ཕྲག་པ་དག་ལ་༼གོས་ཡོ་བར་གོན་པ་༽གོས་ཀྱང་འཕྱང་། །དེ་འདྲའི་བུད་མེད་མཐོང་ན་ནི། །༼ལག་པ་༢་རྒྱབ་སྤྲད་དེ་སོར་མོ་བསྣོལ་བའམ་ཡང་ན་སོར་མོ་རྣམས་ཀྱི་རྩེ་མོ་སྦྱར་བར་དུ་ན་༽འཁོར་ལོའི་ཕྱག་རྒྱ་བསྟན་བྱ་ཞིང་། །འབད་པ་ཡིས་ནི་གཉིས་པ་ཡང་།༼ཐལ་མོ་སྦྱར་བའི་འཛུབ་མོ་༢་བཀུག་པ་ལ་མཐེ་བོང་གཉིས་སྦྱར་བ་ཡང་གསུང་༽ །དུང་གི་ཕྱག་རྒྱ་༼གཡས་པའི་གུང་འཛུབ་གཉིས་བརྐྱང་སྟེ་མཐེ་བོས་སྲིན་ལག་དང་མཐེ་ཆུང་མནན་ཏེ་གནམ་ལ་བསྟན་ནས་དུང་ཆོས་ལྟར་བྱས་པ་༽བསྟན་པར་བྱ། །གཡོན་ནས་ཡོངས་སུ་བཟློག་པ་ནི། །ཕྱག་རྒྱའི་ལན་ནི་ཡིན་པར་བཤད། །བཅུ་བཞི་༼ཡར་མར་གཉིས་ཀའི་༽དེ་ཡི་དུས་ཡིན་ཏེ། །དེ་ཡི་ཁྱིམ་དུ་རྡོ་རྗེ་འབྲི་༼ས་ནས་མཆོད་པ་༽། །ཤྲཱི་ཧེ་རུ་ཀ་ལཱ་མ་ཡི། །མཚན་ཉིད་གྱུར་པ་འདི་དག་ཡིན། ༼ལས་ཀྱི་རིགས་ལ་མ་༽ །ལུས་ཀུན་ལ་ནི་བ་སྤུ་ཡོད། །མིག་ནི་གནག་ཅིང་སེར་བ་དང་། །༼ལུས་༽སྤོམ་ཞིང་༼བཞིན་༽རྣམ་འགྱུར་མི་ཟད་པ། །གཞིན་འཕེལ་ཆེ་༼རྒྱས་༽ཞིང་ཁ་ཆེ་ལ། །མཆུ་ནི་སློ་ཞིང་ཁ་དོག་གནག །མིག་ཟླུམ་སྣ་ནི་ཉམས་པ་དང་། །རྟག་ཏུ་གླུ་ལ་མཁས་པ་དང་། །སྤྲིན་གྱི་མདོག་ཅན་ཡིད་འཕྲོག་མ། །འདི་འདྲའི་༼ང་རྒྱལ་ཆེ་བ་༽རབ་དྲེགས་མཐོང་ན་ནི། །༼ལག་པ་གཡས་པའི་སོར་མོ་རྣམས་སྦྲུལ་མགོ་གདེངས་ཀ་ལྟར་བྱས་ལ་མཐེ་བོང་ལག་མཐིལ་དུ་མགོ་བོ་ལྟར་བྱས་ལ་༽ཀླུ་ཡི་ཕྱག་རྒྱ་རབ་བསྟན་བྱ། །གཉིས་པ་ཡང་ནི་འབད་པ་ཡི། །༼མདུང་འཛིན་པ་ལྟར་༽མདུང་གི་ཕྱག་རྒྱ་བསྟན་པར་བྱ། །གཡོན་ནས་ཡོངས་སུ་བཟློག་པ་ནི། །ཕྱག་རྒྱའི་ལན་ནི་ཡིན་པར་བཤད། །༼ཡར་མར་༢་ཀྱི་༽ཚེས་གྲངས་བཅུ་གཅིག་དེ་ཡི་དུས། །ཁྱིམ་དུ་མཆེ་བ་༼བྲིས་ནས་མཆོད་པ་བྱེད་༽འབྲི་བར་བྱེད། །རྡོ་རྗེ་ཕག་མོ་ལཱ་མ་ཡི། །མཚན་ཉིད་གྱུར་པ་འདི་དག་ཡིན། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼ལ་མས་བསྡུས་པའི་༽རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་༼སོ་སོའི་མཚན་ཉིད་ཤེས་ནས་༽ཕྱག་རྒྱ་དང་། ཕྱག་རྒྱའི་ལན་བསྟན་པའི་ལེའུ་སྟེ་བཅུ་དགུ་པའོ། །༼དེ་ལྟ་བུའི་རྣམས་ངོ་ཤེས་པར་བྱས་ནས་དེ་ནས་བརྡ་དང་བརྡའི་ལན་བྱས་པས་དཔའ་བོ་དེ་སྲིང་མོར་ཤེས་པར་བྱའོ།དེ་ལྟར་བྱས་པས་མཉེས་ལ་མཉེས་པས་བྱིན་གྱིས་བརློབ་པར་འགྱུར་རོ་༽དེ་ནས་༼དེ་བས་ན་འདིས་ལག་པའི་བརྡའ་གཙོ་བོར་བྱས་ནས་སྟོན་ནོ༽གཞན་ཡང་བཤད་བྱ་བ་༼ལེའུ་བཅོ་ལྔ་པའི་༽། །༼འདི་གོང་གི་ཡི་གེའི་བརྡའ་དང་འབྲེལ་གསུང་༽མཁའ་འགྲོའི་ལག་པའི་བརྡ་རྣམས་ཏེ། །༼བརྡའི་དགོས་པ་༽གང་གི་སྤུན་དང་༼དཔའ་བོས་ཤེས་ན་༽སྲིང་མོ༼ས་ཤེས་ན་༽རུ། །ཡང་དག་ཤེས་པར་འགྱུར་བའོ། །༼སྔར་མཁའ་འགྲོ་མར་ངོ་ཤེས་ཀྱང་སྲིང་མོར་ངོ་མ་ཤེས།ཡང་སྲིང་མོར་ཤེས་པར་བྱས་ལ་དེ་བསྟེན་པ་ལ་བརྡའ་དགོས་པས་བརྡའ་བསྟན་བརྡ་དང་བརྡའི་ལན་༽གང་ཞིག་༼སྐྱེས་པའམ་བུད་མེད་ཀྱི་༽ལག་གཡོན་༼སྐྱབས་སྦྱིན་ལྟར་༽སྟོན་པ་ནི། །༼དང་པོ་སྐུ་འཁམས་འདྲི་བ་༽གསོང་པོར་སྨྲ་བ་བསྟེན་པ་ཡིན་༼ནོ་བར་༽། །གང་ཞིག་སྲིན་ལག་སྟོན་པ་ནི། །གསོང་པོར་སྨྲ་བའི་ལན་གྱུར་ཡིན་༼དེ་ལྟར་ཡིན་ནོ་བར་༽། །གང་ཞིག་ལྟོ་བ་༼མ་རེག་པ་༽རྡེབས་པ་ནི། །བདག་ནི་བཀྲེས་པར་༼ལ་རེག་པ་༽སྟོན་པ་ཡིན། །གང་ཞིག་དཔྲལ་བ་སྟོན་པ་ནི། །༼རྫུ་འཕྲུལ་གྱི་མཐུའི་ནུས་པའམ་སྤྱོད་པས་ནམ་མཁའ་ལས་འོང་བའོ་༽ནམ་མཁའ་ལ་ནི་འོངས་༼སོ་༽ཞེས་པའོ། །གང་ཞིག་ཁར་ནི་སོར་མོ་༼བཅུ་ཀ་༽འཇུག །༼ཚོགས་ཀྱི་ཟས་༽ཟོས་ཟིན་ཞེས་ནི་སྨྲ་བ་ཡིན། །གང་ཞིག་ལྕེ་ནི་༼རི་ལི་ལི་༽བསྐྱོད་པ་དག །ཟའོ་ཞེས་ནི་སྨྲ་བ་ཡིན། །གང་ཞིག་སྤུས་མོ་ལ་༼གཡོན་པས་༽རེག་པ། །ངལ་ལོ་ཞེས་ནི་སྟོན་པ་ཡིན། །གང་ཞིག་སོར་མོ་༼ལག་པ་གཅིག་གི་འཛུབ་མོས་༡་ལ་༽རྩེ་ལ་རེག །ངལ་བསོས་ཞེས་ནི་སྨྲ་བ་ཡིན། །གང་ཞིག་སོ་ནི་འཆའ་བྱེད་པ། །ཤ་ཟའ་ཞེས་ནི་སྨྲ་བ་ཡིན། ༼ཚིག་གཉིས་པོ་འདི་འབའ་ཏན་ཏའི་རྒྱ་དཔེ་ལས་འབྱུང་གཞན་ལ་མེད་གསུང་༽ །གང་ཞིག་པ་ཏི་ས་སྟོན་པ་༼ཐོད་པ་འཆིང་བའི་ཚུལ་༽། །དེ་ལྟར་གྱིས་ཞེས་༼གང་བྱེད་པ་དེ་ལ་༽སྟོན་པ་ཡིན། །གང་ཞིག་༼བཞིན་༽ཁྲོ་གཉེར་སྟོན་པ་ནི། །༼ཡན་ལག་༽བཅིངས་སོ་ཞེས་ནི་སྟོན་པ་ཡིན་༼ཁྱོད་ཡོད་དོ་བར་སྟོན་པ་ཡོད་༽། །གང་ཞིག་མཁའ་ལྡིང་༼ལག་པ་གཤོག་པ་ལྟར་དེང་ངེ་བྱ་གསུང་༽སྟོན་པ་ནི། །༼ཡན་ལག་བཅིངས་པ་ལས་སླར་༽གྲོལ་ལེ་ཞེས་ནི་སྟོན་པ་ཡིན་༼ཁྱོད་མེད་དོ་བར་སྟོན་པ་གསུང་༽། །གང་ཞིག་ཁུ་ཚུར་སྟོན་པ་ནི་༼དེ་དག་ནི་དོན་གོ་བར་བྱ་བ་ཙམ་མོ། འདི་ན་མར་ནི་བརྡ་དང་བརྡའི་ལན་དང་བཅས་པ་འགའ་ཞིག་སྟོན༽། །དེ་ལ་པ་ཏི་ས་༼ཐོད་༽བསྟན་བྱ། །གང་ཞིག་སྐྲ་ནི་༼འཕྱར་བའམ་འཛིན་པའི་ཚུལ་དུ་༽སྟོན་པ་ལ། །ཁ་ཊཾ་ཀ་ནི་༼འཛུབ་མོ་རྩེ་གསུམ་དུ་བསྟན་༽དེ་ལ་བསྟན། །གང་ཞིག་ཡན་ལག་བསྐྱོད་པ་དག །དེ་ལ་མཆེ་བ་༼ལག་པ་གཉིས་ཁུ་ཚུར་བཅངས་ལ་མཐེ་ཆུང་གཉིས་མཆེ་བའི་ཚུལ་དུ་ཁའི་ཐད་ཀར་གཟུང་༽བསྟན་པར་བྱ། །གང་ཞིག་ལག་པས་ལག་པ་༼གཅིག་ལ་༡་༽རྡེབས། །གཏོར་མ་ཟ་ཞེས་སྨྲ་བ་ཡིན། །གང་ཞིག་ལག་པ་གཡས་པ་སྟོན། །དེ་ལྟར་གྱིས་ཞེས་སྨྲ་བ་ཡིན། །གང་ཞིག་རྣ་བ་ལ་རེག་པ། །གནས་པར་བྱ་ཞེས་༼གང་ཡང་རུང་པ་དེར་དེ་ལྟར་༽སྟོན་པ་ཡིན། །གང་ཞིག་སེན་མོས་སེན་མོ་རེག་༼ལག་པ་གཡས་གཡོན་གྱི་སེན་མོ་༢་གཅིག་ལ་༡་འདར་བ༽། །ཤི་བར་ངེས་ཤེས་སྨྲ་བ་ཡིན། །མཐེ་བོང་གཡོན་བས་ས་༼ལ་རི་མོ་ཟླུམ་པོ་༽འབྲི་བ། །དཀྱིལ་འཁོར་༼མཆོག་བསྒྲུབ་ན་འགྲུབ་༽འདི་རུ་འཚོག་ཅེས་སྨྲ། །གང་ཞིག་ཀོ་སྐོ་ལ་རེག་པ། །བདག་ནི་བུ་༼ཆེ་འོ་བ་༽ཡིས་སྲུངས་ཞེས་སྨྲ། །༼གང་རུང་༽གང་ཞིག་འཐེབ་༼བོ་༽གཡོན་༼པས་༽ས་ལ་༼རི་མོ་༽འབྲི། །བླ་མའི་སྐྱེ་བོས་སྲུངས་ཞེས་༼བདག་ལ་ཁྱོད་ཞེས་པ་༽བཤད། །གང་ཞིག་མིག་ནི་༼ཡང་རྩུམ་ཡང་འབྱེད་༽ཕྱེ་བ་ནི། །དེ་ལྟར་བྱ་ཞེས་༼བསྲུང་གིས་༽སྟོན་པ་ཡིན། །གང་ཞིག་༼ཡན་ལག་གི་༽ཚིགས་ལ་རེག་པ་ནི། །༼གཉིས་འདུས་ལ་༽བདེ་བར་ཉལ་ཞེས་སྨྲ་བ་ཡིན། །ཕོ་ཉ་མོ་ནི་༼དངོས་གྲུབ་བསྒྲུབ་པ་ལ་ཉེ་བས་༽གང་ཡང་རུང་། །དེ་དག་ཀུན་གྱི་༼བརྡ་དང་བརྡའི་ལན་༽ཡང་དག་སྦྱད། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས། རྣལ་འབྱོར་མ་ཐམས་ཅད་ཀྱི་ལག་པའི་ཕྱག་རྒྱའི་བརྡའི་ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་པའོ་༼མ་རྒྱུད་ཀྱི་དེའི་ཤུགས་ལ་རྡོར་རྒྱུད་ཀྱི་ཡང་བསྟན༽། །དེ་ནས་༼དེར་བསྟན་པའི་ལག་པའི་བརྡའ་དེ་གཞན་ལ་སྟོན་པ་གཙོར་བྱ་ནས་ལེའུ་འདིས་བསྟན་༽ཡན་ལག་ཕྱག་རྒྱ་ཡི། །༼གཞན་ལ་ཕྱག་རྒྱ་༽བསྟན་པའི་མཚན་ཉིད་ངས་བཤད་བྱ། །བུད་༼བུད་མེད་༽གང་སྤྱི་གཙུག་རེག་བྱེད་པ། །༼རང་གི་༽མགོ་བོ་དེ་ལ་བསྟན་པར་བྱ། །གང་ཞིག་དཔྲལ་བ་སྟོན་པ་ནི། །དེ་ལ་ཁུ་ཚུར་བསྟན་པར་བྱ། །གང་ཞིག་སོ་ནི་སྟོན་པ་ལ། །དེ་ལ་ལྕེ་ནི་བསྟན་པར་བྱ། །གང་ཞིག་མཆུ་ནི་སྟོན་བྱེད་པ། །དེ་ལ་ཀོསྐོ་བསྟན་པར་བྱ། །གང་ཞིག་མགྲིན་པ་སྟོན་བྱེད་པ། །དེ་ལ་ལྟོ་བ་བསྟན་པར་བྱ། །གང་ཞིག་ལག་པ་སྟོན་བྱེད་པ། །དེ་ལ་༼སྐྱེས་པའམ་བུད་མེད་ཀྱི་༽དཔུང་པ་༼གཡོན་པ་༽བསྟན་པར་བྱ། །གང་ཞིག་རྐེད་པ་སྟོན་བྱེད་པ། །དེ་ལ་རྒྱབ་ནི་བསྟན་པར་བྱ། །གང་ཞིག་ནུ་མ་སྟོན་བྱེད་པ། །དེ་ལ་ཀོསྐོ་བསྟན་པར་བྱ། །གང་ཞིག་ལྟོ་བ་སྟོན་བྱེད་པ། །དེ་ལ་ལྟེ་བ་བསྟན་པར་བྱ། །གང་ཞིག་གསང་བ་སྟོན་བྱེད་པ། །དེ་ལ་ལིང་ཀ་བསྟན་པར་བྱ། །གང་ཞིག་བརླ་ནི་སྟོན་བྱེད་པ། །དེ་ལ་མགོ་ནི་༼གཤང་ལམ་ཡང་ཟེར་༽བསྟན་པར་བྱ། །གང་ཞིག་སྤུས་མོ་སྟོན་བྱེད་པ། །དེ་ལ་བྱིན་པ་བསྟན་པར་བྱ། །གང་ཞིག་རྐང་པ་སྟོན་བྱེད་པ། །དེ་ལ་རྐང་མཐིལ་བསྟན་པར་བྱ། །གང་ཞིག་སོར་ཚིགས་སྟོན་བྱེད་པ། །དེ་ལ་སོར་མོ་བསྟན་པར་བྱ། །གང་ཞིག་ས་༼གཞི་༽ནི་སྟོན་བྱེད་པ། །དེ་ལ་ནམ་མཁའ་བསྟན་པར་བྱ། །གང་ཞིག་ནམ་མཁའ་སྟོན་བྱེད་པ། །དེ་ལ་ཉི་མ་བསྟན་པར་བྱ་༼ནམ་མཁའ་ལ་རི་མོ་ཟླུམ་པོར་འདྲི་བ་༽། །གང་ཞིག་ཆུ་བོ་༼ལག་པ་༢་ཆུ་བོ་ལྟར་ན་ར་རར་༽སྟོན་བྱེད་པ། །དེ་ལ་རྒྱ་མཚོ་༼ལག་པ་༢་མདུན་དུ་རླབས་བསྐྱེད་པ་ལྟར་བྱ་༽བསྟན་པར་བྱ། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་ཕྱག་རྒྱའི་མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་གཅིག་པའོ། ། ༼ལག་བརྡ་འབའ་ཞིག་དུ་མ་ཟད་འདིས་ཡན་ལག་དུ་མའི་བརྡའ་གཙོ་བོར་བྱས་ནས་བསྟན༽ །དེ་ནས་གཞན་ཡང་རབ་བཤད་པ། །ཡན་ལག་ཇི་བཞིན་ཕྱག་རྒྱ་མཆོག །གང་ཞིག་༼སྐྱེས་པས་དཔུན་དང་སྲིང་མོར་བུད་མེད་ཀྱིས་དཔུན་དང་མིང་པོར་ཤེས་པས་༽ཤེས་པས་སྤུན་ནམ་ནི། །སྲིང་མོར་ཐེ་ཚོམ་མེད་པར་འགྱུར། །༼སྐྱེས་པའམ་བུད་མེད་ཀྱིས་༽སོར་མོ་༼ གཡོན་པ་༽གཅིག་ནི་སྟོན་པ་ཡིས། །ལེགས་པར་འོངས་ཞེས་སྨྲ་བ་ཡིན། །སོར་མོ་གཉིས་ནི་བསྟན་པ་ཡིས། །ལེགས་འོངས་ལན་ནི་སྨྲ་བ་ཡིན། །འདིར་ནི་རྣལ་འབྱོར་མ་ཀུན་གྱི། །ཡན་ལག་ཕྱག་རྒྱར་རབ་ཏུ་བཤད། །༼སྐྱེས་པས་གཡས་བུད་མེད་ཀྱིས་གཡོན་གྱི་༽འཐེབ་འཛུབ་གཉིས་བཀུག་༼སྟེ་༽མིག་གི་རྒྱ་༼ལྟར་བྱས་ལ༽། །སྔགས་པར་གང་ལ་དེ་བསྟན་པ། །དེ་མོད་༼ལ་༽ཇི་སྲིད་འཚོ་བའི་བར། །དབང་༼པོ་༽འགྱུར་༼ཞིང་༽གསང་བར་༼གདམས་པ་༽ཐེ་ཚོམ་མེད། །གང་ཞིག་གུང་མོ་སྟོན་བྱེད་པ། །དེ་ལ་འཛུབ་མོ་བསྟན་པར་བྱ། །གང་ཞིག་སྲིན་ལག་སྟོན་བྱེད་པ། །དེ་ལ་ལྕེ་ནི་བསྟན་པར་བྱ། །གང་ཞིག་པ་ཏི་ས་༼ཐོད་པ་༽སྟོན་པ། །དེ་ལ་མདུང་ནི་༼འཕོངས་སུ་༽བསྟན་པར་བྱ། །གང་ཞིག་སྤྱི་བོ་སྟོན་བྱེད་པ། །དེ་ལ་༼སྐྲ་མཚམས་༽འཚམས་ཀྱི་མཐའ་བསྟན་བྱ། །གང་ཞིག་ས་ནི་སྟོན་བྱེད་པ། །དེ་ལ་ཁ་ནི་བསྟན་པར་བྱ། །གང་ཞིག་ཁྲོ་གཉེར་སྟོན་བྱེད་པ། །དེ་ལ་འཚམས་ནི་བསྟན་པར་བྱ། །གང་ཞིག་༼སོ་སོའི་སྐྱེ་བོ་དང་ཉན་ཐོས་༽སོ་ནི་སྟོན་བྱེད་པ། །དེ་ལ་མཆུ་ནི་བསྟན་པར་བྱ། །གང་ཞིག་མགྲིན་པ་སྟོན་བྱེད་པ། །དེ་ལ་ཁ་ནི་བསྟན་པར་བྱ། །གང་ཞིག་དཔྲལ་བ་སྟོན་བྱེད་པ། །དེ་ལ་བལྟ་བ་བསྟན་པར་བྱ། །འདི་ནི་རྣལ་འབྱོར་མ་ཀུན་གྱི། །རིམ་བཞིན་ཡན་ལག་༼དུ་མ་༽ཕྱག་རྒྱ་ཡིན། །༼དཔའ་བོ་དང་རྣལ་འབྱོར་མའི་རྟགས་སུ་༽འདི་དག་རྟགས་བསྟན་༼གཞན་ལ་༽གསང་བ་ལ། །༼དཔའ་བོ་དང་རྣལ་འབྱོར་མར་ངོ་ཤེས་པར་༽ཡང་དག་ལྟ་བ་༼འགྱུར་ཟེར་༽འགྲོ་བ་ཡིན། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་ཁྱད་པར་གྱི་༼ཡན་ལག་དུ་མ་༽མཚན་ཉིད་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་གཉིས་པའོ། །༼དེ་ལྟར་བསྟན་པས་རྣལ་འབྱོར་མས་ངོ་ཤེས་དང་རྣལ་འབྱོར་མ་དང་ཆགས་པར་བྱས་ནས་མ་མཆོད་ན་བྱིན་གྱིས་མི་རློབས་པས་ཆགས་པར་བྱ་བ་དང་ཆགས་པར་བྱ་བའི་རྟགས་བརྡ་བསྟན་བསྒྲུབ་པ་པོ་བདག་ལ་ཆགས་པའི་༽ །དེ་ནས་༼ཆགས་པར་བྱ་བའི་བརྡ་༽གཞན་ཡང་བཤད་བྱ་བ། །༼༡་ལ་གཅིག་ཆགས་པའི་༽མཁའ་འགྲོ་མ་ཡི་རྣམ་༼པར་༽རོལ་༼པ་༽ནི། །༼ཛོ་ཀ་༽གང་གིས་རིང་ནས་༼མཐོང་པ་ནས་༽དཔའ་བོ་ཡི། །དཔའ་བོས་སྲིང་མོར་ཤེས་འགྱུར་༼རྣལ་འབྱོར་མས་མིང་པོར་ངོ་ཤེས་༽བའོ། །དམ་ཚིག་ཅན་གང་༼ལ་༽རྗེས་༼སུ་༽ཆགས་པ། །༼ སུ་ཀའི་སྤྱད་ཅིང་བརྟེན་༽དཔའ་བོའི་ལོངས་སྤྱོད་ས་གཞི་༼ཡིན་ཟེར་༽བཞིན། །གཞིར་ནི་ས་གཞི་བྱས་ནས་ནི། །རྣལ་འབྱོར་པ་ཡི་༼དབང་བསྐུར་ཐོབ་ལ་དམ་ཚིག་མ་ཉམས་པ་༽སྡོམ་པ་མཆོད། །༼ཆགས་པ་སྐྱེས་པའི་སྟོབས་ཀྱིས་ལྟ་སྙིང་འདོད་པ་ལ་བལྟ་མི་ཕོད་པ་༽གོ་བཟློག་པ་ཡིས་༼ཆགས་པའི་རྟགས་དངོས་བལྟ་བ་༽ལྟ་བ་༼ཟུར་མིག་༽ནི། །༼བརྟན་ཐབས་འདི་རྣམས་ཐབས་ཀྱིས་རྣལ་འབྱོར་མ་ལ་བརྟགས་པ་གཙོ་བོར་བྱས་པ་གསུང་༽གཞིན་ནི་རྣམ་པར་འགྱུར་བ་༼ སྐར་མ་ལ་སོགས་པ་ལས་དམར་བ་༽ཉིད། །རྟག་ཏུ་བདེ་བས་༼ཆགས་པས་༽སྨིན་མ་གཡོ་༼རེ་མོས་འདོགས་པ་༽། །༼སྤྱོད་པ་༽སྣ་ཚོགས་མྱུར་དུ་༼སོ་དང་སེན་མོ་དང་འཁྱུད་པ་ལ་སོགས་པ་༽ཤེས་བྱ་བ། །དེ་བཞིན་མཁའ་འགྲོ་༼མ་༽ལས་བྱུང་བའི། །རྣམ་འགྱུར་བསྐོར་བ་ཤེས་བྱ་སྟེ། །རི་མོ་གསུམ་པོ་༼ལྟེ་བའི་སྟེང་དུ་ཟླ་གམ་ལྟ་བུ་ཡོད་པ་༽ཡོངས་སུ་ཟླུམ། །མཁའ་འགྲོ་མ་རྣམས་༼སུ་༽ངེས་༼པར་ཤེས་པར་བྱ་གསུང་༽འགྲོ་བའི། །༼དེ་ལ་བརྟེན་པ་བདེ་བའི་ཡེ་ཤེས་ཤེས་པར་བྱ་གསུང་༽དེ་ཡི་མཚན་མ་ཤེས་པར་བྱ། །གློ་བུར་དུ་ནི་༼ཆགས་པ་སྐྱེས་པས་གཟུགས་དང་བཞིན་འགྱུར་བ་༽་ལྡོག་འགྱུར་བ། །༼ཚིག་སྔ་མ་ལས་ཕྱི་མ་འགྱུར་ཞིང་སྨྲ་བས་སུ་༽སྔར་བཤད་ཚིག་ནི་ཉམས་པ་ཉིད། །དེ་ཡི་གདོང་ནི་འཇིག་འགྱུར་བ། །རྡོ་རྗེ་ལྟ་བུར་༼རྟོགས་པས་མི་ཕྱེད་པས་༽གསལ་བ་ཡིན། །སྒྲ་ནི་ཁུ་བྱུག་སྐད་༼རང་བྱུང་གི་ཆགས་པའི་སྒྲ་ཧ་ཧ་ཅེས་པ་ལ་སོགས་པའོ་༽ལྟ་བུ། །གསོལ་བར་དེ་ནི་རྟག་ཏུ་འགྱུར་༼དེ་དག་ཕོ་ཉའི་ལམ་པའི་དབང་དུ་བྱས་༽། །༼དེ་ལྟར་དང་པོར་མཚོན་ནས་ཕྱིས་ཕྲ་མོ་དང་ཐིག་ལེ་ལ་བརྟེན་ནས་བདེ་བ་མྱོང་བར་བྱེད་པ་སྟེ་དེ་ལས་པོར་རེག་བྱ་བདེ་བ་བསྐྱེད་དེ་གོམས་པ་ལ་ཆོས་སྐུ་་་་་་་་༽འདི་ཡི་མཚན་མ་ཁྱིམ་དུ་ནི། །༼དེ་ལ་བརྟེན་ནས་དཔེའི་ཡེ་ཤེས་བདེ་ལ་མི་རྟོག་པ་ཉམས་སུ་མྱོང་རྣལ་འབྱོར་གྱི་ལམ་བསྟན། ཉི་མའི་བར་དུ་མི་བསྐྱོད་པ་ལ་རྡོ་རྗེ་བསྒོམ། དེ་ལ་དམིགས་ཏེ་བདེ་བ་བསྒོམ་དེས་འགྲེ་༼༼  མཚན་མཉི་མ་ཁ་སྦྱོར་དུ་དབང་བསྐུར་བྱེད་པའི་དུས་སུ་ཕྱག་རྒྱ་མ་བརྟེན་ནས་བྱུང་བའི་བདེ་བ་དེ་བསྒྲུབ་པ་པོའམ་ལམ་དུ་ཉམས་སུ་ལེན་ཙ་ན་ཡབ་ཀྱི་རྡོ་རྗེའམ་ཡུམ་གྱི་པད་མར་ཉི་མ་ཁ་སྦྱར་གྱི་བར་དུ་རིགས་ལྔ་གང་རུང་པའི་ཕྱག་མཚན་བསྒོམ་པ་ལ་དེ་ལ་དམིགས་ནས་དབང་གི་དུས་སུ་ཕྱག་རྒྱ་ལ་བརྟེན་ནས་བྱུང་པའི་བདེ་བ་དེ་བསྒོམས་པས་ཆོས་སྐུའི་དེ་ལས་སྤྲུལ་སྐུ་འབྱུང་སྤྲུལ་སྐུས་སེམས་ཅན་གྱི་དོན་བྱེད་དོ་གསུང་༽རྡོ་རྗེ་ལྟ་བུའི་༼མཚན་མ་ཕྲ་མོ་ཉི་མ་ཁ་སྦྱོར་བར་དུ་༽མེ་ལོང་བཅས། །༼དོན་གྲུབ་༽རལ་གྲི་འདྲ་བའི་མེ་ལོང་བཅས། །རྒྱལ་མཚན་༼གྱི་མཚན་མ་༽རྟག་ཏུ་བྱུང་ལས་༼ཉི་མའི་བར་དུ་སོགས་ཟེར་༽ཤེས་༼དགྲ་སྟ་ལ་སོགས་པའི་མཚན་མར་འོང་བར་རིགས་ན་འདིར་ཏ་ཐའི་མཚན་མ་ལ་སེམས་བཟུང་སྟེ་བསླབ་པ་དང་པོའི་གདམས་པ་ཡིན་གསུང་༽། །ཁ་སྦྱོར་མེ་ལོང་ལས་ཤེས་བྱ། །༼རྡོ་རྗེ་ལ་སོགས་པ་༽མཚན་མ་དང་ནི་༼དེ་ལྟ་བུའི་༽གཟུགས་སུ་བྱ། །༼ཕྲ་བ་བསྒོམ་པའི་༽མཚན་ཉིད་འདི་དག་དང་ལྡན་པ། །དེ་ནི་མཁ་འ་འགྲོ་མ་རྣམས་ཀྱི་༼ནི་༽། །༼དང་པོའི་དཔེའི་ཡེ་ཤེས་སྐྱེ་དེ་ལས་རིམས་ཀྱིས་གོམས་པས་ལས་མཐའ་མར་མ་ཧ་མུ་ཏྲ་རྟོགས་པས་ཌ་ཀི་རྣམས་ཀྱང་༽མཆོག་ནི་ཡིན་པར་ཤེས་པར་བྱ། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་མཁའ་འགྲོ་མའི་མཚན་མའི་ཕྱག་རྒྱའི་མཚན་ཉིད་ཀྱི་༼ཆགས་པའི་རྟགས་ཡིན་པས་༽ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་གསུམ་པའོ། ། ༼ལེའུ་བཅོ་ལྔ་པ་དང་འདིར་འབྲེལ་གསུང་༽ །དེ་ནས་ཚིག་གཞན་གྱིས་སྒྲུབ་པའི་༼རེ་རེ་ལ་འདུས་པ་༽། །༼ཡི་གེ་འདུས་པའི་༽བརྡ་ནི་རབ་ཏུ་༼རྣལ་འབྱོར་མ་ཙམ་དུ་ངོ་ཤེས་པའི་༽བཤད་བྱ་སྟེ། །སྤུན་དང་སྲིང་མོར་ངེས་པ་ནི། །གང་གིས་༼ལག་པ་གཡོན་པས་གཡས་པས་བཤལ་ནས་བཟུང་པ་དེ་ ཡན་ལག་དྲུག་པ་སུ་ཏིས་ཕྱག་རྒྱའི་ལན་ནོ་༽ཤེས་པར་འགྱུར་བའོ། ༼ སྐྱེས་པའི་དཔུ་རྒྱན་དང་སྲིང་མོར་བུད་མེད་ཀྱིས་དཔུ་རྒྱན་དང་མིང་པོར་ཤེས།འདི་དག་ལ་ཕར་སྨྲ་བའམ་ཚུར་སྨྲ་བ་༢་ཀ་ལ་དོན་ཤེས་པར་བྱའོ། ལག་པའི་བཤལ་ནས་བཟུང་པ་བྱ་བ་རེས་སུ་གཡས་པས་གཡོན་པ་༽ །པོ་ཏཱང་གྷི་ཞེས་བྱ་བ་ནི་གསོང་པོར་སྨྲ་བའོ། །པྲ་ཏི་པོ་ཏངགྷི་ཞེས་བྱ་བ་ནི། །གསོང་བོར་སྨྲ་བའི་ལན་ནོ།གྷ་མུ་ཞེས་པ་ནི་འགྲོའོ་༼ འི་སྤྱིར་དཀྲུགས་ཏེ་བསྟན་པ་ རིམ་པས་ཐོད་པ་དང་བདེ་བ་མྱོང་བར་བྱེད་པ་སྟེ་དེ་ལས་དང་པོ་རེག་བྱ་བདེ་བ་ བསྐྱེད་དེ་་་་་་་་་ ་་་་ ༡༤་་༼སྲིབ་༧༽ཞེས་བྱ་བ་ཡིན་ནོ། །ལུམ་པ་ཞེས་བྱ་བ་ནི་འོངས་སོ་ཞེས་བྱ་བ་ཡིན་ནོ། །དེ་ཧི་ཞེས་བྱ་བ་ན་ཟོས་ཞེས་སྨྲ་བ་ཡིན་ནོ། །གྲི་ཧ་ན་ཞེས་བྱ་བ་ནི་ལེན་ཞེས་བྱ་བ་ཡིན་ནོ། །བཱི་རཱ་ནཱམ་ཞེས་བྱ་བ་ནི་སྙིང་པོའོ། །མར་ན་ཞེས་བྱ་བ་ནི་༼འཆི་འཕོ་བའི་༽སྒྲ་ངན་པའོ། །ཀར་ནི་ཀ་ཞེས་བྱ་བ་ནི་གྷན་ཏའོ་༼གྷན་དྷ་ཞེས་བྱ་བ་ནི་ཀ་ནི་ཀ་ཟེར་དྲིལ་བུ་༽། །ཤི་རོ་ནི་རྫུན་ནོ་༼གྲོལ་ལོ་༽། །ཀཱ་ར་ནཱ་སྐྲའོ་༼ཡིན་ན་ཅེའོ༽། །བཱ་ར་ནི་༼ཡིན་ན་་ ་མཚན་མ་ཉི་མ་ཁ་སྦྱོར་བར་དུ་༽ཕག་གི་སྒྲའོ།༼༡༤སྲིབ་གཤམ་དུ་རྟགས་༢་རྟགས་ཅན་ལ་བཙུད་ས་མ་རྙེད༽༢་ནི་༼དམར་བ་དང་རྔུལ་དང་མཆུ་གས་པ་ལ་སོགས་པ་གསུང་༽༼བརྟེན་པ་ལ་བརྟེན་ནས་བདེ་བའི་ཡེ་ཤེས་ཉམས་སུ་མྱོང་བ་དེ་གསུང་༽ཞེས་པ་འདི་༢་ཡིན༽༽ །ཤྲ་མ་ནོ་ནི་རྣ་བའོ། །མན་ཏ་ན་ནི་༼ཨ་མྲི་ཏ་བྷ་ག་ཟེར་༽བདུད་རྩིའི་གནས་སོ། །ནར་ནི་མཉམ་པར་འདུས་པའོ། །ཏ་ལི་ཀ་ནི་མཁའ་འགྲོ་མའོ། ༼༢་ན་ར་ར་ཡོད་༽ །ཀ་མན་དྷ་ལུ་ནི་དཀྱིལ་འཁོར་རོ། །ཨ་མོ་ཀ་ནི་དུར་ཁྲོད་དོ། །ཀམ་པི་ལ་ནི་སྒོའོ། །ཤྭ་ར་ཤ་ནི་བྲམ་ཟེའི་རིགས་སོ། །པ་རི་ཏཱ་ི་ནི་རྒྱལ་རིགས་སོ། །པི་ར་ཏི་ནི་རྗེའུ་རིགས་སོ། །ཀྲཱུར་ཏ་ནི་དམངས་རིགས་སོ། །ཨན་དྷ་ནི་༼ཤན་པ་༽རྨེ་ཤ་ཅན་ནོ། །ཤུ་ལི་ཀ་ནི་ཁྱིམ་མོ། །ཨ་ལི་ཀ་ནི་ཕྱུགས་སོ། །ཌ་ཀི་ན་ནི་སྲིང་མོའོ། །མེ་རུ་ཀ་ནི་ཆུའོ། །གྲི་ཧེ་ར་ནི་ཕྱག་རྒྱས་བཏབ་པའོ༼་རང་ལ་ཁྱོ་དོ་བ་༽། །༼དན་ཏ་པར་ཤ་ན་ནི་༽ལྕེ་སོ་ལ་རེག་པ་ནི་བདག་ལྟོགས་པར་སྟོན་པའོ། །ཏྲི་ཤྲཱར་ནི་དྲིས་༼ལུས་ལ་༽བསྒོ་པའོ། །ཀུ་ཏ་ནི་གང་ནས་འོངས་ཞེས་པའོ། །ཨ་མུ་ཀསྡྱ་ན་ནི་གནས་ཆེ་གེ་མོ་ནས་འོངས་སོ་ཞེས་བྱ་བ་བའོ། །ཀི་ར་ནི་མེ་ཏོག་གོ །ཏུ་མུ་ལ་ནི་རྒོད་པའོ། །དན་ཏཾ་ནི་ཆར་དབབ་པའོ། །དྲི་པ་ཏྲི་ནི་ཞུ་པའོ། དྷུརྻ་ནི་ཕྱིའོ། །དུ་མ་པྲི་ཡ་ནི་སྤྲིན་ནོ། བྷ་ཧེར་ནི་ལུས་སོ། །ས་བུ་ནི་རིའོ་༼བདུན་༽། །ས་རི་ཏྲ་ནི་ཆུའོ་༼བོ་བཞི་༽། །ཨཾ་གུ་ལི་ནི་༼སོར་མོའི་༽ཆ་ཤས་སོ། །བ་དན་ནི་གདོང་ངོ། །ཛ་རི་ཀ་ནི་ལྕེའོ། །ཨན་དན་ནི་སོའོ། །པ་ཀ་ཏི་ནི་རྒྱལ་མཚན་ནོ། །པ་ཞེས་བྱ་བ་འགའ་ཞིག་ཏུ་༼རྒྱན་གྱི་༽རྣམ་གྲངས་སོ། །ཙན་དྷོ་ནི་ཕྲེང་བའོ། །ཙ་ལ་ནི་རླུང་ངོ། །པ་ཤུ་ནི་རི་དགས་སོ། །༼ཨན་ཏི་ཟེར་༽ཡ་ཏི་ནི་དཀྱིལ་འཁོར་རོ། །སྭ་སཾ་ནི་བཞི་མདོའོ། །ཕལ་ཀུ་ཤཾ་ནི་སྐྱེ་བའོ། །མ་ཧ་གཥ་རམ་ནི་ཕྱུགས་ཆེན་པོའོ་༼གླང་པོ་ཆེ་ལ་སོགས་པ༽། །གཱ་ནི་ར་སྐྱེས་སོ། །ན་ནི་མིའོ། །གོ་ནི་ཁྱུ་མཆོག་གོ །མ་ནི་མ་ཧེའོ། བྷ་ནི་བཟའ་བའོ། །ཧོ་ནི་༼བཟའ་བའི་༽རྣམ་གྲངས་སོ། །ཨ་བྱ་ཀ་ཞེས་བྱ་བ་ནི་རྒྱལ་པོའོ་༼ཕོ་ཉ་༽སྐྱེས་བུའོ། །རེག་ཞེས་བྱ་བ་ནི་ནགས་ལ་གནས་པའོ། །༼ལག་པ་༽ཁ་ལ་རེག་པ་ནི་ཟོས་ཞེས་པའོ། །ལྕེ་ལ་རེག་པ་ནི་ངོམས་སོ་ཞེས་པའོ། །ན་སྟི་ནི་༼ཅི་ཡང་བྱར་མེད་ཅེས་༽སྟོང་པའོ། །ཧྲི་ནི་ངོ་ཚ་བའོ། །སྟོང་པ་ལ་རེག་པ་ནི་༼ཤུ་ནཡ་ཡར་ཤུ་ནཡ་ཡིན་༽མེ་ཐུན་གྱིས་ཤིག་པའོ། །བླ་ལ་རེག་པ་ནི་༼ངའི་སྟེང་དུ་ཁྱོད་འདུག་ཅིག་པའོ་༽སྟེང་ཉིད་སྟེ་འོག་ན་མེད་པའོ། །ཕྱག་རྒྱ་༼སྔ་མ་༽དང་ཕྱག་རྒྱའི་༼ཕྱི་མ་༽ལན་གསང་བའི་བརྡ་ཅན་དཔའ་བོའི་བཙུན་མོ་དང་། །༼ཁ་དོག་དབྱིབས་ལུས་ཀྱི་བརྡ་གང་གི་བརྡའ། བྱིན་གྱིས་རློབས་བྱེད་ནི། གཟུགས་ཀྱི་སྡེ་ཚན་ནི་ཌ་ཀི་ནི་ལས་མའི་ སྡེ་གཉིས་ལག་པའི་མུ་ཏྲའི་སྟེང་གི་བརྡའི་སྡེ་བཞི་གསུང་༽སྡེ་ཚན་བཞི་རྣམས་ཀྱི་མཚན་ཉིད་དོ། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་སྡེ་ཚན་བཞིའི་མཚན་ཉིད་ཅན་གྱི་བརྡའི་ཚིག་གི་བརྡར་བཏགས་པའི་ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་བཞི་པའོ།། །དེ་ནས་༼འདོད་པའི་དོན་ཐམས་ཅད་༽ཀུན་དོན་འདོད་པ་ཡི། །སྦ་བྱ་༼རྐང་བ་བརྒྱད་ཀྱི་ཧཱུཾ་ཧཱུཾ་ཕཊ་༽བརྒྱད་མཐར་སྦྱར་བྱས་ཏེ་༼མཆོད་པའི་ལ་ཧཱུཾ་ཕཊ་སྦྱར། བཟླས་པ་ལ་མི་སྦྱར་གསུང་༽། །མོས་པ་དམན་པའི་༼བླ་མའི་གདམ་ངག་དང་སྦྱར་བ་༽སེམས་ཅན་དང་། །༼གདམ་ངག་ལ་༽རྨོངས་ཤིང་མི་ཤེས་སེམས་ལྡན་པའོ། །དེ་ལ་དཔའ་བོ་དང་རྣལ་འབྱོར་མ་རྣམས་གྱིས་གསོལ་བར་གསུངས་པའི་སྔགས་ནི་འདི་ཡིན་ཏེ། ༼ཨོཾ་དང་ཧཱུཾ་ཕཊ་ཀུན་ལ་གཞུག་༽ །ཨོཾ་ན་མོ་བྷ་ག་ཝ་ཏེ་ཝི་རེ་ཤཱ་ཡ།༼ཧཱུཾ་ཧཱུཾ་ཕཊ་རྐང་བ་བརྒྱད་ཅར་ལ་སྦྱར་༽ ༼ཨོཾ་༽ །མ་ཧཱ་ཀལྤ་ཨགྣི་སཾ་ནི་བྷཱ་ཡ། །ཛ་ཊཱ་མ་ཀུ་ཊ་ད་ཀ་ཊཱ་ཡ། །དཾཥཊ་ཀ་ར་ལོ་ཀྲ་བྷཱི་ཥ་ཎ་མུ་ཁ་ཡ། །ས་ཧ་སྲ་བྷུ་ཛ་བྷཱ་སུ་རཱ་ཡ། །པ་ར་ཤུ་པཱ་ཤོ་དྱ་ཏ་ཤུ་ལ་ཁྭ་ཊྭཱཾ་ཀ་དྷཱ་རི་ཎེ། །བྱཱ་གྷ་་ཛི་ནཱ་ཨཾ་བྷ་དྷ་རཱ་ཡ། །མ་ཧཱ་དྷུམྤྲ་ཨན་དྷ་ཀཱརཝ་པུཥཱ་ཡ། །ཀ་ར་ཀ་ར་༼མཛོད་༢་༽ ། ཀུ་རུ་ཀུ་རུ་། བྷན་དྷ་བྷན་དྷ་༼ཆིངས་༢་༽ ། ཏྲ་ས་ཡ་ཏྲ་ས་ཡ་༼ཁོས་༡་༢་༽ ། ཀྴོ་བྷ་ཡ་ཀྴོ་བྷ་ཡ་༼དཀྲུགས་༡་༢་༽། །ཧྲཱོཾ་ཧྲཱོཾ་༼སྔགས་དོན་ནི་ཧི་༽། །ཧྲ་ཧྲ་། ཕེཾ་ཕེཾ། །ཕཊ་ཕཊ། །ད་ཧ་ད་ཧ། །པ་ཙ་པ་ཙ། །བྷཀྴ་བྷཀྴ་༼གསོལ་༡་༽ ། ༼གང་ལ་ན། ཞག ཁྲག གར་གྱིས་ན། སྒྱུ་མའི་ཕྲེང་བ་འཆང་བ་༽ །བ་སུ་རུ་ཏི་ར་ཨན་ཏྲ་མ་ལཱ་བ་ལཾ་བི་ཎ། གྷྲིཧྣ་གྷྲིཧྣ་༼ཟུང་༢་༽ །༼ས་འོག་རིམ་པ་བདུན་ཕུག་པ་༽ །སཔྟ་པ་ཏ་ལ་ག་ཏ་བུ་ཛཾ་གཾ་སརྦཾ་༼ལྟོ་འཕྱེ་སྦྲུལ་༽བཱ་ཏརྫ་ཡ་ཏརྫ་ཡ་༼རྟོགས་༽ ། ཨ་ཀཊྚེ། ཨ་ཀཊྚེ་ཧྲཱིཾ་ཧྲཱིཾ་། ཛྙོཾ་ཛྙོཾ་། ཀྴཾམཀྴཾམ། ཧཾ་ཧཾ། ཧིཾ་ཧིཾ་། ཧཱུཾ་ཧཱུཾ། ཀི་ལི་ཀི་ལི། སི་ལི་སི་ལི། ཧི་ལི་ཧི་ལི། དྷི་ལི་དྷི་ལི། ཧཱུཾ་ཧཱུཾ་ཕཊ། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་རྩ་བའི་སྔགས་ཐམས་ཅད་ཀྱི་སྦས་པའི་ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་ལྔ་པའོ། ། ༼གོང་དུ་བསྟན་པའི་ཚུལ་གྱིས་རིགས་མ་ངོ་ཤེས་ནས་ཆགས་པར་བྱ་བ་བསྟན་ནས་འདི་ནས་དེ་དག་བསྟེན་པའི་ཐབས་བསྟན་ཏོ།ཡང་འདིས་ལམ་གྱི་གསང་བ་བསྒྲུབ་པའི་གྲོགས་བསྲུང་བའི་དམ་ཚིག་ཐུན་མོང་མ་ཡིན་པ་བརྒྱད་བསྟན་ཏོ།༽ །དེ་ནས་གཞན་ཡང་འཇིག་རྟེན་ནི། །གསུམ་པོ་དག་ནི་ཡོད་མིན༼་ཤིན་ཏུ་རྙེད་དཀའ་བས༽་པའི། །ཤྲཱི་ཧེ་རུ་ཀའི་༼རྩ་༽སྔགས་༼ལ་སོགས་པ་༽ཤེས་ན། །གསང་སྔགས་༼གཞན་༽ཐམས་ཅད་ཡོངས་༼སུ་༽འདོར་བྱ། །རིམ་དང་༼ལུགས་དང་༽རིམ་ལས་བཟློག་པ་ཡིས་༼སྔགས་ཟློག་པ་ནི་ཡར་ཟློས་མར་བཟློས་སོ། སྔགས་དང་ལྷ་གཡོན་པར་བསྒོམ་པ་བཟློག་པ་ཡང་ཤེས་པར་བྱའོ༽། །༼དཀྱིལ་འཁོར་པའི་ལྷ་རྣམས་༽ཕོ་ཉ་རྣམས་ནི་༼སྔགས་ལས་སྐྱེས་པ་ལ་བྱ་༽ཡང་དག་གནས། །༼ཞིང་སྐྱེས་༽འོག་དང་༼ལྷན་༡་སྐྱེས་མ་༽སྟེང་གྲུབ་༼སི་ཏི་༽རྟག་ཏུ་སྟེར། །༼སྔགས་ལས་སྐྱེས་མ་༽བདག་གི་ཕོ་ཉ་མ་ཀུན་འགྲོ། །༼སྔགས་ལས་སྐྱེས་མས་རིམས་ཀྱིས་བསྐུལ་བས་༽ཕོ་ཉ་མ་དེ་ཀུན་༼དེ་ཡན་ཆོད་ཕོ་ཉ་མ་༣་ཀ་ལོ་ཉི་ཤུ་ཡར་མར་༽གྲུབ་སྟེར། ༼འདི་མན་ཆད་སྔགས་སྐྱེས་༽ །༼སྐར་ཁུང་ལ་སོགས་པ་ནས་བལྟ་ཞིང་༽མཐོང་བ་དང་ནི་༼  རླུང་སྦྱོར་ཞིང་་་་་༣་དུ་ལུས་ལ་་་་་་སྐྱེས་མ་དེ་ཚུན་་་་་་ཇི་ལྟར་བསྟེན་་་་་བྱ་ཞེ་ན་༽རེག་པ་དང་། །༼འོ་བྱ་བ་ཞག་གསུམ་དུ་འོ་༽ཙུམ་པ་ན་དང་རྟག་པར་༼ཞག་གསུམ་དུ་ལུས་ལ་༽མཁྱུད། །རྣལ་འབྱོར་གནས་ནི་༼ཏེ་རྡོ་རྗེ་དང་པད་མ་སྦྱོར། བདེ་བ་མྱོང་པར་ཞག་༣༽་ཁྱད་པར་ཉིད་༼དེ་ལྟར་དཔེའི་ཡེ་ཤེས་ཀྱིས་བདེ་བ་ཉམས་སུ་མྱོང་བར་བྱས་པས་དེར་དོན་གྱི་ཡེ་ཤེས་༤་བ་རྟོགས་པར་འགྱུར་རོ༽ ། ༼དེ་ལྟ་བུའི་ཚུལ་གྱིས་སྔགས་ལས་སྐྱེས་པ་བསྟན་པ་༽།ཇི་སྲིད་རྣལ་འབྱོར་མ་ཡི་ཚོགས་༼ཀྱིས་༽། །ཐམས་ཅད་༼ཐུན་མོང་དང་མཆོག་མ་ཧ་མུ་ཏྲ་མཆོག་༽དངོས་གྲུབ་བྱེད་པར་བཤད། །༼དེ་ལྟ་བུའི་ཐབས་དེ་གང་ཟག་དམ་ཚིག་ཅན་ལ་སྦྱིན་པར་བྱ་བ་ཡིན་པས་༽བདེ་ཅན་ཀུན་ལ་སྦྱིན་བྱ་ཡི། །གཞན་དུ་༼དམ་ཚིག་མེད་པ་ལ་སྦྱིན་པར་མི་བྱ་བ་༽ནམ་ཡང་མ་ཡིན་ནོ། །༼ཕན་བྱེད་པ་༽མ་དང་༼བརྩེ་བས་༽སྲིང་མོ་༼ངག་ཉན་པས་༽བུ་མོ་དང་། །༼བདེ་བ་བསྐྱེད་པར་བྱེད་པས་༽ཆུང་མ་ཕོ་ཉ་༼སྔ་མའི་སྟེང་དུ་ཕོ་ཉ་མོ་རྟེན་པ་དེ་ཡང་སེམས་བརྟན་པ་ཐོབ་པས་དངོས་སུ་ལྔ་དང་མ་ལ་སོགས་པ། འདི་ལོ་ཀའི་རྟོག་པ་སྤང་བའི་ཕྱིར་ལྔ་ཅར་བརྟེན་པའམ། ལས་དང་པོ་པས་༡་ལ་ཡང་ཡོན་ཏན་ལྔ་ཚང་བའི་ཕྱག་རྒྱ་༡་བརྟེན་པའོ་༽ཀུན་གནས་པའོ་༼ཛོ་ཀིའི་བྱ་བ་བྱེད་པས། མ་གནས་ལ་ཟེར་༽ །༼དེ་ལྟར་བརྟེན་་་་ཕོ་ཉ་དེ་ཡང་་་་་གིས་དབང་བསྐུར་དམ་ཚིག་སྡོམ་པ་དང་སྤོད་པ་ལ་གོམས་པར་བསླབ་པ་༽གང་ཞིག་རྟག་ཏུ་སྔགས་སྦྱིན་པ། །དེ་ཡི་དེ་ཉིད་༼བརྟེན་པའི་ཕོ་ཉར་༽ཆོ་གར་བཤད། །དེ་ནས་༼བསྲུང་བའི་དམ་ཚིག་༽རྣལ་འབྱོར་༼མའི་༽རྒྱུད་དུ་ནི། །རྙེད་དཀའ་དམ་ཚིག་༼བསྲུང་བའི་དམ་ཚིག་འཐུན་མོང་མིན་པ་༽ང་ཡིས་བསྟན་༼བཤད༽། །སྐྱེས་བུ་བུད་མེད་གཡོན་ནས་འགྲོ། ༼རང་གིས་འདི་ལྟར་གཡོན་གྱི་ཀུན་ཏུ་སྤྱོད་པ་བྱ་བ་དང་། གཞན་འདི་ལྟར་བྱ་བ་ཡང་བསྟན། དེ་ལྟར་བྱ་ཞིང་རྣལ་འབྱོར་མ་བརྟེན་པ་༽ །འདོད་པའི་དངོས་གྲུབ་༼དངོས་གྲུབ་ཐམས་ཅད་འགྲུབ་པ་ཡུལ་ཉི་ཤུ་རྩ་༤་ལ་སོགས་པར་གནས་པའི་མཁའ་འགྲོ་མས་བྱིན་གྱིས་དེ་ལ་བརློབ༽སྟེར་བར་བྱེད། །ཁྱིམ་དང་ཞིང་དུ་རྣམ་གནས་པའི། ༼གཡོན་གྱི་ཀུན་ཏུ་སྤྱོད་པ་བྱེད་པ་དེ་རྣམས་རྣལ་འབྱོར་པ་དང་རྣལ་འབྱོར་མ་༽ །ཤིན་ཏུ་རིང་ཡང་ཤེས་པར་འགྱུར། །ཧེ་རུ་ཀ་ལས་༼རྣལ་འབྱོར་མ་སྲེས་ན་སྦྱོར་བ་ལས་༽སྦྱོར་གཞན་མེད་༼ཏེ་ཧེ་རུ་ཀ་ཡང་དེ་ཡིན་༽། །སློབ་དཔོན་༼ལ་༽རྣལ་འབྱོར་མ་༼དེ་༽ཉིད་༼རང་༽ཡིན། །རྒྱུད་འདི་རུ་ནི་བསྒྲུབ་པ་པོ། ༼དེ་ལྟར་བྱ་ཞིང་རྣལ་འབྱོར་མ་བརྟེན་ལ་༽ །ལེགས་པར་འགྱུར་བ་༼དངོས་གྲུབ་ཐམས་ཅད་འགྲུབ་པ་༽ཉིད་ཡིན་ཏེ། །༼རྣལ་འབྱོར་མ་ལ་༽བརྙས་མི་བྱ་ཞིང་༼གཡོན་གྱི་ཀུན་སྤྱོད་ལས་འདའ་བར་མི་བྱ་བ་༽སྤང་མི་བྱ། །ཅི་ནུས་པ་ཡིས་༼བརྟེན་པས་ཟས་སྙོམས་འཇུག་སོགས༽་མཆོད་པ་བྱ། ༼གཞན་ཡང་གདུལ་བྱའི་དོན་དུ་ཁྭ་གདོང་ལ་སོགས་པ་ བརྒྱད་བྱུང་བས་༽ །ཁྭ་གདོང་ལ་སོགས་བརྒྱད་འདི་དག་༼པོས་མཚོན་ནས་དུད་འགྲོ་མ་ཆགས་ཐམས་ཅད་ལ་བརྙས་པ་དང་བརྡེག་པ་ལ་སོགས་པ་མི་བྱ་ཞིང་དེ་དག་ལ་༽ །མོས་༼པ་༽དང་དད་པ་འཕེལ་༼བར་༽བྱེད་པ༼ར་བྱ་སྟེ་དེས་ནི༽། །རྟག་པར་དངོས་གྲུབ་༼༣་གྱི་༽རྣམས་ཀྱི་རྒྱུ། །༼དེ་ལྟ་བུའི་༽དམ་ཚིག་རྣམས་ཀྱང་སྐྱོང་བའོ། ༼དེ་ཡན་ཆད་ཀྱིས་གཡོན་གྱི་སྤྱོད་པ་གཙོ་བོར་བྱས་སྟེ་བསྲུང་བའི་དམ་ཚིག་སྤྱིར་བསྟན་ནས། འདི་ན་མར་ཐུན་མོང་མ་ཡིན་པ་བརྒྱད་བསྟན་ཏོ་༽ །ལྷ་མོ་༼རང་གི་རིགས་བརྟག་ཅིང་སྦྱང་བ་བོར་ནས་གཞན་བྲམ་ཟེ་ལ་སོགས་པ་ལྟ་བུ་ལ་སྤྱད་ན་ཉམས་པས་བསྲུང་༽གཞན་དང་ཀུན་སྦྱོར་བ་༼འོ་བྱེད་པ་༽། །༼ཐ་མལ་བའི་༽འདོད་༼ཆགས་༽ལ་༼བྲམ་ཟེ་ལ་སོགས་པའི་མུ་ཏྲ་དེ་ལ་༽ཆགས་པར་འགྱུར་འགྲོ་བ། །མི་གཡོ་བདག་གཞན་གཉིས་༼སུ་༽མེད་༼ ༣་༽པ། །༼རིགས་བཟང་ངན་གཡུང་མོ་ལྟ་བུ་བོར་ནས་རིགས་བཟང་བ་ལ་དགའ་བར་བྱས་ན་༽གཉིས་སུ་མེད་༼པ་༽དང་༼བཟང་ངན་ལ་༽ཐོགས་པ་མེད་༼པར་བྱས་ལ་བསྟེན༽། །༼དོན་གྱི་དབང་བཞི་བོ་རྟོགས་པར་བྱ་བའི་བསམ་པས་བསྟེན་པ་ལས་ད་དེ་བྲལ་ན་ ཉམས་པའོ༽དམ་ཚིག་༼གི་༤་བ་༽སྤྱོད་པ༼འི་༽སྤྱད་པ༼འི་བསམ་པ་སོགས༽་དང་། །༼གོང་དུ་བསྟན་པའི་མ་ལ་སོགས་པའི་ཡོན་ཏན་དང་ལྡན་པ་དང་ཡོན་ཏན་གཞན་པ་སོགས་ལྡན་པ་ལས་༽བུད་མེད་དབང་ཕྱུག་ཤིན་ཏུ་སྦྱོར། །༼བྱང་སེམས་བཟུང་སྟེ་བསྟེན་པ་༽ཚངས་སྤྱོད་དེ་བཞིན་༼འབའ་དན་དེའི་སྟེང་དུ་ཡང་རིམ་པ་༢་ལ་སེམས་གནས་པར་བྱ་གསུང་༽བསམ་གཏན་གནས། །ཁྲོ་༼བ་༽མེད་༼པར་༽རྒྱུན་༼དུ་སྤྱོད་པ་༽གྱིས་ཀུན་ཏུ་སྤྱོད་༼པ་དང་ལྡན་པའོ་༽། །འདི་བརྒྱད་༼བསྲུང་བའི་༽དམ་ཚིག་༼ཐུན་མོང་མིན་པའི་༽ཀུན་སྤྱོད་ཡིན། །བསྒྲུབ་པ་༼པོས་བསྲུང་པ་༽ལ་ནི་གནས་པ་ཡི། །བསྒྲུབ་པ་པོ་ཡི་༼དམ་ཚིག་མི་ཉམས་པར་བསྲུང་པར་༽རྟག་ཤེས་བྱ། །རྒྱུད་༼གཞན་གྱིས་ཡང་དམ་ཚིག་རྣམས་བསྲུང་བའོ་༽ཀུན་གྱི་༼མ་བླ་ན་མེད་པའི་༽ནི་ཐུན་མོང་སྟེ།༼དམ་ཚིག་ཉི་ཤུ་རྩ་གཉིས་འདིར་ཐུན་མོང་མ་ཡིན་པ་བརྒྱ་གསུམ་བཅུ་ཐམ་པའོ༽ །༼དོན་མེད་པར་༽ཉམས་པར་མི་བྱ༼འོ་༽རྒྱུ་མེད་༼དུ་ཉམས་པའམ་བཏང་བའི་དགོས་པ་མེད་པས་༽པ། །༼དམ་ཚིག་དེ་རྣམས་བསམ་པས་༽དད་པ་ཉིད་ཀྱིས་བླང་བྱ་ཡི་༼སྤང་བྱ་དང་བསྟེན་བྱའི་དམ་ཚིག་ཐ་དད་པ་དང་བཅས་པའི་སེམས་ཀྱིས་ཞུ་དག་བྱ་སྟེ་བསྲུང་ཞེས་པའི་དོན་གསུང་༽། །མིག་༼གིས་བལྟ་བ་དང་༽དང་ལག་པས་༼བཟུང་དུ་ཡོད་པ་མ་ཡིན་པས་དད་པས་བླང་ངོ་༽མ་ཡིན་ནོ། །༼དབང་མ་ཐོབ་པ་ལ་དམ་ཚིག་སྡོམ་པ་མི་བསྟན་༽གསང་བ་འདི་ནི་མི་བསྟན་ཅིང་། །རབ་ཏུ་འབད་དེ་སྦ་བར་བྱ། ༼གསང་དང་སྟོན་ནུས་པའི་ཕྱག་རྒྱ་མོ་དགོས་གསུང་༽ །བློ་ལྡན་༼ཕོ་ཉ་མོ་བསྟེན་པའི་དུས་སུ་༽འཐེའུ་ཆུང་༼འབའ་ཏན་ད་བཤད་པ་བླ་ལྷག་ཏུ་མཐེའུ་ཆུང་ཅེས་པས་སྐྱེས་མ་བསྟེན་པ་ལ་སྦྱོར་སྔགས་སྤྱོད་ཡིན་དཔྱད་པས་ཆོག་སྟེ་སོར་མོ་གོང་མ་རྣམས་ཀྱིས་ཞིང་སྐྱེས་དང་ལྷན་སྐྱེས་མཚོན་པའོ་གསུང་ན་དེ་མི་དགོས་གསུང་ངོ་༽བསྐྱོད་པ་༼སྟེ་ག་ཆུ་ག་ཏེ་གུང་འཛུབ་སེན་མོ་མེད་པར་བྱས་ལ་རྩ་བྲུད་པ་གསུང་༽ནི། །ཕོ་ཉ་མོ་༼སྔགས་སྐྱེས་༽རྣམས་༼ཕོ་ཉ་བསྟེན་པའི་བསྒྲུབ་པོ་དུ་ཞེ་ན་༽ཡང་དག་གནས། །༼རྫོགས་པ་བསྒོམ་༽དག་དང་༼བསྐྱེད་པ་བསྒོམ་པ་༽མ་དག་༼རིམ་པ་གཉིས་ཀ་བསྒོམ་མོ་༽འདྲེས་པ་སྟེ། །བསྒྲུབ་པ་པོ་ནི་གསུམ་དུ་གནས། །༼ལྷ་མཉེས་པར་བྱེད་པ་སྐྱེད་རིམ་བསྒོམ་པ་ བཞུགས་པའི་ གདམ་ངག་༽མཉེས་བྱེད་༼ཐ་མལ་པའི་ཕུང་པོ་ལྷར་བསྒོམས་པས་ལྷ་དེ་ཡེ་ཤེས་སུ་རྟོགས་པས་༽རྣམ་པར་དག་པ་དང་། །༼དེ་ལྷར་རིམ་གཉིས་ལ་བརྟེན་ནས་སེམས་གསལ་བའི་ཏིང་ངེ་འཛིན་ནི་སྐྱེས་པའོ་༽གསལ་བྱེད་༼ད་འདི་ཆོག་གསུང་༽ཡོན་ཏན་༼རྫོགས་རིམ་བསམ་མི་ཁྱབ་དང་༽ལྡན་པའི་མི། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས། ༼བསྒྲུབ་པ་པོས་༽སློབ་མ་ཡོངས་སུ་བརྟག་པ་དང་སྡོམ་པའི་༼དམ་ཚིག་བརྒྱད་༽ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་དྲུག་པའོ། །༼ལེའུ་དང་པོའི་བདེ་བས་ཀྱང་ནི་འགྲུབ་པར་འགྱུར་གྱིས་རྒྱས་པར་བཤད་པའོ་༽ །དེ་ནས་སྤྱོད་༼པ་རྡོ་རྗེ་ཐེག་པ་ལ་འཇུག་པའི་གདམ་ངག་གསུམ་དང་བཞུགས་པའི་གདམ་ངག་༣་ཡིན་ལ་འདི་༣་ནི་ཐེག་པ་༣་ཡིན་ཏེ་པར་རྒྱུད་སྦྱངས་མ་སྦྱངས་ཀྱང་ཅུང་ཟད་ཉམས་པའོ་༽དང་༼ཐ་མལ་བའི་སྤྱོད་པ་བརྟུལ་ནས་རྣལ་འབྱོར་པའི་སྤྱོད་པ་ལ་ཞུགས་པ་༽བརྟུལ་ཞུགས་༼ལ་གནས་པའོ་༽དཔའ་༼ཅེས་པའོ༽། །༼ཐ་མལ་བའི་༽ཕོ་ཉ་མོ་༼དོན་༤་ལས་དང་པོ་ཕོ་ཉ་བསྒྲུབ་པའོ་༽རྣམས་རབ་སྒྲུབ་བྱེད་༼མའི་བུ་མོ་ལ་མཁའ་འགྲོ་མས་རྒྱས་པའི་ཕོ་བཙལ༽ ། ༼ཅི་སྟེ་ཞེ་ན་༽ །མྱུར་དུ་སྒྲུབ་༼པར་དངོས་གྲུབ་ཐམས་ཅད་མྱུར་དུ་༽བྱེད་འཇུག་པར་༼ཕོ་ཉ་མོ་ཡིན་པས་༽འགྱུར། །༼ཕོ་ཉའི་༽མཚན་ཉིད་ཐམས་ཅད་༼སྔར་བཤད་པའི་རིགས་དྲུག་ལ་སོགས་པའི་༽ཤེས་པར་བྱ། །༼ཐ་མལ་༽ཡུལ་དང་༼དོན་༢་པ་ཕོ་ཉ་ཡུལ་ ཕོ་ཉ་མོ་བཙལ་བའི་ཕྱིར་ཡུལ་ཉི་ཤུ་རྩ་བཞི་ལ་སོགས་པར་པད་མ་བཛྲས་གསང་བ་འགྲུབ་པ་ན་བཤད་པ་ལྟར་འགྲོ་སྟེ་༽ཡུལ་དུ་འགྲོ་བ་༼ཡུལ་ནས་བཙལ་བ་༽ཡིན། །ཕོ་ཉའི་གཟུགས་ནི་མཚོན་པ་ཡི་༼ཞིབ་བཙལ་༽། །༼ཐིག་ལེ་འཛིན་ནུས་མི་ནུས་༽ཕོ་ཉ་རལ་གྲི་སོ་འདྲ་ཞིང་༼ཕོ་ཉ་གཉིས་ལས་ཐ་མལ་བའི་མིན་པ། གྲུབ་པའི་ཕོ་ཉ་མོ་ནི་དམ་ཚིག་དང་ལྡན་པས་མཉེས་པར་བྱས་པས་དངོས་གྲུབ་སྟེར་ལ། དམ་ཚིག་དང་མི་ལྡན་ཞིང་མཉེས་པར་མ་བྱས་པས་བསྒྲུབ་པ་པོ་རང་གསོད་རལ་གྲིས་ཡང་ན་གཞན་གཅོད། ཡང་ན་རང་ལ་གཅོད་པ་དང་འདྲ། ཡང་ན་ཐ་མལ་པའི་བདེ་བ་ལ་ཆགས་པས་ཕྱག་རྒྱ་བསྟེན་ན་རྣམ་རྟོག་སྐྱེད་པའམ་ངན་འགྲོ་སྐྱེད་པ་ཡང་གསུང་༽། །༼མཉེས་པར་བྱས་ནས་སྡིག་པ་༽དག་བྱེད་བསོད་ནམས་༼དངོས་གྲུབ་སྟེར་༽འཕེལ་བྱེད་ཡིན། ༼དོན་གསུམ་པ་ཕོ་ཉ་བཙལ་བ་དེ་སྟོན་པའི་ཐབས།དེ་བཞིན་ཕོ་ཉ་༼༣་དབྱེར་མེད་དུ་ཤེས་པ་བསྟན་ཏེ་༽ལེགས་༼དེ་ཡང་བསྟེན་པ་ན་སྔགས་ལ་ཞིང་སྐྱེས་སུ་མོས་པ་བྱེད་པས་བསྟེན་ཏོ་༽འདྲེས་པ༼ར་བྱེད་པས་ཕོ་ཉ་དེའི་གསང་གནས་བྱིན་གྱིས་བརླབ་པ་དང་གནས་རྣམས་སུ་རྩ་སྔགས་ལ་སོགས་པ་དགོད་པ་དང་གནས་༣་དང་གནས་ལྔ་བྱིན་གྱིས་བརླབས་ལ་སྙོམས་བྱས་ཏེ་མཆོད་པས་༽། །བསྒྲུབ་པ་པོ་ཡིས་༼སྔགས་སྐྱེས་མ་བསྟེན་ཏེ་དེ་ཡང་དང་པོ་དཔའ་བོ་ཡིས་དངོས་སུ་མྱོང་བ་དོན་གྱི་ཡེ་ཤེས་རྟོགས་པར་བྱས་ན་ཕན་ཡོན་༽དངོས་གྲུབ་འཐོབ། །༼ཕྱིའི་༽བཟླས་བརྗོད་༼ མཆོད་པས་ཕོ་ཉ་མཉེས་པས་༽བསམ་གཏན་༼ལྷ་བསྒོམ་པ་ལ་སོགས་པ་༽མེད་པར་ཡང་༼ཡང་ཞེས་བྱ་བ་སྡུད་ཚིག་སྟེ། མཆོག་ཐུན་མོང་སི་ཏི་རྣམས་སྔགས་བཟླས་བསམ་གཏན་གྱིས་འགྲུབ་པས་ཡང་དེ་དག་མེད་པར་ཕོ་ཉ་ལ་བསྟེན་ཏེ་དོན་གྱི་ཡེ་ཤེས་རྟོགས་པས་ཀྱང་འགྲུབ་ཅེས་པའོ༽། །༼བསམ་པ་ལ་སོགས་པའི་ཁྱད་པར་རོ་༽མྱུར་བ་ཉིད་དུ་༼དངོས་གྲུབ་༣་༽འགྲུབ་པར་འགྱུར། ཕོ་ཉ་བསྟེན་ལུགས་བསྒྲུབ་པ་པོ་༽ །སྔགས་དང་ཕྱག་རྒྱ་༼དང་༽བསྒྲུབ་པ་པོས་༼སྙོམས་འཇུག་གིས་༽། །མཆོད་པ་ཉིད་༼ཕོ་ཉ་བསྟེན་པ་རང་༽ལ་རབ་ཏུ་འཇུག ༼འདི་ན་མཐོང་མི་ཐུབ་པའི་མཆན་ཞིག་བཙུད་མེད༽ །འདི་ལས་གཞན་པའི་མཆོག་མེད་དེ། །བསྟན་བཅོས་ཉིད་དུ་༼ཕོ་ཉ་བསྟེན་པའི་ལམ་འདི་ཐེ་ཚོམ་མེད་༽ངེས་པ་ཡིན་༼པས་༽། །ཕོ་ཉ༼་བསྟེན་པ༽འི་ལམ་ལ་དགའ་བ་དང་། །བསྒྲུབ་པ་པོ་ནི་དངོས་གྲུབ་༼བསྒྲུབ་པ་ལ་བརྩོན་༽༼དོན་བཞི་བ་ཕོ་ཉ་བསྟེན་པའི་དུས་སུ་ཟས་ཀྱི་རྣལ་འབྱོར་ཕོ་ཉ་བསྟེན་པ་ལ་ལུས་བཟུངས་རྒྱས་པ་ཅིག་དགོས། ལུས་ཟུངས་རྒྱས་པ་ལ་ཁ་ཟས་བཟང་པོ་བཟའ་དགོས་པས་ཁ་ཟས་བསྟེན་པ་བསྟན༽་བརྩོན་༼པར་བྱ་༽ ། ༼ཨོཾ་ཨཱ་ཧཱུཾ་༽ །རིགས་སྔགས་༼འདི་ལ་བརྟེན་ནས་ལག་མཆོད་ཟིན་གསུང་། ཚེས་བཅུའི་དུས་སུ་པུ་ཙ་ཡང་ཟིན་གསུང་། ཐེབ་སྲིན་སྦྱང་བ་སྟེ་འཐེ་བོང་ལ་ཟླ་བ་ལ་ཧཱུཾ་བསམས་ལ་གསེར་གྱི་ས་གཞིར་བསམ། འཛུབ་མོ་ལ་ཟླ་བ་ལ་སུཾ་བསམ་ལ་རི་རབ་ཏུ་བསམ། ཆང་རྒྱ་མཚོར་བསམ་ལ་བསྲུབས་པར་བསམ། དེ་ལས་བདུད་རྩིར་བསམས་ལ་ཟ༽་ཕྱག་རྒྱར་ཡང་དག་ལྡན། །༼ལྷ་མཆོད་པའི་བསམ་པས་༽ཟས་ལ་རྟག་ཏུ་སྤྱད་པ་བྱ། །རྣལ་འབྱོར་༼ལྷ་༣་བཅུ་རྩ་༧་གྱི་དཀྱིལ་འཁོར་རྫོགས་པ་ལ་བྱ་༽ཀུན་ལ་འཇུག་པ་ཡིས། །བསྒྲུབ་པོ་༼ཕྱི་ནང་གི་ལྷའི་དཀྱིལ་འཁོར་རྫོགས་པ་ལ་༽ལེགས་པར་མཉམ་བཞག་བྱ། །༼སྤྱོད་པ་བྱེད་པའི་དུས་སུ་༽རིགས་རྣམས་༼སྤྲོས་མེད་ཀྱང་ཟུར་ཙམ་ཟིན་གསུང་༽ཀུན་ལ་༼གཡུང་མོ་དང་བྲམ་ཟེ་ལ་སོགས་པ་བཟང་ངན་མེད་པར་༽སྤྱད་བྱ་ཞིང་། །༼བདུད་རྩི་ལྔ་ལ་སོགས་པར་དང་ཆང་ལ་སོགས་པ་མཉམ་པོར་༽བཟའ་མིན་པར་ནི་མི་བརྟག་གོ །༼དེ་བཞིན་ཟེར་༽དེ་ཉིད་དུ་༼ཆོས་ཉིད་དེ་བཞིན་ཉིད་དུ་རོ་༡་པས་རིགས་བཟང་ངན་དུ་༽ནི་དེ་དབྱེར་མེད། ༼ཞིང་སྐྱེས་མ་དང་ལྷན་སྐྱེས་མ་བསྒྲུབ་པ་ཡང་སྔགས་སྐྱེས་བསྐུལ་ནས་འགྲུབ་ཅེས་སོ་༽ །ཕོ་ཉ་མོ་ཡི་བསྒྲུབ་པ་གཉིས། །༼སྔགས་སྐྱེས་མ་བསྟེན་པ་༽དངོས་གྲུབ་ཆོ་ག་ལ་སྤྱོད་ཚེ། །༼སི་ཏི་བསྒྲུབ་པའི་ཚེ་སྔགས་སྐྱེས་མ་བསྟེན་པ་༽ཕོ་ཉ་གཅིག་པ་ཁོ་ན་ཡིན། །རབ་༼མཆོག་༽དགའ་ཉིད་༼བུ་དང་བུ་མོའི་༽དང་དངོས་གྲུབ་ནི༼ཐུན་མོང་དངོས་གྲུབ་༽ ། ༼འདི་ན་རྐང་བ་དུ་མར་དོའི་འགྱུར་ན་མེད་དེ་མེད་པ་ལེགས་༽ །ཞིང་རྣམས་གནས་སུ་༼རང་བཞིན་གྱིས་འགྲུབ་པའི་ཡུལ་ཉི་ཤུ་རྩ་བཞི་ན་༽གྲུབ་པ་ཡི། །མཁའ་འགྲོ་མ་དག་རྣམ་པར་གནས་༼པས་གྲུབ་པོས་སྔགས་སྐྱེས་གྲུབ་ཙ་ན་ཞིང་གྲུབ་པོ་༽། །དེར་༼བསྒྲུབ་པ་པོ་དེར་ཕྱིན་བསྐྱེད་རྫོགས་གཉིས་པ་༽གནས་པ་ཡི་༼སྔགས་སྐྱེས་བསྟེན་ཅིང་༽བཟླས་པ་བྱ་༼ཅེས་པ་ཕོ་ཉ་བསྟན་པ་ཉིད་དགོས་གསུང་༽། །ཟས་རྙེད་པ་༼སྔགས་སྐྱེས་དངོས་སུ་རྙེད་པ་༽ནི་གཉིས་པའོ། །དེ་ནི་༼སྔགས་སྐྱེས་དངོས་སུ་རྙེད་ནས་བསྟེན་པ་༽རོལ་པར་ཡང་དག་༼ཕོ་ཉ་བསྟེན་པ་༽གནས། །བསྒྲུབ་པ་༼དངོས་གྲུབ་༽དག་དང་ཉེ་བའོ། །༼སྔགས་སྐྱེས་དངོས་སུ་བསྟེན་པས་ཞིང་སྐྱེས་བསྐུལ་དེ་ལྷན་སྐྱེས་བསྐུལ་བས་༽ཕོ་ཉ་རྣམས་ནི་ཡང་དག་བསྐུལ། །༼དེ་ལྟར་སྔགས་སྐྱེས་བསྟེན་པས་སི་ཏི་ཐོབ་པ་དེ་ཡང་༽བླ་མ༼འི་གདམས་ངག་༽་བརྒྱུད་པའི་རིམ་༼པ་ལས་༽ཐོབ་པའི། །༼དང་པོ་ཕོ་ཉ་དེ་༽དབང་བསྐུར་༼བྱ་༽བས་ནི་སྔགས་ལེགས་ལྡན་༼ལྷ་བསྒོམ་པ་དང་ལྡན་པར་བྱ་༽། །༼བཞི་པའི་དེ་ལྟར་བྱས་པའི་༽ཕོ་ཉ་རྣམས་སུ་༼བསྟེན་པར་༽ཡང་དག་བཤད། །༼དེ་ནས་༽ཕྱག་རྒྱ་༼བསྟེན་པ་ཡང་ཁབ་དེབ་ལྟ་བུ་དང་སྤྱང་ཐག་ལྟ་བུ་ལ་སོགས་པ་བསྟེན་པའོ་༽ལེགས་སྦྱོར་ངང་ཚུལ་༼རྡོ་རྗེ་མཁའ་འགྲོ་མས་རི་དྭགས་མིག་དང་གླང་པོའི་སྣ་ལ་སོགས་པའི་མཚན་ཉིད་དང་ལྡན་པའོ་༽དང་། །༼མིའི་མཚན་ཉིད་དང་ལྡན་པའི་སྟེང་དུ་ཡང་ཕོ་ཉ་དེའི་མཚན་ཉིད་༽ཆགས་༼པ་༽མེད་གཏོང་དང་༼རང་གི་དམ་ཚིག་བསྲུང་༽ཚུལ་ཁྲིམས་ལྡན། །༼དང་པོར་དེའི་ཡེ་ཤེས་དེ་ལས་དོན་གྱི་ཡེ་ཤེས་དེ་རྟོགས་པ་སྐྱེ་ལ་དེ་ལས་འབྲས་བུ་ཆོས་སྐུའི་ཡེ་ཤེས་སྐྱེའོ་༽ཡེ་ཤེས་རྒྱུ་སྐྱེས་༼རིམ་གྱིས་འབུ་ཏར་༽ཡང་དག་རྫོགས། །བསམ་པའི་བདག་ཉིད་༼བུ་མོ་འོད་གསལ་སྟོང་པ་ལ་ཉལ་བས་༽ནང་པར་ལངས། །ལུས་ཀྱི་༼སྤོགས་ཀྱི་བསྡུ་བ་ཚངས་པ་ལ་སོགས་པ་བསྐྱེད་རིམ་རྫོགས་པར་བསྒོམས་པའི་༽བྱ་བ་ཀུན་བྱ་སྟེ། །༼གང་ཞེ་ན་ཐ་མལ་བའི་ལུས་ཀྱི་ ཆོ་ག་གཉིས་༽ཡན་ལག་ལས་འདས་མཚོན་ཆ་ནི། །༼ལྷའི་ང་རྒྱལ་དུ་བྱ་བ་གསུམ་བཅུ་རྩ་བདུན་གྱི་༽ལུས་ལ་༼ལྷ་རྣམས་རྫོགས་པར་དགོད་པ་ལ་སོགས་པ་༽གནས་པར་ཀུན་ཏུ་སྤྱད། །༼ལུས་ལྷར་༽དག་༼པར་༽བྱེད་བྱས་པའི་ལུས་དང་ནི། །༼༣་པ་སྤྱོད་ལམ་གྱི་ཁྱད་པར་དུ་༽རྟག་ཏུ་སྔགས་ནི་༼ཨོཾ་ཨཱ་ཧཱུཾ་སརྦྦ་བི་ར་ཡོ་གི་ནི་ལ་སོགས་པས་ལུས་ཀྱི་དཀྱིལ་འཁོར་བསྟན་པར་བྱེད་པས་༽བརྗོད་པར་བྱ། །རྟག་ཏུ་སྔགས་ནི་༼སུམ་བྷ་ནི་༽བརྗོད་ནས་སུ། །རྣལ་འབྱོར་གནས་རྣམས་༼པུ་ཛ་ལ་སོགས་པ་ལུས་ཀྱི་གནས་རྣམས་༽་ངེས་བསྟན་ཞིང་༼ཧེ་རུ་ཀ་བསྒོམ་༽། །༼ལུས་ལ་ལྷ་ཚང་མར་དགོད་པ་གོ་ཆ་ལ་སོགས་པ་༽མཚོན་ཆ་རྣམས་ནི་བསྒོམ་མི་བྱ་། །༼བཞི་བ་དམ་ཚིག་གི་ཁྱད་པར་༽དམ་ཚིག་ཅན་༼རྡོ་རྗེ་སྤུན་ལ་སོགས་པ་ལ་སྤྱིར་བུད་མེད་ཐམས་ཅད་ལ་༽མི་ཁྲོ་མི་བྱ། །དབང་བསྐུར་པ་ལས་༼སེམས་ཉིད་ཁོ་ན་རྟོགས་པ་ལ་དབང་བཞི་པའི་དོན་རྟོགས་པར་བྱ་ལས་༽འདའ་མི་བྱ། །༼བཞི་བའི་རྟོགས་པ་རྒྱུན་དུ་༽དེ་དང་༼དབང་ཟེར་༽ལྷན་ཅིག་༼མི་འབྲལ་བར་བྱའོ་༽བདེ་བར་བྱ་༼དབང་བཞི་པའི་དོན་རྟོགས་པས་༽། །༼རང་༽གྲོལ་བའི་དོན་༼རང་དོན་སི་ཏི་ཐོབ་གཞན་དོན་དུ་ལས་བཞི་ལ་སོགས་པ་འགྲུབ་༽དེ་དོན་དུ་༼ལྔ་དགོས་པ་གོང་གི་བསམ་པ་དང་ཡུལ་གྱི་ཁྱད་པར་རང་ལ་དགོས་པ་ཅི་ཡོད་ཅེ་ན་༽། །དམ་ཚིག་སྤྱོད་པ་ཉིད་དུ་༼ཕོ་ཉ་བསྟེན་པ་ཉིད་དུ་༽བྱ། །༼འབའ་ཏན་ཏ་༽རྨོངས་པས་༼ཐ་མལ་པའི་༽འཁྲུལ་བ་རྣམ་པར་སྤང་། །༼དྲུག་པ་ཁ་དོག་དང་གོས་ལ་སོགས་པའི་ཁྱད་པར་༽མཚན་མོ་རྟག་པར་༼གཅེར་བུ་མོ་༽ནམ་མཁའི་གོས་༼ཅན་བྱས་པར་༽། །ཡང་ན་གོས་དང་།སུམ་བྷ་ར་ཧིར། དམར་ནག་དུ་བ་འདིར་༽གནག་དང་དམར་བར་རྟག་འགྱུར་བ། ༼ཞེས་བྱ་བ་ལ་སོགས་པ་ཚིག་རྐང་བཅུ་འགྱུར་སྙིང་ལ་ཡོད་ཏེ་འབའ་ཏན་ཏའི་དང་༽ །སྲོག་ཆགས་༼བླ་དཔེ་ལ་མེད་༽ལས་བྱུང་༼སྟག་སྤགས་ལ་སོགས་པ་༽ཡན་ལག་གྱོན། །༼ཅི་དགར་༽བདེ་བ་༼བསྐྱེད་༽སྤྱོད་པས་༼ཕྱག་རྒྱ་ཆེན་པོ་༽བདེ་ཐོབ་འགྱུར།་༼ཞེས་པ་རྟོགས་པ་ཁྱད་པར་ཅན་སྐྱེ་བ་ལ་བྱའོ༽། །མཆོད་ཕྱིར་ཐོགས་ནི་༼གསེར་ལ་སོགས་པ་ལས་བྱས་པའི་རྒྱན་བདུན་༽ཡོངས་སྤངས་གཙང་། ༼བར་བྱས་པས་ལྷའི་རྒྱན་གྱིས་བརྒྱན་༽ཤྲཱི་ཧེ་རུ་ཀར༼འི་ང་རྒྱལ་དུ་༽བྱིན་གྱིས་བརླབས། །༼རུས་པའི་༽ཕྱག་རྒྱ་ལྔ་དང་༼འབྲས་བུ་ཆེ་བ་ལ་ལ་ལས་འདིར་འབྲས་བུ་ཆུང་ལྷན་༡་སྤྱོད་བྱ་ཟེར་༽ཡང་དག་ལྡན། །དུས་ཀུན་ཏུ་ནི་ཡང་དག་སྤྱད། །༼དེ་རྒྱས་པར་༽མགུལ་རྒྱན་གདུ་བུ་རྣ་རྒྱན་དང་།༼ཕས་དྲུག་དང་སྦྱར། ཡང་ན་རིས་དྲུག་དུ་སྦྱར་༽ །༼བརྒྱད་པ་ཞར་ལ་གསང་པའི་སྤྱོད་པ་དང་གསང་བར་བྱ་བ་དང་གཙང་སྒྲ་ལ་སོགས་པའི་ཁྱད་པར་༽སྤྱི་བོ་ནོར་བུས་རྣམ་པར་བརྒྱན། །མཆོད་ཕྱིར་ཐོགས་དང་ཐལ་བ་དང་། །དུས་ཀུན་དུ་ནི་རྣམ་པར་གནས་༼རུས་པའི་རྒྱན་ལ་སོགས་པ་གདགས་པ་དང་༽། །༼གཅེར་བུ་ལ་སོགས་པའི་སྤྱོད་པས་སྤྱོད་པ་དང་བསྒོམ་བཟླས་ལ་སོགས་པ་ཐམས་ཅད་༽མཚན་མོ་རྟག་ཏུ་གསལ་བྱ་ཞིང་༼ཞེས་བྱུང་༽། །ཉིན་པར་གསང་བ་ཉིད་དུ་བྱ། །བྱེད་པའི་ཡེ་ཤེས་ཤིན་ཏུ་སྦ། །རབ་ཏུ་ཞི་ཞིང་ངལ་བ་ཐུལ། །༼གཙང་སྒྲ་དངོས་དེ་མདོར་བསྟན་པ་༽ གཙང་སྒྲ་གསུམ་དུ་ཤེས་བྱ་ཞིང་། །༼སྤྱོད་པ་མ་བཅོས་པ་རྣལ་མ་༽རང་གི་རྒྱུན་བཞིན་རྣམ་པར་གནས། །༼བྲམ་ཟེ་སོགས་༽རིགས་དང་༼གཡུང་མོ་སོགས་༽རིགས་མིན་༼གཉིས་པ་བཟང་ངན་དུ་༽ངོར་མི་ལྟ། །༼སྐྲ་ལྟག་པར་༽སྤྱི་གཙུག་ལ་སོགས་༼མེ་ཏོག་འཕྲེང་བ་རྟགས་སོགས་༽བཅིང་བ་སྤང་། །༼དབང་པོ་རབ་དེ་ཁོ་ན་ཉིད་གོམས་པར་བྱེད་པའི་༽ཕོ་ཉ་༼གཙང་སྤྲ་རྒྱས་པར་བཤད་པའོ༽གཙང་སྦྲ་དང་པོ་ཡིན། །གཉིས་པ་༼འབྲིང་བདུད་རྩི་ལྔ་ ཕག་ཏུ་རྟོག་མེད་སྟོན་ཅིང་དེ་ཁོ་ན་ཉིད་གོམས་པར་བྱེད་པ་༽ཟླ་བ་ཡིན་པར་འདོད། །༼དབང་པོ་ཐ་མ་ཚོགས་ཀྱི་འཁོར་ལོ་ལ་སོགས་པའི་དུས་སུ་སྣོད་༡་ཏུ་ཟ་བ་ཟས་གཅིག་ཏུ་སྤྱོད་པ་༽ཟས་གཅིག་ཏུ་ནི་༼བྲམ་ཟེ་སོགས་རིགས་ཐམས་ཅད་༽ཟ་བ་ཉིད། །གཙང་སྦྲ་གསུམ་པ་༼གཙང་སྦྲ་ནི་རྟོག་པའི་དྲི་མ་དག་པར་བྱེད་པའོ་༽ཡིན་པར་བཤད།༼སྤྱི་དོན་༣་པ་སྤྱོད་པའི་ཕན་ཡོན་ ས་མིན་ཏན་རྡ་འམ་ཡང་ན་སཾ་བྷ་ར་རང་གི་བཤད་རྒྱུད་གསུང་༽ །རྣལ་འབྱོར་པས་ནི་རྟག་ཉིད་དུ། །གཙང་སྦྲ་འདི་དག་རབ་བསྐྱངས་པས།༼ གསུམ་པོ་ཐུན་མོང་ཞི་སོགས་དང་མཆོག་དང་ཕྱག་རྒྱ་ཆེན་པོ་མཆོག་གྲུབ་ཆེན་རྣམས་བུ་ཏའི་རིམ་པས་སོ་༽ །གཙང་མ་དག་པའི་རིམ་ཐོབ་ནས། །དངོས་གྲུབ་༼གཞན་༽གང་ལས་༼ཀྱང་༽འབྱུང་༼པར་༽མི་འགྱུར་༼དེ་འདི་ཁ་ནས་བྱུང་ཅེས་པའོ༽། །དེ་ཉིད་བསྡུས་པར་༼བཟླས་པ་ལ་སོགས་པས་འགྲུབ་པར་༽གང་གསུང་དང་། །དེ་བཞིན་བདེ་མཆོག་ལས་གང་གསུང་༼དེ་ལྟ་བུའི་དོན་འདི་ལས་བསྟན་པས་རྒྱུད་ཀྱི་ཆེ་བ་བསྟན་༽། །གསང་བའི་༼འདུས་པ་༽རྒྱུད་ལས་༼ཡང་ན་ཐམས་ཅད་ནས་རྒྱུད་གསུང་༽ཡང་དག་བཤད། །དེ་བཞིན་དཔལ་མཆོག་དང་པོ་དང་། །རྡོ་རྗེ་འཇིགས་བྱེད་ཉིད་ལས་གསུངས། །༼དེ་རྣམས་སུ་བཟླས་པ་དང་འཁྲུལ་འཁོར་ལ་སོགས་པས་ལས་འགྲུབ་པར་གསུང་པ་དེ་༽བཟླས་དང་བརྟུལ་ཤུགས་སོགས་པས་༼དངོས་༽འགྲུབ་༼གྲུབ་པར་གསུངས་པ་དང་༽། །དེ་༼བདེ་མཆོག་ཉུང་ངུ་འང་༽འདིར་༼གོང་གི་འཁྲུལ་འཁོར་ལ་སོགས་པ་ལ་མི་ལྟོས་པར་བསམ་གཏན་ཁོ་ནས་འགྲུབ་ཅེས་པའོ་༽བསམ་གཏན་ཙམ་གྱིས་ནི། །༼ཕོ་ཉ་ཕྱིས་གོམས་པའི་༽སྔགས་པས་སྐད་ཅིག་གིས་༼ཕྱག་རྒྱ་ཆེན་པོའི་དངོས་གྲུབ་༽འགྲུབ་འགྱུར། །༼ཕོ་ཉ་དངོས་སུ་མིན་པའམ་ཡང་ན་ཕོ་ཉ་དངོས་སུ་བསྟེན་པར་མི་འདོད་ན།ཕོ་ཉ་མ་ཡིན་པར་ཕག་མོ་ལ་སོགས་པ་ཡིད་ཀྱིས་སྤྲུལ་པའི་རིག་མ་༽རྣལ་འབྱོར་ལམ་ལ་དགའ་བས་ཀྱང་། །༼ཐ་མ་སྣོད་གཅིག་ཏུ་བཟའ་བ་གསུང་༽གཙང་སྦྲ་འདི་ནི་ཡང་དག་སྤྱད། །བསོད་ནམས་༼སམ་དངོས་གྲུབ་༽གཙང་སྦྲ་ལས་༼གསུམ་འམ་ཐ་མ་ལས་གསུང་༽ལས་བྱུང་གང་། །བསྒྲུབ་པོའི་ཡོན་ཏན་རྒྱ་ཆེན་པོ།༼ ཚོགས་ཀྱི་འཁོར་ལོ་དང་གསང་བའི་པུ་ཙ་གཉིས་ལ་གནས་པའི་༽ །སྟོང་ཕྲག་གཅིག་པའི་༼ལ་ཝེ་བརྒྱ་བརྒྱ་ཡོད་པས་བརྗོད་པ་༽གདོང་མིན་པར། །ཁ་ཅིག་༼དང་ཝེ་གཅིག་༽གིས་ནི་༼ཚོགས་ཀྱི་ཕན་ཡོན་༽བརྗོད་༼པར་༽མི་ནུས། ༼དེ་ལྟ་བུ་འབྱུང་བ་ཡང་གང་གི་མཐུ་ཡིན་ན་༽ །དཔལ་ལྡན་ཁྲག་འཐུང་༼ང་རྒྱལ་གྱིས་ཕོ་ཉ་བསྟེན་པའི་འོ་༽ཡེ་ཤེས་ཆེ༼ན་པོ་༽། །རྣམ་དག་མཚན་ཉིད་ཀུན་བསྒྲུབ་པའོ་༼འི་མཐུའོ་༽། །༼ཕོ་ཉ་བསྟེན་པའི་བདེ་བ་༽བདེ་བའི་༼བུ་༽བསོད་ནམས་༼ཚོགས་ཀྱི་ཕན་ཡོན་༽ཆུ་༼ཆང་༽འཐུང་བ། །༼དེའི་སྒྲིབ་པ་༽དག་བྱེད་སྡིག་པ་འཇིགས་བྱེད་ཡིན། །༼རྣལ་འབྱོར་པའི་གྷ་ནའི་ཡོན་ཏན་ལྟ་ཞོག་གི་གཞན་ ཚོགས་དེ་ལ་༽རེག་པ་དང་ནི་སྨྲ་བས་ཀྱང་༼གྷ་ན་དེའི་དུས་སུ་༽། །སྡིག་པ་ཀུན་ལས་རྣམ་གྲོལ་ཞིང་། །༼ལས་དང་པོ་པས་མི་དགེ་བ་བཅུ་བསྡམས་སྟེ་༽ལུས་ངག་སྐྱོན་ནི་མེད་པ་ཡི། །གང་ཞིག་སྤྱོད་པ་བྱེད་པ་ཡི། །༼གཙོ་བོས་ཚོགས་ཀྱི་དུས་སུ་༽མི་མཆོག་སྡིག་པ་ཐམས་ཅད་ནི། །རྣམ་༼པར་༽དག་༼ནས་༽བདག་ཉིད་བདེ་གཤེགས་ཀྱི་༼ས་བཅུ་རིམས་ཀྱིས་བགྲོད༽། །ས་རྣམས་ཀྱང་ནི་་་་་་་་འབྲས་བུ་ཕྱག་རྒྱ་ཆེན་པོ་་་་་ཐོབ་པར་འགྱུར། །སྐྱེ་ཞིང་་་་་བུདདྷ་མ་ཐོབ་ཀྱི་བར་ཡང་་་་སྐྱེ་་་་སྐྱེ་བ་ནས་སྐྱེ་བ་དྲན་་་་་བར་་་་་དེ་བཞིན་གཤེགས་་་་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་བསྐྱེད་པ་དང་རིགས་ལ་གནས་པ་ལ་སོགས་པར་འགྱུར་་་། །རིགས་་་་་་སུ་་་་་འགྱུར་ཆོས་ལྡན་རྒྱལ་་་་དེ་མ་ཐོབ་བར་དུ་ཡང་་་་་པོར་འགྱུར་་་་་་འཁོར་ལོ་བསྒྱུར་བ་་་་། །དེ་ལྟར་་་་་སྤྱི་དོན་བཞི་བ་་་་་རྟག་ཏུ་་་་་་་་སངས་རྒྱས་ལ་ཚོགས་ཀྱི་་་་་་་མཆོད་བྱས་ནས། །་་་་ཞིང་སྐྱོང་རྣམས་ལ་་་་་་་དད་པ་ཡིས་ནི་༼བྱ་བ་གཉིས་པ་དམ་ཚིག་ཅན་གཏོར་མ་སྦྱིན་པ་་་་་་གཏོར་མ་སྦྱིན། །༼དཀྱིལ་འཁོར་ཆོ་ག་སྒྲུབ་ཐབས་ནས་བྱུང་བ་བཞིན་དུ་བསྒོམ་པ་སྔོན་སོང་ནས་༽ཇི་བཞིན་ཆོ་གའི་སྦྱོར་བ་ཡིས། །༼འགྲོ་ན་རང་ཡང༽དད་པས་ཅི་འདོད་སྦྱིན་པར་བྱ༼ཏེ་མི་མོས་ན་བཟློག་པ་ལ་སོགས་ནུས་པ་ཐོབ་པས་བྱ་འོ༽། །མར་གྱི་ངོ་ཡི་ཚེས་བཅུ་དང་་་་་ཚེས་བཅུ་གཉིས་ལ་། །ཟླ་བ་ཡར་ངོར་གང་གྱུར་དང་། །༼གྷ་ན་དང་གཏོར་མ་ལ་༽མྱུར་དུ་འབད་པས་མཆོད་བྱ་སྟེ། །༼ཡུལ་གང་ལ་མཆོད་ན་འཇིག་རྟེན་གྱི་དེ་བ་ལོ་ཀ་ལས་འདས་པ༽རྡོ་རྗེ་ལྷ་མོ་༼རྒྱུ་གང་གིས་མཆོད་ན་༽མྱོས་བྱེད་༼ཆང་དང་༽ཤས། །སྐྱེ་བོ་༼བསྒྲུབ་པ་པོ་དུས་མཆོད་ན་༽དད་པས་མཆོད་བྱ་ཞིང་། །ཧེ་རུ་ཀ་དཔལ་མངོན་དགའ་ཞིང་། །མགུ་བའི་སེམས་མཆོག་དག་དང་ནི། །༼ལོ་ཀ་དང་ལོ་ཀ་ལས་འདས་པའི་མཐིལ་ན་གནས་པའི་དཔལ་༽དེ་རྣམས་༼ཀྱིས་༽ལག་ནས་མཆོག་སྟེར་བྱེད། །༼ཟླ་བའི་དུས་ཚེས་བཅུ་རྣམ་པ་གཉིས་ཡིན་པ་ཉིན་ཞག་གི་དུས་ནི་༽མཚན་མོ་བརྟུལ་ཞུགས་ཅན་གཏོར་མ། །༼ཆ་ལུགས་༽སྐྲ་གྲོལ་གཅེར་བུར་གྱུར་བས་སྦྱིན། །ཤྲཱི་ཧེ་རུ་ཀའི་བདག་ཉིད་༼་ཀྱི་ང་རྒྱལ་༽ཤེས༼པའི་ལ་ལ་ངན་ཏི༽། །༼ཞིང་སྐྱེས་སྔགས་སྐྱེས། ཞིང་སྐྱེས་ལ་སོགས་དུར་ཁྲོད་ཀྱི་བདག་པོ་བརྒྱད། དཔའ་བོ་དཔའ་མོ་གཞི་གཅིག་ལ་ལྡན་པ༽སྦྱོར་བས་མ་མོ་རྣམས་མཉེས་འགྱུར། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས། ༼མ་སྲིང་ལ་སོགས་པའི་ཡོན་ཏན་དང་ལྡན་པ་ལ་སྤྱོད་པའི༽ །སྤྱོད་པ་༼སྤྲོས་བཅས་༽་དང་བརྟུལ་ཞུགས་༼དགོས་པ་གང་གི་ཆེད་དུ་རུས་པའི་རྒྱན་དྲུག་ལ་སོགས་པ་བཏགས་ནས་སྤྱོད་པ་བྱེད་པ་༽དང་༼ཚོགས་ཀྱི་༽མཆོད་པ་དང་༼ལོ་ཀ་ལས་འདས་པའི་བུ་ཏ་ལ་༽གཏོར་མའི་ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་བདུན་པའོ། །༼མཚམས་འདི་ནས་མཐུད་ན་སྐྱོན་འབྱུང་༽ །༼གོང་དུ་བསྟན་པའི་སྤྲོས་བཅས་ཀྱི་སྤྱོད་པ་བྱེད་པའི་ག་གེ་བྱ་བ་དང་བྱ་བ་མ་ཡིན་པ་བསྟན༽དེ་༼དང་པོ་བདག་གཞན་གཉིས་མཆོད་པའི་བྱེ་བྲག་བསྟན༽ནས་༼བཟའ་བ་དང་བཏུང་བ་ལ་སོགས་པ་༽མཆོད་པ་རྣམ་༼་པར་༽དག་༼པའི་༽བདག་༼ཉིད༽། །༼པཱུ་ཙའི་དགོས་པ་༽མྱ་ངན་འདས་༼ཐམས་ཅད་མཁྱེན་པར་འགྲོ༽་པར་ངེས་༼པར༽འགྲོ་དཔའ༼བར་གྱུར་བའོ༽། །༼གཉིས་པ་པུ་ཙའི་ཡུལ་དང་པོ༽དེ་བཞིན་བདག་ཉིད་མཆོད་པ་དང་། །༼གཞན་ཡང་མཆོད་པའི་དབང་དུ་བྱས་སྟེ།_ཡབ་ཡུམ་གཉིས༽སངས་རྒྱས་ཀུན་སོགས་སྲས་༼ཏེ་བོར་་པར་དངོས་དང་ཉམས་ལ་སོགས་པ་ ་ལྷག་པའི་ལྷར་བྲེས་པར་བྱ་༽བཅས་དང་། །༼ཡུལ་གསུམ་པོ་༽དཔའ་བོ་༼སྐྱེས་པ་རང་དཔའ་པོར་མོས༽ཀུན་དང་རྣལ་འབྱོར་མ། །༼རྟེན་གཞལ་ཡས་ཁང་༽བརྟན་པ་དག་དང་གཡོ་༼པར་བཅས་པ་མཆོད་༽བ་དང་། །༼ཡུལ་བཞི་བ་ལོ་ཀ་པའི་འབྲེལ་བ༽སྤུན་དང་༼ཆོས་ཀྱི་འབྲེལ་བའི་དབང་དུ་བྱས་ན་སྤུན་རྡོ་རྗེ་ཤུགས་བརྩེ་སེམས་ཆེ་བའོ༽་བསྔགས་པ་༼དམ་ཚིག་ཅན་ལ་བཟའ་བ་ལ་སོགས་པ༽མཆོད་པ་སྟེ། །༼རྣལ་འབྱོར་མ་རྣམས་ལེགས་པར་ཇི་ལྟར་མཆོད་ན།ཐབས་དང་ཤེས་རབ་སྙོམས་པར་ཞུགས་པའི་བདེ་བས་མཆོད༽ལེགས་གནས་ཟླ་བ་འདུས་པ་ལའོ། །་་་༼འཇིག་རྟེན་པའི་འབྲེལ་བ་ལ་ཇི་ལྟར་བྱ་ན་༽་་་་སྤུན་དང་བུ་དང་ལྷན་གཅིག་ཏུ། །༼ཟས་ལ་སོགས་པ་ལ་ལྷན་གཅིག་ཏུ་སྦྱར༽བདེ་དང་སྡུག་བསྔལ་༼བདེ་བར་སྤྱད༽ཀུན་༼དེ་དག་དང་ལྷན་ཅིག་ཏུ་སྤྱད་པར་བྱའོ༽འབྱུང་ཡིན། །སྔགས་༼དེ་དང་ལྡན་པ་རུ་གང་མི་བྱ་ན༽དང་དེ་བཞིན་༼ཨོཾ་ཨཱཿཧཱུཾ་སྩོགས་ཀྱིས་༽ཕྱག་རྒྱ་དང་། །༼ལོ་ཀ་བའི་འགྲེལ་བ་ལ། རྫོགས་རིམ་དེ་ཁོ་ནའི་དོན༽ །ཡེ་ཤེས་དེར་ནི་བསྟན་མི་བྱ། །༼དེ་ཅིའི་ཕྱིར་ཞེ་ན།དེ་བསྙེས་པས་བླ་མ་ལ༽མ་དད་ཐམས་ཅད་༼སྐྱེད་པ་དང་།བླ་མ་ལ་༽སུན་འབྱིན་༼པར༽བྱེད༼པའི༽། །༼རྟོག་པ་དག་པར་བྱེད་པ་བདུད་རྩི་ལྔ་ལྕེ་ལ་འཇོག་པ་ཨ་ཏྲོ་རེས་འགྲོ་སྟེ་བདུད་རྩི་ལྔ་རིགས་ལྔའི་ངོ་བོར་བྲེས་པར་བྱ་བས་ན་༽དག་བྱེད་ཟས་ལ་སྤྱོད་པ་ནི། །རྟག་ཏུ་དམ་ཚིག་སྤྱད་བྱས་འགྱུར། །༼གཞན་སགས༽གསང་སྔགས་༼རྩ་བའི་སྔགས་ལ་སོགས༽སུ་ལའང་སྦྱིན་མི་བྱ། །༼དབང་མ་རྫོགས་པ་ལ་བཞི་བའི་དེ་ཁོ་ན་ལ་སོགས་མི་བསྟན༽མན་ངག་རྣམ་པར་ཉམས་མི་བྱ། །༼དབང་རྫོགས་པ་ལ་བཞི་བའི་དེ་ཁོ་ན་བསྟན༽དམ་ཚིག་གནས་ལ་ཅི་རིགས་པར། །༼བཞི་བའི༽མན་ངག་རྣམས་ཀྱང་སྦྱིན་པར་བྱ། །༼རང་གི་དམ་ཚིག་ལ་སོགས་པ་བསླབས་པའི་རང་གི་ཕྱག་རྒྱ་ཊོཾ་བྷི་སོགས་མ་གཏོགས་པ་ཐ་མལ་པའི་བུད་མེད་༽ཕོ་ཉ་མ་གཏོགས་གཞན་དག་ལ། །འདོད་༼པ་ལ་ཆགས་པའི་ཏ་མལ་བའི་འདོད་ཆགས་༽ལ་རྨོངས་པས་འགྲོ་༼བགྲོད་པར༽མི་བྱེད། །༼ཅིའི་ཕྱིར་ན་༽ཕོ་ཉ་མོ་༼ས༽ཞེས་རྟག་༼ཏུ༽ཐར་བ་བས་ཏེ། །༼གཉིས་པ་་་་་་བྱེ་བྲག་བཟའ་པའི་དམ་ཚིག་བདུད་རྩི་ལྔ་ལ་ལོངས་སྤྱོད་པར་བསྟན།དེ་ཉིད་བདུད་རྩི་ལྔ་རིགས་ལྔའི་ངོ་བོ་ཡིན་པས་བསྲུང་བའི་དམ་ཚིག་ལ་ཡང་༽འབད་༼བདལ་ཟེར༽པ་ཡིས་༼རྩོལ་བ་དྲག་པོས་༽ཀྱང་ལོངས་སྤྱོད་༼བརྟེན་པར་༽བྱ། །༼དེ་ཡང་གདོལ་བ་མོ་ལྟ་བུ་༽སྐྱེ་གནས་དམན་ལ༼བསྙེན་བསྐུར་དང་བརྟེན་པ་ལ༽་མི་གནས་༼པ་ནི་རིགས་བཟང་པོས་སྟེ་དེ་ཁོ་ན་ལ༽་ལ། །༼དོན་གྱི་སྔགས་གདོལ་བ་མོ་ལ་བརྟེན་ན་དེ་ཉིད་ལ་བསྙེན་བསྐུར་བྱ་ཡི།བྲམ་ཟེ་མོ་ལ་སོགས་པ་བཟང་པོར་མི་བཟུང་ཅེས་པའོ༽བསྙེན་བསྐུར་ཉིད་ནི་བྱ་བ་མིན། །༼ཡོན་ཏན་སྐྱེད༽མ་དང་སྲིང་མོ་༼བརྟེན་པའི་ཕོ་ཉའི་ཡོན་ཏན་གྱི་བྱེ་བྲག་༽བུ་མོ་༼ངག་སྙན་༽དང་། །༼བདེ་བསྐྱེད་༽ཆུང་མ་ཕོ་ཉ་མོ་ཉིད༼དངོས་གྲུབ་ཀྱི་བྱ་བ་བྱེད་པས༽་གནས། །༼དེ་ལྟ་བུའི་ཕོ་ཉ་ལ་ཡོན་ཏན་ལྡན་པས་བརྟེན་པའམ་ལྔ་ཆར་བརྟེན་ཡང་ལོ་ཀ་གཅིག་ཏུ་བརྟེན་ན་ནུས་ཐོན་པས་སྟེ་དགོས་པས།སྔར་དཀྱིལ༽འཁོར་ལོས་དེ་བཞིན་གྲུབ་པ་ལ། །༼ནུས་པ་ཡོད་ན་བརྟེན་གྱིས༽གཞན་དུ་༼ནུས་པ་མ་ཐོན་པས༽བྱ་བ་མ་ཡིན་ནོ། །༼ནུས་པ་མ་ཐོན་པར་བྱས་ཏེ་བརྟེན་ན་༽དཀའ་ཐུབ་༼སྡོམ་པ་ཡོད་པ་དེ༽ངེས་པར་༼ཟད་པའི་ཚུལ་གསུམ། གསང་བ་བསྒྲགས་པའི་རྩ་ལྟུང་དང་ལྔ༽ཟད་པར་འགྱུར། །༼ལྷན་ཅིག༽མཆོག་དབུས་༼ཞིང་སྐྱེས།སྔགས་སྐྱེས།༽ཐ་མ་ལྷན་གཅིག་༼སྔགས་སྐྱེས་ལ་ཞིང་སྐྱེས་སུ་ཞེན་པ་བྱས་པ་ལ་སོགས་པས་ལྷན་སྐྱེས་ལ་བསྐུལ་བས་ཆོས་སྐུ་རྟོགས་པ་འབྱུང་བས༽འགུགས༼པས་ན༽། །དེ་ལྟར་༼ཕོ་ཉ་མོའི་༽རྫས་ནི་༼སི་ཏི་འགྲུབ་པར་༽རྣམ་ངེས་ཡིན། །༼བཞི་བ་སྤྱོད་ལམ་དང་ཕྱག་རྒྱ་གཉིས་ལས། དང་པོ་སྤྱོད་ལམ་གྱི་བྱེ་བྲག་བསྟན༽འཇིག་རྟེན་ན་རྟག་༼རྒྱུ་བས་ན༽གཡོན་ནས་སྤྱོད༼གང་དུ་འགྲོ་བ་ལ་སོགས་པ་བྱེད་པ་དང་༽། །རྐང་བ་གཡོན་པ་སྔོན་ལ་འདོར། །༼ལག་པ་བྱ་བ་གང་བྱེད་དང་༽ལག་པ་གཡོན་པ་སྔོན་དུ་འགྱུར། །གཡོན་གྱི་སྤྱོད་པས་རབ་མཆོད་བྱེད། །༼གོས་ལ་སོགས་པ་གྱོན་པ་ན་ཡང་༽ལུས་ཀྱི་གཡོན་ནི་རྣམ་པར་འཁྲི༼འཇིག་རྟེན་པ་གཡོན་གྱི་བྱ་བ་ལ་མི་གཙང་པར་བྱེད་དེ། དེ་ལས་གོ་བཟློག་པས་དཔྱད་པའི་དགོས་པའོ༽། །༼ཟས་ལ་ལོངས་སྤྱོད་པ་ན་ཡང་༽གཡོན་པ་ཡིས་ནི་ཚིམ་པར་བཟའ༼ལག་པ་གཡོན་པས་ནི་བུད་མེད་མཚོན་ལ་བུད་མེད་ཀྱིས་ཤེས་རབ་མཚོན་པ་ཡིན་ལ་ཤེས་རབ་ཀྱིས་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལས་ཆོས་ཐམས་ཅད་འབྱུང་བ་ཡིན་པར་མཚོན་པའོ༽། །བརྟུལ་ཞུགས་མ་ཉམས་བརྟུལ་ཞུགས་རྫོགས། །༼ལས་དང་པོ་དང་སྤྱོད་པའི་དུས་གཉིས་ཀར༽བསྒྲུབ་པོ་དེ་ནི་དམ་ཚིག་བརྩོན། །དམ་ཚིག་༼ཅན་གྱི་རིགས་ལ་རིགས་སུ་བྱེད་པས་༽རིགས་ལ་༼དམ་ཚིག་ཅན་གྱི་༽སྤྱོད་པ་ཡིས། །༼པར་བྱ་བ་ཡིན་གྱི་ཐ་མལ་བའི་རྒྱལ་རིགས་ལ་སོགས་པ་ལ་རིགས་སུ་མི་བྱེད་པ་༽ལྷན་ཅིག་༼ཏུ་༽ཟས་ལ་༼ལོངས་༽སྤྱོད་པར་བྱེད་༼པས༽། །༼འདི་ཉིད་ཀྱི་གཉིས་པ་ཕྱག་རྒྱ་ནི་༽རིགས་ལྔ་རྒྱལ་རིགས་བྲམ་ཟེ་རྗེ་རིགས་དམངས་རིགས་མཐར་སྐྱེས་སམ་གདོལ་པ་མོ་དང་ལྔ་༽ལ་ནི་ཀུན་སྤྱོད་པའི། །༼ལོ་ཀ་ལ་གྲགས་ཚད་༽རིགས་ནི་རྣམ་པ་༼མཐར་སྐྱེས་སམ་གདོལ་པ་མོ་དང་དམངས་རིགས་སུ་བྱས་པས་༽བཞི་རུ་གྲགས། །༼ཡང་རྒྱལ་རིགས་བྲམ་ཟེ་གཅིག་ཏུ་བྱས་ཏེ་གསུམ་དུ་ཡང་བྱ་སྟེ་གསུམ་ཡང་རྡོ་རྗེ་སེམས་དཔའི་རིགས་སུ་བྱས་པས། རེག་མིན་གཡུང་མོ་སྟེ་ཐམས་ཅད་ལ་རིགས་བཟང་ངན་མེད་པའོ༽རིགས་གཅིག་ལ་ནི་ཀུན་སྤྱོད་པ། །རྣལ་འབྱོར་༼པས་དངོས་གྲུབ་ཀྱི་ལྷའི་རྣལ་འབྱོར་བསྟན་པས་༽གྲུབ་དོན་༼སྙོམས་པར་ཞུགས་པས་དོན་ལྔ་ལ་སྦྱིན་བསྲེག་གི་བྱ་བའི་བྱེ་བྲག་གསུམ་བསྟན་པ་ལས་ཕྱིའི་༽རབ་ཏུ་མཆོད། །༼སྤྱོད་པའི་དུས་ཀྱི་ཁྱད་པར་ནི་རོ་མ་པའོ༽བ་ལང་ཤ་དང་རྟ་ཤ་དང་། །ཁྱི་ཤ་དག་དང་༼ཁྱི་བྱ་ལ་སོགས་པ་བྱ་སྣ་ཚོགས་པའི་ཤ་༽སྣ་ཚོགས་པས། །༼དེ་ཡང་རྡོ་རྗེའི་བྱེ་དང་ལྕགས་བྱེ་ལ་སོགས་པ་བསྲེས་ཏེ་༽དཀྱིལ་འཁོར་གྲུ་གསུམ་༼དུ་སྐྱེད་ནས་དེའི་ནང་དུ་བཅོམ་ལྡན་འདས་གཙོ་བོ་སྐྱེད་ལ་དེ་ནས་ཡི་གེ་བདུན་པའི་ཤ་བུར་མ་ར་ཡ་ལ་སོགས་པའི་སྔགས་བཏགས་རྫས་བསྲེག་༽བྱས་ནས་ནི། །༼རྫས་དེ་རྣམས་ཀྱིས་དྲག་པོའི་སྦྱིན་བསྲེག་བྱས་ནས་༽སངས་རྒྱས་རྣམས་ཀྱང་ངེས་པར་འཇིག་༼ན་ཐ་མལ་པའི་མི་བུ་ལ་སྨོས་ཅི་དགོས༽། །དེ་བཞིན་༼ནང་གི་སྦྱིན་བསྲེག་༽དཔའ་བོ་༼དང་རྣལ་འབྱོར་མ་༽རྣམས་ཀྱི་ཟས་༼ཡར་གྱི་ཚེས་བཅུ་དང་མར་གྱི་ཚེས་བཅུ་ལ་མཆོད་༽། །༼ཨོཾ་ཨཱཿཧཱུཾ་ལ་སོགས་པ་༽སྔགས་དང་༼འཐེབ་སྲིན་སྦྱར་བ་༽ཕྱག་རྒྱར་ལྡན་པའི་སྨན༼བདུད་རྩིར་བྱས་པས་༽། །༼དཀྱིལ་འཁོར་སྙིང་ཁར་༽ཤྲཱི་ཧེ་རུ་ཀའི་སྤྲུལ་བ་༼བསམ་ལ་ཟས་ལ་༽ནི། །ཉེར་༼བར་༽སྤྱོད་༼པ་འདི།ཕ་རོལ་དུ་ཕྱིན་པའི་༽བསྟན་བཅོས་ཀུན་ལས་སྤངས༼ཡང་ན་ལྟེ་བ་ལ་མེ་སྦར་དེ་སྙིང་ཁར་མེ་བསམ་པ་ལ།མེ་ཏེ་མི་ཤེས༽། །༼རྣལ་འབྱོར་རྒྱུན་མ་ཆད།རྒྱུན་དུ་བྱ་བའི་རྣལ་འབྱོར་ཁོ་མཉམ་པར་བཞག་པའི་རྣལ་འབྱོར་ལ་སོགས་་་་ ་ ༽རྣལ་འབྱོར་༼ཁ་ཟས་ཀྱི་སྣོད་དུ་མ་ཟད་༽རྟག་ཏུ་སྲུང་བ་དང་། །༼དེ་ལ་གནས་ན་༽ལས་རྣམས་དག་ནི་༼ཞི་བ་ལ་སོགས་པ་བསྒྲུབ་པའི༽ཐམས་ཅད་ལ། །༼ཕྱིའི་ཧོམ་ལ་བར་ཆད་འབྱུང་གི་ནང་གི་ཧོམ་བར་ཆད་མི་འབྱུང་གསུང་༽བགེགས་མེད་༼པར་ལྟ་བ་༽ཇི་བཞིན་༼སི་ཏི་གཉིས༽འགྲུབ་༼པར༽འགྱུར་བར། །༼སྐབས་༽འདིར་ནི་གཞན་དུ་༼མི་འགྲུབ་ལ་དོར་༽རྟོགས་མ་ཡིན། །༼དྲུག་པ་ཕོ་ཉ་བསྟེན་པའི་ཕན་ཡོན་དཔེ་དང་དོན་གྱི་ལྷན་ཅིག་སྐྱེས་པ་མངོན་དུ་འགྱུར་བ་༽འདི་ནི་ཕོ་ཉ་༼འདི་བླ་ན་མེད་པའི་སྦྱིན་བསྲེག་ཡོད་༽མཆོག་༼དབང་བསྐུར་བཞི་བའི་དམ་ཚིག་བསླབ་པ་༽བཟང་པོ། །༼དེ་སྟོན་པ་ལ་༽བརྩོན་ཞིང་ལྷན་ཅིག་ལྡན་པ་ཡིན། །ཆགས་པས་༼རྡོ་རྗེར་བརྟེན་ན། ཟླ་བ་ཕྱེད་དུ་འཇམ་རླུང་ལ་བསྒྲུབ་པ་བྱའོ་༽དགའ་བའི་ལོངས་སྤྱོད་༼དེས་ཡེ་ཤེས་ཀྱི་བདེ་བ་༽རྫོགས་༼པར་བྱ་༽། །༼དེ་གང་ཞེ་ན་༽རྣལ་འབྱོར་རྫས་ནི་རྣམ་འབྱེད་ཉིད། །བླ་མའི་མན་ངག་༼ལས་དོན་གྱི་བཞི་བའི་རྟོགས་པ་སྐྱེ་བས། དགའ་བ་ལ་སོགས་པ་གསུམ་སྔོན་དུ་ལྷན་སྐྱེས་རྟོགས་པར་བྱས་པས།དོན་གྱི་བཞི་བ་གོམས་པ་ལས་མཐར་ཆོས་སྐུ་རྟོགས་པ་དེ་ལས། རྒྱུ་སྐུ་ལ་ཅི་དང་ཅི་འདོད་པ་འབྱུང་བ་༽ལ་༼ས་༽དགའ་ཞིང་། །དེ་ནི་སྦྱིན་བདག་༼ཛཾ་བྷ་ལ་དང་འདྲ་ཅེས་པ་གསུང་༽མཆོག་༼ཏུ་༽གསུངས་པའོ།དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼ཕྱིའི་ཧོམ་དང་བླ་ན་མེད་པའི་ཧོམ་ཡང་ཡོད་༽ནང་གི་སྦྱིན་བསྲེག་དང་༼སྤྲོས་བཅས་ཀྱི་སྤྱོད་པ་གང་གི་ཕོ་ཉ་བརྟེན་པའི་ཐབས།༽རིགས་ལྡན་མའི་ཆོ་གའི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་བརྒྱད་པའོ། །༼གོང་དུ་བསྟན་པའི་ཚུལ་གྱིས་ཕོ་ཉ་མོ་བསྟན་པ་ལས་ལྷན་ཅིག་སྐྱེས་པའི་ཡེ་ཤེས་སྐྱེ་བས་དེའི་སྐྱེད་པའི་རྐྱེན་ཕོ་ཉ་མོའི་མཚན་ཉིད་བསྟན། ལས་དང་པོ་པས་གསང་བ་བསྟེན་པ་ནུས་པ་ཐོབ་པ་མངོན་དུ་བརྟེན་པ་ནུས་པ་མ་ཐོབ་པར་སྔོན་དུ་བརྟེན་པའི་ཉེས་པ་སཾ་བྷ་རའི་ཛོ་ཀིའི་ཆེ་བ་སྟེ་བཞི་སྟོན་ནོ། སྦྱོར་བའི་རྒྱན་བསྟན་པའི་ཕྱིར་༽དེ་ལས་གཞན་ཡང་༼སྔར་ལས་ཚུལ་གཞན་གྱི་༽བསྟན་པ་ནི། །༼སྤྲོ་༽ས་བཅས་༽ཕོ་ཉའི་༼གསང་རྩ་ཁྱད་པར་ཅན་གྱི་༽མཚན་ཉིད་ཤེས་བྱ་བ། །༼དབང་དང་༽དམ་ཚིག་ལ་༼ཐ་མལ་བའི་བུད་མེད་གནས་༼པའི་༽མཁའ་འགྲོ་མར། །གང་གིས་ཡང་དག་ཤེས་༼རིགས་ཀྱི་རྟགས་དང་ལུས་ཀྱི་བརྡའ་དང་ངག་བརྡའ་ལ་སོགས་པས་ངོ་ཤེས་པའི་རྣལ་འབྱོར་མ་དེ་རྣམས་ཀྱིས་ཀྱང་བསྒྲུབ་པ་པོ་མཐོང་ན་འདི་ལྟ་བུར་ཤེས་ཞིང་ཡིད་དུ་འོང་བར༽འགྱུར་པའོ། །༼ཡོན་ཏན་སྐྱེད་པའི་༽མིང་པོའམ་ཡང་ན་ཕ་དངནི།༼གོང་དུ་བསྒྲུབ་པ་པོ་ལ་ཕྱག་རྒྱ་གཅིག་ལ་ཡང་མ་ལ་སོགས་པའི་ཡོན་ཏན་དང་ལྡན་པར་ཤེས་པས་བརྟེན་པ་ལྟར་ཕྱག་རྒྱས་ཀྱང་བསྒྲུབ་པ་པོ་ལ་སོགས་པའི་ཡོན་ཏན་དང་ལྡན་པར་ཤེས་དགོས་པ་གསུང་༽ །༼ཁྱོ་རུ་བདེ་བ་སྐྱེད་པ་དང་༽བདག་པོ་ཉིད་དུ་སྐད་ཅིག་༼བྱ་བ་བྱེད་པའི་ཕོ་ཉ་རུ་མཐོང་ངག་སྙན་པས་བར་༽མཐོང་། །༼རིགས་༽ལྕེ་༼རིང་བ་སྨིན་ཕྲག་ཏུ་སླེབ་པ་༼འདི་ལ་གསང་རྩ་ཁྱད་པར་ཡོད་གསུང་༽སྦོམ་༼པ་དང་༽མིག་ནི་དམར་སེར་ལ། །༼སྤུ་༽རྩུབ་ཀྱང་སྤུ་ནི་དམར་སེར་ཡིན། །དངོས་གྲུབ་༼ཀྱི་རྒྱུ་༽ཀུན་གྱི་ཐུན་མོང་དུ། །༼རྒྱུད་སྦྱངས་པའི་མཚན་ཉིད་༽བཟླས་༼པ་༽དང་བརྟུལ་ཞུགས་ལ་རྟག་དགའ། །དྲན་པ་དང་ནི་ཡང་དག་ལྡན། །ཕོ་ཉ་མ་སོགས་༼སྔགས་སྐྱེས་ལ་སོགས་པ་ཡང་ཞིང་སྐྱེས་ཉི་ཤུ་བཞི་བོ་དེ་༽གནས་དང་བཅས། །༼དེ་གང་ཞེ་ན་༽མཁའ་འགྲོ་མ་མཆོག་ཉི་ཤུ་བཞི༼ར་མོས་༽། །སྤྱོད་དང་གྲོལ་བའི་༼མཆོག་སྔགས་སྐྱེས་བརྟེན་པ་ཡང་ཞིང་སྐྱེས་སུ་ཞེན་བརྟེན་༽འབྲས་བུ་སྟེར། །འདོད་པའི་དོན་ཀུན་༼ཐུག་པར་༽གྲུབ་བྱེད་པའི༼ཝི་རེ་ཤ་ཡ་༽། །༼ཐ་མལ་བའི་རྩ་སྔགས་སམ་ལྷན་གཅིག་སྐྱེས་པའི་ཡེ་ཤེས་དང་ནང་དུ་མི་འབྲལ་བ་ཐ་མལ་པ་ལ་ཝི་རེ་ཤ་བའམ་༽རྩ་བའི་སྔགས་ནི་རྟག་ཏུ་ཟློས། །བདུད་༼དང་བར་ཆད་༽ཀུན་རབ་ཏུ་ཞི་བར་བྱེད། །རྒྱུ་དང་མི་རྒྱུ་འཇིག་རྟེན་གསུམ༼དུ༽། །རྣལ་འབྱོར་རོལ་བའི་༼རྩ་སྔགས་བཟླས་ན༽འབྲས་བུ་༼འམ་ལྷན་སྐྱེས་ཀྱི་༽སྟེར། །༼ཐ་མལ་པ་དང་ལྷན་སྐྱེས་༽གསང་སྔགས་འདི་ལས་བྱུང་བ་༼དང་ཞིང་སྐྱེས་གཉིས་ཀར་ཚང་༽ཡིན། །༼དང་པོ་ཨོཾ་ཨཱཿཧཱུཾ་ལ་སོགས་པ་ཡང་གསུང་༽སྔགས་དང་༼རེ་སྦྱོར་བར་གསུང་༽ཕྱག་རྒྱ་ཡང་དག་༼རྫོགས་པ་ལས་སོ་སོའི་ལས་ཀྱི་ཕྱག་རྒྱ་༽༼འབྲིང་ལ་༽ལྡན། །༼དང་པོ་གསུང་༽སྒྲུབ་བྱེད་༼རབ་ལ་༽བསྒྲུབ་༼ ན་དྷརྨ་མི་ཏྲ་གོམས་པར་བྱེད་པ་གསུང་༼ལས་ཀྱི་ཕྱག་རྒྱ་ལས་དཔེའི་ཡེ་ཤེས་རྟོགས་པར་བྱེད་དོན་༼ལས་དང་པོ་པས་གསང་སྟེ་ཕོ་ཉ་བརྟེན་པ་དང་བྲལ་ན་གསུང་ཡང་ནུས་པ་མ་ཐོབ་པས་ལོ་ཀ་པའི་སྔོན་དུ་བརྟེན་ན་གསུང་༽ལ་རབ་བརྩོན་༼དབང་པོ་རབ་ལ་༽དང་། །༼ལས་དང་པོ་པ་དབང་བོ་ཐ་མ་ལས་མ་མཚོན་ན་ནི་དཔེའི་ལྷན་སྐྱེས་རྟོགས་པར་མི་ནུས་པས། དབངཔོ་ཐ་མ་་ལ་གསུང་༽ཕྱག་རྒྱ་དང་བྲལ་༼ན་ལྷན་སྐྱེས་༽གསང་སྔགས་ནི། །༼བསྒྲུབ་པ་པོ་དབང་བོ་དམན་པ་༽ལུས་ཅན་རྣམས་ལ་༼འདི་ཡན་ཆད་ལས་དང་པོ་པས་ཆགས་པ་ལ་བརྟེན་པའོ་༽བྱིན་༼གྱི་༽མི་རློབ་༼པ་མེད་པའི་ཐབས་མེད་པས་རྟེན་དགོས་པ་དེའོ༽། །ཇི་ལྟར་དྲོ་བའི་བྱ་བ་དག༼ཅེས་པ་གཞན་མི་དད་པ་བཟློག་པའི་ནུས་པ་བདག་ལ་ཡོད་མེད། མི་མོས་པ་བཟློག་ནུས་པའི་བྱ་བ་དག་དེ་ལྟར་ལས་དང་པོ་པས་ཕོ་ཉའམ་ཕྱག་རྒྱ་ལ་བརྟེན་རྩལ་ནུས་པ་ཐོབ་པས་སྨྱོན་པའི་བརྟུལ་ཞུགས་ལ་སོགས་པའི་དུས་སུ་ལོ་ཀ་བའི་སྔོན་དུ་བརྟེན་པར་སྟོན༽ །མངོན་པར་འབད་པས་རྟོགས་པར་བྱ་༼བ་ལ་དེ་ནས་ཕྱག་རྒྱ་དངོས་སུ་བརྟེན། ལུས་ཀྱི་བ་སྤུ་ལ་སྦྲང་མ་མང་པོ་འདུ་བ་འོང་སྟེ་འདི་གླང་པོ་ཅན་ཡིན་མིན་གསུང་། གླང་པོ་མ་དང་པད་མ་ཅན་དང་། རི་དྭགས་ཅན་དང་། དུང་ཅན་དང་། སྣ་ཚོགས་ཅན་མ་དང་ལྔ་ལས་འདིར་དང་པོ་སྦྱོར་ཐབས་༤་ལས་འདི་ཁབ་རྩེ་ལྟ་བུ་དང་སྦྱར་གཞན་ཡང་ཧེ་བཛྲ་ལྟར༽། །འདོད་པའི་དོན་ཀུན་སྒྲུབ་བྱེད་པའི༼གལ་ཏེ་ནུས་པ་མ་ཐོབ་པར་བརྟེན་ཅིང་ལོ་ཀ་བའི་གང་དུ་དཔྱད་ན་༽། །རྣལ་འབྱོར་ཆེ༼ན་པོ་དེ་ལ་ལོ་ཀ་པ་མི་མོས་པ་སྐྱེད་པས༽་ལ་གང་ཞིག་སྡང་༼སྡང་སྟེ་གཞན་སྨོད་པའམ་ཡང་ན་གཞན་མ་དད་པའི་རྒྱུས༽། །ཁྱི་ཡི་སྐྱེ་བ་བརྒྱར་སྐྱེས་ཏེ། །༼ཤན་པ་༽སྨེ་ཤ་ཅན་དུ་སྐྱེ་བར་འགྱུར། །དཔེར་ན་ལ་ལ་མར་འདོད་པས། །འབད་པས་ཆུ་ནི་སྲུབས་གྱུར་ཀྱང་། །མར་གསལ་འབྱུང་བར་མི་འགྱུར་ཞིང་། །༼དེ་བཞིན་དུ་ལས་དང་པོ་པ་མུ་ཏྲ་དང་བྲལ་བའམ།ནུས་པ་མ་ཐོབ་པར་མུ་་་་་་་་་་་་་་་་་མངོན་དུ་བརྟེན་ཀྱང་་་་་་་་་མི་ཐོབ་པོ༽ལུས་ཉོན་མོངས་པར་ཁོ་ནར་ཟད༼དེ་འབྲས་བུ་མི་འབྱུང་བཞིན་དུ༽། །༼རྣལ་འབྱོར་པའི་རྟགས་དང་ཕྱག་རྒྱ༽འཛིན་ཅིང་མཆོད་པར་༼བརྟེན་རྣལ་འབྱོར་བཞི་་་་་་་་་བསྒྲུབ་པ་པོ་གནས་ཡོད་པར་དཔལ་ཧེ་རུ་ཀ་སཾ་བྷ་ར་ཉིད་༽བྱེད་པ་ནི། །༼ལོ་ཀ་བས་རྣལ་འབྱོར་་་་་་་་་སོགས་ལ་སྟེར་བའི་༽འཚོ་བའི་ཐབས་ཀྱི་རྒྱུ་ཕྱིར་རོ། །རྣལ་འབྱོར་གཞན་ལ་བརྟེན་པ་ལ། །བཟང་པོ་༼ཞེས་བོས་གསུང་༽གཞན་ནི་༼ཆོས་ཀྱི་མུ་ཏྲ་དང་ཕྱག་རྒྱ་ཆེན་པོ་ལ་སོགས་པ་༽དོན་མེད་འགྱུར། །རྣལ་འབྱོར་༼རབ་འབྲིང་གསུམ་གང་ལ་ཡང་༽ཆེ་མཆོག་དཔའ་པོ་ནི། །ཡུལ་ཕྱོགས་གང་ན་གནས་གྱུར་པའི། །རིགས་ངན་ཀླ་ཀློ་༼འི་ཡུལ་༽ཡིན་ན་ཡང་། །ཡུལ་དེ་ཡོངས་སུ་བརྟགས་པ་ཡིན། །༼བསྒྲུབ་པ་པོ་༽སེམས་ཅན་རྗེས་སུ་བཟུང་བའི་རྒྱུར། །དེ་རུ་ང་ནི་རྟག་པར་གནས། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་ཕོ་ཉ་མོའི་མཚན་ཉིད་དང་༼ཛོ་གིས་གྲོལ་བ་སོགས་པ་༽ནུས་པའི་སྐབས་ཀྱི་ལེའུ་སྟེ་ཉི་ཤུ་རྩ་དགུ་པའོ། །༼ལེའུ་ལྔ་དང་བདུན་པ་ལ་སོགས་པར་བསྟན་པའི་རྩ་བའི་སྔགས་ལ་སོགས་པའི་དངོས་གྲུབ་ཐམས་ཅད་མྱུར་དུ་འགྲུབ་ཅིང་བར་ཆད་མེད་པར་བྱ་བའི་ཕྱིར་གནོད་མཛེས་ཀྱི་སྔགས་་་་་་་་ལ་དེ་ཡང་་་་་་་་་ཏིའི་གྲོགས་་་འགྱུར་བ་་་་་་་ཀུན་གྱི་་་་་བཏུ་བ་བར་༽་དེ་ནས་གཞན་ཡང་བཤད་བྱ་བ། །༼བསྲུང་བའི་མཆོག་ཏུ་གྱུར་བའི་སྔགས་འདི༽ཤིན་ཏུ་རྙེད་དཀའི་༼ཧྱ་༽དགོད་པ་སྟེ། །༼སུཾ་བྷ་ནི་༽གང་ཞིག་ཤེས་པ་ཙམ་གྱིས་ནི། །༼བར་ཆད་བསལ་བས་༽མྱུར་དུ་དངོས་གྲུབ་གྲུབ་བྱེད་པའོ། །༼སྔགས་བཏུ་བའི་གཞི་གཡམ་པའམ་སྤང་ལེབ་གཅེ་མའམ་དེ་མེད་ན་༽ས་ཡི་ཆ་ནི་མཉམ་ཡིད་འོང་། །༼་་་་་་་བྲི་བའི་གཞི་དང་སྔགས་བཏུ་བའི་གཞི་་་་་་་་༽ཙན་དན་གྱིས་ནི་ཉེ་བར་བསྐུ། །༼བཏུ་གཞིའི༽དྲི་བཟང་དྲི་ལྡན་ས་ལ་ནི། །༼ཉེ་འཁོར་དུ་༽མེ་ཏོག་སིལ་མ་བཅལ་བཀྲམ་ཞིང་། །སྤོས་ཀྱི་དྲི་ཡིས་ཉམས་དགར་བྱས། །༼བདག་ཉིད་སྐད་ཅིག་གིས་རྣལ་འབྱོར་ལ་སོགས་པས་ལྷག་བསམ་ལ་༽བདག་གིས་བྱ་བ་ཀུན་བྱས་ཤིང་། །༼བཏུ་བའི་སྔོན་དུ་༽ཕྱོགས་བཅིང་བ་ནི་བྱས་ནས་སུ། །དེ་ནས་༼བླ་མ་དང་སློབ་མ་རྣམས་འགྲུབ་ཞལ་བཞི་པས་བསྲུང་བ་བྱས་ལ༽ཁ་བཞི་བ་བྲི༽རྫ་རྔ་བྱས་ནས་ནི། །༼ཕྱིའི་ཟླུམ་པོ་ནང་དུ་བསྐྱེད་གསུང་༽ཟླུམ་པོ་རི་མོ་༼རྫ་རྔའི་ལུང་བདུན་ཁ་སྟེང་གཉིས་ཏེ་དགུ་ཡིན་་་་་་་རེས་གསུང་༽དགུ་བྱ་སྟེ། །༼རི་མོ་དང་སྔགས་མ་འདྲེས་པར་བྲིས་༽ཤིན་ཏུ་མཉམ་༼པར་༽བཞག་༼པས༽་སོ་སོ་རུ། །ཡི་གེའི་ཕྱི་མོ་༼དབྱངས་དང་གསལ་བྱེད་༽དགོད་པར་བྱ། །དེར་གནས་པ་ལ་༼གནོད་མཛེས་༽དཔའ་བོ་ནི། །༼རིན་ཆེན་བཞི་གྲུབ་པ་ལ་སུཾ་བྷ་ནི་དགོས་པས་ན་སུཾ་བྷ་ནི་བཏུ་བ་བསྟན་༽འདོད་པའི་དོན་ཀུན་སྒྲུབ་བྱེད་བཏུ། །རིམ་བཞིན་འབྱུང་དང་རིམ་མིན་༼གསལ་བྱེད་ཧ་ཤ་གཡོན་སྐོར་༽པས། །དབྱངས་དང་ཡི་གེ་༼གསལ་བྱེད་༽བསྒྲུབ་པ་པོས། །ཐུབ་པས་དེ་ལྟའི་གྲངས་འགྱུར་ལས། །རེ་མིག་སུམ་ཅུ་གཉིས་པ་བླང་༼ཀ་ནས་བགྲངས་པའི་དབུས་ཀྱི་ཧ་ཀ་ནས་བགྲངས་པའི༽། །ལྔ་པ་༼དབྱངས་ཨུ་༽ཡིས་ནི་ཁྱད་པར་བྱ། །བརྒྱ་ཕྱེད་ཕྱེད་པ་༼ལྔ་བཅུ་པ་ཀ་ནས་བགྲངས་པའི་ཉི་ཤུ་རྩ་ལྔ་པ་མ་༽ཡང་དག་བླང་། །ཉི་ཤུ་རྩ་བཞི་པ་༼བྷ་༽ཡིས་ཕྱེ༼བས་བྷ་༽། །༼ཨ་ནས་བགྲངས་པའི་ན༽་རེའུ་མིག་སུམ་ཅུ་དྲུག་པ་བླང་། །༼དབྱངས་༽གསུམ་པ་༼ཨི་༽ཡིས་ནི་ཁྱད་པར་དབྱེ། །དེ་ནས་༼ཀ་ནས་བགྲངས་པའི་༽སུམ་བཅུ་༼ས་༽གཉིས་པ་བླང་། །ལྔ་བ་༼ཨུ་༽ཡིས་ནི་ཁྱད་པར་བྱ། །དེ་ནས་ཉི་ཤུ་ལྔ་བ་༼ཀ་ནས་མ༽བླང་། །ཉི་ཤུ་བཞི་བ་༼ཀ་ནས་བགྲངས་པའི་བྷ་་་་པ་་མྦྷ་༽དག་དང་སྦྱར། །སུམ་ཅུ་རྩ་གསུམ་པ་་ཧ་་་ཡང་བླང་། །རེའུ་མིག་བཅྭོ་ལྔ་པ་༼ཨཾ༽ཡིར་ལྡན། །ལྔ་བ་དག་༼་་་་་ན་༽དང་༼ཨུ་བྱུང༽ཡང་དག་ལྡན། །༼སྔགས་ཀྱི་ཆེ་བ་༽མཛེས་པའི་མཆོག་ནི་༼ཧཱུཾ་གཉིས་སུ་མ་བཏུས་༽ཡིན་པར་འདོད། །ཉི་ཤུ་རྩ་གཉིས་པ་༼ཀ་ནས་བགྲངས་པའི་ཕ་༽དང་ལྡན། །༼ཆེ་བ་༽བཅུ་གཅིག་པ་༼༤༽ཡིས་མཚན་པའོ། །ཚིག་གི་དང་པོ་༼སྔགས་མཚན་བཞི་ཞལ་དང་པོའི་སྔགས་༽ཡིན་པར་འདོད། །༼ཨ་ལི་ནས་བགྲངས་པའི་༽རེའུ་མིག་ནི་བཅུ་དགུ་པ། །མེ་ཡི་བུ་དང་༼༨༽ཡང་དག་ལྡན། །རེའུ་མིག་གསུམ་པས་༼ཨི་ཐུང་༽རྣམ་པར་ཕྱེ། །ཡ་ཚན་བརྒྱད་པའི་ས་བོན་ནི། །༼ཨ་ཨ་ནས་༽རེའུ་མིག་སུམ་ཅུ་དྲུག་པ་དང་། །༼ཧྣ༽ཡང་དག་ལྡན་པའི་ཡི་གེར་གྱུར། །སླར་ཡང་ཡི་གེ་༼འབྲི་ཧ་མནན་པས་༽དེ་དག་ཉིད༼འདི་རི་ལུ་བྱ་བ་ཡིན་གསུང་༽། །འདོད་པའི་དོན་ཀུན་སྒྲུབ་བྱེད་ཡིན། །དེ་ནས་རང་འབྱུང་༼སྤྱི་བོ་ན་གནས་པའི་ཧ་རང་བྱུང་པས་༽བླངས་ནས་༼ཧ་༽ནི། །རེའུ་མིག་ལས་ནི་ལྔ་པར་༼ཨུ་༽སྦྱར། །སྤྱི་བོར་ཐིག་ལེ་༼ཧཱུཾ་༽དག་དང་སྦྱར། །དོན་ཀུན་བསྒྲུབ་ཅེས་བྱ་བ་ཡི། །ཚིག་ནི་གཉིས་པ་༼རྐང་བ་གཉིས་པ་་་་་་འདི་༣་་་་་་་ཕཊ་མ་བཏུས་འོག་ཏུ་ཀུན་ལ་སྦྱར་བར་བཤད་༽ཡིན་པར་བཤད། །རེའུ་མིག་བཅུ་དགུ་པ་ཉིད་ལ། །ཉི་ཤུ་རྩ་བདུན་པ་ཡིས་ཕྱེ། །གསུམ་པ་༼ཨི་༽དག་དང་ཡང་དག་ལྡན། །སུམ་ཅུ་གསུམ་པ་༼ཀ་ནས་བགྲངས་བའི་དབུས་ཀྱི། ཧ༽རྟགས་བླངས་ཏེ། །རེའུ་མིག་གི་ནི་གཉིས་པ་སྦྱར་༼ཧཱ་རིང་པོར༽། །༼ཀ་ནས་༽ཉི་ཤུ་པ་༼ན་༽དང་ཡང་དག་ལྡན། །མཛེས་པའི་མཆོག་ནི་༼ཧྣཱ་༽ཡིན་པར་འདོད། །དེ་བཞིན་ཉི་ཤུ་གཅིག་པ་ཉིད། །དེ་བཞིན་ཉི་ཤུ་དྲུག་པ་༼ཡ་༽ཉིད། །ལན་གཅིག་བཟླས་པའི་ཚིག་ཏུ་ནི། །ཤིན་ཏུ་མཉམ་པར་བཞག་སྟེ་བཏུ། །དེ་ནས་གོ་རིམ་བཟློག་པ་བཏུ། །རེའུ་མིག་ལས་ནི་དང་པོ་ཉིད་༼དབུས་མ་ཉིད་ཀྱི་ཧ་དགོད་པའི་དང་པོ་གསུང་༽། །བཞི་བའི་མཐའ་༼ལྔ་བ་ལ་ཨུ་ཐུང་༽དང་ཡང་དག་ལྡན། །དེ་བཞིན་༼ཨོཾ། ཧཱུཾ་༽བཅྭོ་ལྔ་པ་དང་བཅས༼ལྡན༽། །ཆོས་༼དགོས་པ་༽དོན་འདོད་དང་ཐར་བ་ཡི། །ཚིག་ནི་གསུམ་པ་ཡིན་པར་༼རྐང་བ་གསུམ་པ་༽བཤད། །རེའུ་མིག་གཉིས་པའི་ས་བོན་༼ཨཱ་༽དང་། །རེའུ་མིག་སུམ་བཅུ་དྲུག་པ་༼ཨ་ལི་ནས་བགྲངས་པའི། ན་༽ཉིད། །དེ་བཞིན་༼ཀ་ནས་༽ཉི་ཤུ་དྲུག་པ་༼ཡ་༽དང་། །སུམ་བཅུ་གསུམ་པ་ཡང་དག་ལྡན། །རེའུ་མིག་བཅུ་གསུམ་པ་༼ཨོ་༽རུ་ལྡན། །རེའུ་མིག་ལས་ནི་བཅུ་བ་༼དབུས་ཀྱི་ཧ་ནས་མས་ཞར་བགྲངས་པའི་བྷ་༽ཉིད། །གོ་རིམ་བཟློག་པས་བསྒྲུབ་པོས་བླང་། །རེའུ་མིག་ལས་ནི་བཅུ་དགུ་པ༼ཨ་ལི་ནས། ག༽། །རེའུ་མིག་ཉི་ཤུ་གསུམ་པ་༼བ་༽ལ། །གཉིས་པ་ཨཱ་དང་ནི་ཡང་དག་ལྡན། །སྟེང་དུ་ཐིག་ལེས་བརྒྱན་པར་བྱ་༼བཱཾ་དུ་གྱུར༽། །དེ་ནས་ཆུ་བོའི་ས་བོན་བཟུང་། །བརྒྱད་པ་ཡང་ནི་༼ཀ་ནས་བགྲངས་པའི་༽དེ་བཞིན་ཏེ། །མེ་ཡི་བུ་ཡིས་ཁྱད་པར་༼༨་འོག་ཏུ་༽དབྱེ། །༼སྔགས་རྐང་བ་བཞི་བའི་ཡང་༽ཡི་གེ་ཧཱུྃ་གིས་མཐའ་རུ་སྦྱར། །འདི་ནི་ཁམས་གསུམ་རྒྱལ་ཞེས་བྱའི། །༼ཞལ་བཞི་ཡུམ་བཞི་བརྒྱད་བཅས་པའི་བསྒྲུབས་༽སྔགས་ཚིག་བཞི་ཡིས་རྣམ་བརྒྱན་པའོ། །༼སྔགས་རྐང་རེ་རེ་ལ་ཡང་༽ཨོཾ་ནི་ཀུན་ལ་གསལ་བྱེད་ཡིན༼སུཾ་བྷ་ནིའི་སྔགས་བཏུས་པའི་གཏིང་ལ་ཡང་དག་བཟོད་ཨོཾ་འདི་འགོར་བྲི་གཤམ་དུ་ཧཱུཾ་ཕཊ་བྲིའོ༽། །༼གོང་དུ་ཧཱུྃ་བཏུས་པ་ལ་འདི་བསྣན་པས་ཧཱུྃ་གཉིས་སུ་འགྲོ་གསུང་རིས་བཏུ་བ་ཧཱུྃ་རེ་རེ་ཀ་ལ་མེད་གསུང་༽ཧཱུྃ་དང་ཕཊ་ནི་༼ཀུན་གྱི་༽མཐའ་རུ་སྦྱར། །༼ཆེ་བ་༽རིགས་རྒྱལ་འཁོར་ལོ་བསྒྱུར་བའི་སྔགས༼བཅོམ་ལྡན་ཞལ་བཞི་བའི་སྔགས་༽། །འདི་ནི་མ་བྱུང་༼རྒྱུད་གཞན་དུ་༽འབྱུང་མི་འགྱུར། །དེ་ཉིད་བསྡུས་དང་དཔལ་མཆོག་དང་། །༼ནམ་མཁའ་དང་མཉམ་པ་༽བདེ་མཆོག་རྡོ་རྗེ་འཇིགས་བྱེད་དུ། །ཁྲོ་བོ་བཞི་དང་༼གནོད་མཛེས་ཡང་ན་ཁ་ཎྚ་རོ་ཧ་༽ཡང་དག་ལྡན་༼ཨ་བྷི་དྷ་ན་ལྟར་ན་ལྷ་བསྒྲུབ་ཐབས་སུ་ཡང་འགྲོ་གསུང་། ཡང་འདིའི་བསྒྲུབ་ཐབས་ཨ་བྷི་དྷ་ན་རྐང་་་་་་་་་་༽། །སྐུ་བརྒྱད་དང་ནི་བཅས་པ་རུ་༼ཊ་ཀི་མ་་་་་་་་་་་་་པར་གསལ༽། །དཀྱིལ་འཁོར་བསྲུང་བའི་དོན་དུ་ནི། །གདུག་པ་ཀུན་ལ་ཁྱད་པར་དུ། །༼བརྗོད་ཅིང་སེ་གོལ་གཏོག་༽འདི་ནི་བརྗོད་པ་ཙམ་གྱིས་ཀྱང་། །༼གྲུབ་མ་གྲུབ་༽བརྟག་མི་དགོས་པར་༼བགེགས་རྣམས་གསང་སྔགས་ཙམ་གྱིས་༽འཆིང་བར་འགྱུར། །འཁོར་ལོའི་སྦྱོར་བ་བརྗོད་པ་ནི༼བཅུ་ལོང་པ། ༼དུ་མ་ནི་བཛྲ་ཊ་ཀི་ནི་དང་མཁའ་འགྲོ་རྒྱ་མཚོ་ལས་བྲེས་པར་བྱའོ༽། །དངོས་གྲུབ་ཀུན་གྱི་འབྲས་བསྐྱེད་པའོ། །ཨོཾ་སུཾ་༼གནོད་མཛེས་༽བྷ་ནི་སུཾ་བྷ་༼ངེས་པ་གནོད་མཛེས༽ཧཱུྃ་ཧཱུྃ་ཕཊ་༼གཉིས་པོ་འདི་བཏུ་བའི་དུས་ན་འབྲི་དགོས་སཾ་སེམས་ཕྱག་་་་་་་་་་་་་་༽། །༼ཟུང་གཉིས་༽ཨོཾ་གྲིཧྣ་གྲིཧྣ་ཧཱུྃ་ཧཱུྃ་ཕཊ། །ཨོཾ་གྲིཧྣ་པ་ཡ་གྲིཧྣ་པ་ཡ་ཧཱུྃ་ཧཱུྃ་ཕཊ། ཨོཾ་ཨ་ན་ཡ་ཧོ་༼ཚུར་ཁུག་གཉིས་༽བྷ་ག་ཝན་བཛྲ་༼བཅོམ་ལྡན་འདས་རྡོ་རྗེ་རྒྱལ་པོའི་བཀའ༽ཧཱུྃ་ཧཱུྃ་ཕཊ༼་འཇོམས་པར་བྱེད་པའི་ལུང་སྦྱིན་སྒྲ་བསྒྱུར་ཆེན་པོར་མཛད ༽། །དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་རྫ་རྔ་བཅིང་བའི་སྔགས་བཏུ་བའི་ཆོ་གའི་ལེའུ་སྟེ་སུམ་བཅུ་པའོ། །༼ལེའུ་ཉི་ཤུ་རྩ་དྲུག་པར་བསྲུང་བའི་དམ་ཚིག་བསྟན་པ་འདིར་ལེའུ་གསུམ་གྱིས་བཟའ་བའི་དམ་ཚིག་བསྟན་ནོ།འདི་ནས་མར་ལེའུ་གསུམ་གྱི་ལེའུ་དང་པོར་ལམ་གྱི་གསང་བ་བསྒྲུབ་པ་རིགས་ལྡན་མ་མཆོད་པའི་རྫས་བ་མ་དབུགས་འབྱུང་ཞེས་བྱ་བ་ལ་སོགས་པས་བསྟན་པའི་བཟའ་བའི་དམ་ཚིག་བསྟན་པའི་རྒྱས་བཤད་སྟོན་ཏོ༽ །དེ་ནས་༼བཟའ་བའི་དམ་ཚིག་ལག་མཆོད་དེ་ལ་གསུམ་ལས་དང་པོ་རྫས་༽ཤ་ཆེན་༼ཤུགས་ལ་ཤ་ལྔ་ཅར་ཤེས་པར་བྱ་༽དག་གིས་༼ བདུད་རྩི་ལྔ་ཡེ་ཤེས་ལྔར་མོས། སྡིག་པོ་ཆེ་བླ་ན་མེད་པའི་གནས་སུ་བསྒྲལ་གསུང་༽ཀུན། །༼མི་ཐུན་པའི་ཕྱོགས་རྣམས་༽འཇིག་བྱེད་རྡོ་རྗེ་སྐྱེས་ཡིན་༼ཐུན་པའི་ཕྱོགས་རྣམས་འཕེལ་ཞིང་རྟན་པར་བྱེད་༽བཤད། །འདི་ནི་༼ཇི་ལྟར་མི་ཐུན་པའི་འཇིགས་པར་བྱེད་ན༽གདུག་པ་ཐམས་ཅད་ཀྱི། །འཇིག་བྱེད་མི་བཟད་པར་བཤད་དོ། །དེ་བཞིན་༼ལོ་ག་བས་མི་གཙང་བར་བྱེད་པའི་༽ཁྱི་དང་ཕག་གི་ཤ། །༼ཁྱིམ་བྱ་༽ཟངས་ཀྱི་གཙུག་པད་ཅན་དེ་བཞིན། །༼བདུད་རྩིར་བྱ་སྟེ་༽བཟའ་༼བ་བརྟེན་པའི་ལུག་གཉིས་༽དང་༼ཕྱིའི་༽སྦྱིན་བསྲེག་༼གི་རྫས་དང་༽གཏོར་མ་ཡི་༼རྫས་དང་༽། །༼མི་གཙང་བར་བྱས་ནས་མི་བརྟེན་པ་༽རྣམ་པར་༼བྱ། དེ་ཡང་༽མ་དཔྱད་ཀྱིས་༼མི་གཙང་བར་རྟོག་པ་མེད་པར་༽བྱའོ། །གང་ཕྱིར་ཐེ་ཚོམ་མེད་བྱས་ནས། །མ་ལུས་ལུས་པ་མེད་༼ལོ་ཀ་གསུམ་ན་གནས་པའི་དངོས་གྲུབ་༽འགྲུབ་ཅིང་། །༼ལོ་ཀ་འདིར་༽རྒྱལ་སྲིད་ཐམས་ཅད་༼ཀྱང་༽རབ་འགྲུབ་༼དབང་དུ་༽འགྱུར༼གཉིས་པོ་རེའི་བཟའ་བའི་སྣོད་ལ་བརྩོད་པ་སྤངས་པ༽། །༼ན་༽དུང་དང་༼ཐོད་པ་གཙང་སྒྲ་ཡིན་པ་བཞིན་༽མུ་ཏིག་ཉ་ཕྱིས་ཏེ། །གསུམ་ཅར་༼སེམས་ཅན་ལ་༽རྒྱུ་མཚན་བྱུང་༼པ་༽ཡིན་༼པའི་ཕྱིར་ཞེ་ན་༽ན། །༼མི་འདྲ་སྟེ་༽ཆོས་ཀྱི་སྐུ་ཡི་༼དངོས་སམ་ཉེ་བའི་རྒྱུའི་མིའི་མིང་ནི་བསོད་ནམས་བསགས་པའི་ལུས་ཡིན་པས་༽ལུས་ཅན་གྱི། །ཐོད་པ་ལ་ནི་སུ་ཞིག་སྨོད། །༼དེ་རིགས་པའི་ཚུལ་དུ་འདི་ལུང་གི་ཚུལ་དུ་གསུང་ཧེ་རུ་ཀ་ལ་ཡང་མིའི་ཐོད་པ་མགོ་བོ་ལ་རྒྱན་དང་རུས་པའི་རྒྱན་གྱིས་བརྒྱན་པའོ་༽དཔའ་བོ་ཐོད་པའི་ཕྲེང་བ་འཆང་། །༼མིའི་རུས་པའི་༽ཟླ་བ་ཕྱེད་པས་༼དབུ་སྐྲ་ལ་༽རྒྱན་དུ་བྱས། །དཔའ་བོའི་དབང་ཕྱུག་༼གི་རྒྱན་དང་སྣོད་གཉིས་ཀ་༽ཡིན་པར་བཤད༼རྣལ་འབྱོར་པས་ཀྱང་དེ་ལྟར་བྱེད་༽། །བརྡ་ནི་༼ཚོགས་ཀྱི་དུས་སུ་ལག་མཆོད་བྱ་བའི་རིམ་པ་བསྟན་༽ལྔ་བོ་བསྟན་པ་དག །༼གསུམ་པ་སྤྲོས་བཅས་ཀྱི་སྤྱོད་པའི་བྱེ་བྲག་ལག་མཆོད་དངོས་བསྟན་༽བསྒྲུབ་པ་པོ་ཡི་ལག་གཡོན་གྱིས། །འདི་ནི་དཔའ་བོའི་༼དང་རྣལ་འབྱོར་མ་རྣམས་ཀྱི་༽རིགས་ལྔའི་བརྡ་སོར་མོ་ལྔ་སྤྲོས་བཅས་ཀྱི་སྤྱོད་པའི་བྱེ་བྲག་་་་་་མཛབ་་བ་་་་འདུས་པ་སྟེ། ལག་པའི་མཆོད་པ་སྟོན། སོར་མོས་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་༽གནས་ཡིན་ཏེ། །བརྡ་རྣམས་ལ་ནི་རབ་འཇུག་པའོ། །ཁམས་གསུམ་རྒྱུ་དང་མི་རྒྱུ་དང་། །འགྲོ་ཀུན་གཡོན་༼པའམ་ཤེས་རབ་སྟོང་པ་ཉིད་ལས་༽ལས་བྱུང་བ་ཡིན་༼པའི་ཕྱིར༽། །༼ལག་མཆོད་དུས་སུ་སོར་མོ་རྣམས་གང་དང་གང་ཡིན་པ་བསྟན་འདི་རྣམས་རང་བཞིན་གྱི་༽རྡོ་རྗེ་སེམས་དཔའ་མཐེ་བོར་གནས། །འཛུབ་མོ་དེ་བཞིན་རྣམ་སྣང་མཛད། །གུང་མོར་པད་མ་གར་དབང་བཞུགས། །སྲིན་ལག་དངོས་གྲུབ་ཐམས་ཅད་ནི། །རབ་ཏུ་སྩོལ་བའི་དཔའ་བོ་༼ཧེ་རུ་ཀ་༽བཞུགས། །ཐ་མ་ལ་ནི་མཁའ་སྙིང་པོ། །༼རིགས་ལྔའི་དབྱིབས་དང་ཁ་དོག་དུ་མོས་༽མི་བཟད་༼གཙོ་བོ་རིན་འབྱུང་དུ་མོས་༽གཟུགས་དང་ལྡན་པ་ཡིན། །༼ལྔ་ཅར་གྱི་༽སེན་མོའི་ངོས་ལ་༼དོན་གྲུབ་༽རྟ་མགྲིན་གྱི། །༼རང་བཞིན་གྱིས་༽༼དཔའ་བོ་དྲུག་༽གནས་སུ་གྱུར་བར་བཤད་པ་ཡིན། །འདི་དག་དཔའ་བོ་༼དྲུག་གནས་༽ཐམས་ཅད་ཀྱི༼གནས༽། །༼ལག་པ་༽གཡོན་པ་༼མཆོད་བྱ་ལག་པ་གཡོན་པ་མཆོད་བྱེད་གཡས་པའོ་གསུང་༽ལས་བྱུང་རྒྱུ་ཡིན་ནོ། །ལག་པ་གཡོན་པའི་མཐིལ་༼དུ་ཨོཾ་བཾ་ལ་སོགས་དང་དྲུག་ལས་དཔའ་མོ་དྲུག་སྐྱེད་པ་༽ཤྲི་ནི་ཧེ་རུ་ཀའི། །༼བཾ་ཕག་མོ་༽ཕག་མོ་ཀུན་འདུས་དགའ་བྱེད་ཡིན་ལག་པའི་དབུས་ཀྱི་ལྟེ་བ་ལ་ལྷ་མོ་ལ་སོགས་པ་ལྔ་སྐོར་མ་ལྔ་། །༼ལག་པའི་༽རྒྱབ་ཏུ་རྡོ་རྗེ་མཁའ་འགྲོ་༼འབའ་ར་ཧི་༽མ། །འདི་ནི་༼ལག་པ་གཡོན་པ་ལ༽ལག་ཏུ་དགོད་པ་སྟེ། །༼ལྷ་༣་བཅུ་རྩ་༧་༽མཛའ་བ་ཐམས་ཅད་༼ལག་པ་ལ་༽འདུས་པ་ཡིན། །༼སོར་མོ་དང་ལག་མཐིལ་དུ་གོ་ཆའི་ལྷ་རྣམས་རྒྱབ་ཏུ་དཀྱིལ་འཁོར་རྫོགས་ནས་༽དེ་ལྟར་ཆོ་གའི་སྦྱོར་བ་ཡིས། །དཔའ་བོ་ཐམས་ཅད་༼ལག་པའི་༽མཆོད་༼པས་མཆོད་༽པར་བྱ། །ས་ནི་སྤྱན་ཞེས་བྱ་བར་བཤད། །ཆུ་ཡི་ཁམས་ནི་མ་མ་ཀི་ལག་པ་ལ་གནས་པའི་འབྱུང་པ་བཞི་ངོ་བོའི་ལྷ་མོ་བཞིར་གནས་པ་འདི་དག་མོས་པ་ཙམ་ལས་རྣམ་པ་གསལ་བ་མི་དགོས་གསུང་། །མེ་ནི་གོས་དཀར་མོར་བཤད་དེ། །རླུང་ནི་སྒྲོལ་མར་རབ་ཏུ་བཤད། །༼དེ་དག་གི་་་་མཆན་འདི་བཙུད་མེད་་་་༽ཙུམ་བུ་ཀ་ནི་༼ཕག་མོའི་རྣམ་གྲངས་༽སྟོང་བ་སྟེ། །དེ་བཞིན་༼ཤེས་རབ་༽ཕ་རོལ་ཕྱིན་པ་ཡིན། །༼ལག་པ་རྒྱབ་ཀྱི་༽དབུས་སུ་༼དཀྱིལ་འཁོར་རྫོགས་པ་ནི་༽དཔའ་བོ་༼ཉི་ཤུ་༤་པོ་༽ཀུན་གྱི་གནས། །༼ལུས་ཐམས་ཅད་ལ་བྱུགས་པ།ལག་པའི་མཆོད་པ་ཟིན་ནས་ཐལ་མོ་སྤྱི་བོར་སྦྱོར།གཡོན་པའི་ལྷ་རྣམས་སྤྱི་བོ་ནས་ལུས་ལ་ཐིམ་པར་གཤེགས་སུ་གསོལ་ལོ་༽མཁས་པས་རྒྱབ་ཏུ་གཤེགས་སུ་གསོལ། །༼ལག་མཆོད་༽གསང་བ་འདི་ནི་༼དབང་མ་ཐོབ་པ་ལ་༽མི་བཤད་ཅིང་༼སྣོད་དང་མི་ལྡན་པས་མཐོང་དུ་མི་རུང་ལ་༽། །༼གསང་བ་ལ་༽རབ་ཏུ་འབད་དེ་སྦ་བར་བྱ། །དེ་ལྟར་ལག་པའི་སོར་མོའི་བརྡ་ཡི་དཔའ་བོ་༼དང་རྣལ་འབྱོར་མ་༽རྣམས༼དང་པ་བསྟེན༽། །ལྷན་ཅིག་ཟས་ལ་༼ལོང་༽སྤྱོད་པ་༼ཁུ་བ་དང་གོང་བུའི་རྫས་ཀྱིས་༽རྩོམ། །དཔའ་བོ་༼དང་རྣལ་འབྱོར་མ་༽ཐམས་ཅད་མཉམ་སྦྱར་བ། །༼གང་དང་སྦྱོར་ན་༽མཁའ་འགྲོ་དྲྭ་བའི་༼ཐམས་ཅད་ཐམས་ཅད་སྦྱོར་༽བདེ་མཆོག་༼གཉིས་སུ་མེད་པར་སྦྱོར་བ་ནི་༽ཡིན། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼ཤ་ལ་སོགས་པ་༣་པོའང་༽བཟའ་བ་དང་༼ཕྱིའི་༽སྦྱིན་བསྲེག་དང་གཏོར་མའི་བྱ་བ་ལས་ལྷག་པའི་བརྡའ་ཆོ་གའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་གཅིག་པའོ།། །༼ཕྱིན་ཅི་མ་ལོག་པ་༽༼དང་པོ་གཏོར་མའི་ལས་ཀྱི་བྱ་བས་ནི་་་་་་་རི་བསྒྲུབ༽དེ་ནས་༼འདས་མ་ཐག་པའི་བཟའ་བའི་དམ་ཚིག་གི་ཁྱད་པར་བསྟན་པ་དེ་ལ་༣་ལས། དང་པོ་རྫས་ཀྱི་ཁྱད་པར་ཕན་ཡོན་དང་བཅས་པ་༽ཡང་དག་བཤད་བྱ་བ། །༼བདུད་རྩི་ལྔ་༽བཟའ་དང་སྟོན་མོ་༼ཚོགས་ལ་སོགས་པའི་དུས་སུ་༽འདུས་པ་སྟེ། །ཡང་དག་༼གཏོར་མའི་རྫས་ཐམས་ཅད་འོག་ནས་འབྱུང་སྟེ་གཏོར་མ་བྱིན་གྱིས་བརླབ་པ་གཏོར་བཞིན་དུ་བྱས་ལ་མཆོད་དོ་༽ཆོ་ག་གང་གིས་ཤེས། །༼དེ་ཉིད་རྩོམས་པ་ཙམ་གྱིས་༽དངོས་གྲུབ་༼༣་པའང་༽མྱུར་དུ་ཐོབ་འགྱུར་པའོ། །བསྒྲུབ་པོས་སྔར་བསྟན་རིམ་པ་༼སྔར་ལེའུ་གོང་མ་རྣམས་སུ་བྱའི་ཤ་ལ་སོགས་པ་དུ་མ་བསྟན་ལ་༽ཡིས། །ཕྱུགས་རྣམས་ཀྱི་ནི་དགུག་༼ཤ་བསྒྲུབ་ཅིང་བརྟེན༽པ་ཉིད། །ཕྱུགས་རྣམས་དག་༼ནི་ཤ་༽ནི་དེ་བཞིན་ལྔ། །༼དེ་གང་ཞེ་ན། ལུས་ཀྱི་སྟོབས་སྐྱེད་པར་བྱེད་པས་༽མི་དང་རུས་སྦལ་རྔ་མོ་དང་། །ལྕེ་སྦྱང་༼བྱ་ལ་སོགས་པ་གཞན་ཡང་གསུང་༽རྟ་ལ་སོགས་རྣམས་ཀྱི། །དངོས་གྲུབ་༼གཙོ་བོ་ཐུན་མོང་གི་དངོས་གྲུབ་༽བསྒྲུབ་པའི་༼སཾ་བྷ་ར་༽དཀྱིལ་འཁོར་དུ། །༼ལུས་ཟུང་རྒྱས་པར་བྱེད་པ་༽ཕྱུགས་འདི་དག་༼གི་ཤ་༽ནི་འགྲུབ་༼པའི་༽ཡན་ལག༼་ཡིན།༽ །རིགས་རྣམས་ལ་ནི་ཕྱུགས་༼ཧེ་བཛྲའི་་་་་་ཧེ་བྲཾ་ཟེའི་རིགས་ཀྱི་ཤ་ལ་བརྡ་སྐད་མིའི་ཤ་ལས་བྲཾ་ཟེའི་ཤ་དེ་༽མཆོག་གོ རྐང་བཞི་རྣམས་ལས་༼འཁོར་ལོར་སྟོབས་སྐྱེད་པ་ལ་སོགས་པ་བྱེད་པས་༽གླང་བོ་༼ཆེའི་ཤ་༽དང་། །འདབ་ཆགས་རྣམས་ལས་ངང་བ་དང་༼བི་ཤ་མཆོག༽། །དུད་འགྲོ་རྣམས་ལས་ཕྱུགས་༼བ་ལང་གི་ཤ་མཆོག་༽ཡིན་ནོ། །༼ཞིང་སྐྱེས་མ་༽ལྷ་རྣམས་ཞལ་ནི་གཡོ་བྱེད་པ། །དངོས་གྲུབ་བསྒྲུབ་༼པར་༽བྱའི་དཀྱིལ་འཁོར་དུ། །ཕྱུགས་ནི་འདི་རྣམས་༼ཀྱི་དངོས་གྲུབ་ཀྱི་རྒྱུར་༽རྣམ་པར་བཤད། །༼དེར་མ་ཟད་དེ་གཞན་ཡང་༽ཁྭ་དང་ཆུ་སྐྱར་༼ནེ་ཙོ་དེ་དང་པོ་དུད་འགྲོ། ཕྱིས་མི་སྐད་༽བཞད་དང་ནི། །༼འགྲོས་པ་བར་འགྲོ་བ་ཤི་པ་ལ་ན་ཡོད་གསུང་༽ལྕེ་སྦྱང་སྐྱེ་གཉིས་༼ཧཱུཾ་ཞེས་པའི་འུག་པ་སྒྲ་སྒྲོགས་པས་༽སྔགས་ཆེན་པོ། །ཁྲུང་ཁྲུང་རི་སྐེགས་༼བྱ་རྣམས་ཀྱི་ཤ་༽ཀ་དམ་པ༼བྱ་རྣ་བ་ཆེ་བ་༡་ཡོད་གསུང་༽། །༼ཤ་དེ་ཐམས་ཅད་༽བཟའ་༼བ་༽དང་༼བདུད་རྩིར་བརླབས་ཏེ་༽གཏོར་མ་༼དང་༽སྦྱིན་བསྲེག་༼གི་སྲེག་རྫས་༽བྱ། །༼འདི་རྣམས་ཀྱི་ཤ་ལས་གཏོར་མ་གཏོང་སྟེ། གཏོར་མའི་ལས་ཀྱི་བྱ་བ་སི་ཏི་བསྒྲུབ་པའོ༽འདོད་པའི་དོན་ནི་འགྲུབ་པར་འགྱུར། །ཀྲིཥཎ་ཤྭ་༼ནག་པོ་མ་་་་་གྱི་མོ་་་་་རོ་ལངས་བསྒྲུབ་པ། རོ་ལངས་ཀྱི་ཧོ་མས་སི་ཏི་བསྒྲུབ་པ་བསྟན་ཏོ༽ནི་ཐུག་པ་༼ཁྱི་ནག་མོའི་འོ་མ་ལས་ཐུག་པ་བྱ་བ། ཁྱི་མོ་ནག་མོའི་ཁྱི་མོ་སྐྱེས་པ་དེ་ཉིན་མོ་བཏང་ནུབ་མོ་ཨ་མ་དང་ཕྲལ་གྱིན་བཞོས་པའི་འོ་མའོ་༽དང་། །༼སྤང་ལེབ་༽མ་ཤ་འབྲས་ནི་ནག་པོར་ལྡན། །༼འབྲས་བཙོས་པ་དང་འོ་མ་༢་བསྲེས་པའི་བསྲེག་རྫས་བཤཾས་ལ། འདི་རྩ་བའི་སྔགས་ཀྱི་བསྐྱེད་པ་ལ་བརྟེན་པས། ལས་རེ་སྔོན་དུ་སྙེན་པ་འབྲུ་འབུམ་༡་ནས་བཞི་ལ་སོགས་པ་སྐྱལ་ཏེ། རྨ་མེད་པ་རིམས་ལ་སོགས་པས་མ་ཤི་བ། ལས་ཀྱི་སྦྱོར་བ་ལ་རོ་མ་རུལ་བ་མ་མྱགས་པ་གཙང་མ་བླངས་ལ་དེ་གན་རྐྱལ་དུ་བཞག་ནས། ལྟེ་བའི་སྟེང་དུ་ཁྲི་བརྩིགས་ལ་སློབ་དཔོན་བསྡད། དེའི་ཁའི་སྟེང་ཏུ་སྦྱིན་བསྲེག་གི་ཐབ་བྱ་སྟེ་ཐབ་ཀྱི་ཟག་ཁུང་ཁའི་ནང་དུ་འོང་བར་བྱ། རང་ལྷའི་ཛོ་གི་བསྒོམས། གྲོགས་གཅིག་གིས་རལ་གྲི་བཟུང་སྟེ་སུཾ་བྷ་ནི་བཟླས་ལ་བར་ཆད་བསྲུང་། བསྲེག་རྫས་རྣམས་བསྲེག་ཅིང་རྩ་སྔགས་ཀྱི་མཐར་རོ་ལངས་ཀྱི་དངོས་གྲུབ་གསོལ་བ་བྱ་བས་བསྐུལ་ཅིང་བསྲེག་གོཿ རྩ་སྔགསཿབརྒྱ་རྩ་བརྒྱད་ནི་བསྲེག་བླུགས་ཀྱི་གྲངས་སོ། འོག་གི་རལ་གྲི་ལ་སོགས་པ་གང་འདོད་པ་ན་གསོལ་གཅིག་པ་དང་སྦྲེལ་གསུང་།༽འཛེམ་པ་མེད་པར་རོ་ཡི་ཁར་༼འདག་པས་ཐབ་བྱས་ལ། དྲག་པོའི་གསུང་༽། །སྦྱིན་བསྲེག་བརྒྱ་རྩ་བརྒྱད་པར་༼ལ་སོགས་པར་༽བྱ། །དེ་ནས་རོ་དེ་ལངས་༼བྱུང་བ་ན་འཇིགས་པ་མེད་པར་བྱ་བ་དང་༽ནས་ནི། །ཅི་བགྱི་ཞེས་ནི་༼ཅི་འདོད་སི་ཏི་གང་འདོད་ཞེས་སྨྲར་འོང་གསུང་༽སྨྲ་བར་འགྱུར། །༼དེ་ནས་དངོས་གྲུབ་བླངས་པ་༽ས་འོག་༼དང་༽སྟེང་༼མཁའ་སྤྱོད་༽འགྲོ་རལ་གྲི་འམ་༼མཁའ་སྤྱོད་༽། །༼ལྕེ་༢་འོང་་ཝེ་་་་རལ་གྲིར་སོང་་་་་གསུང་། རྒྱལ་པོ་ལ་སོགས་པ་༽ཚར་གཅོད་༼པ་དང་། སླར་༽ཕན་འདོགས་༼པ་༽ཉིད་དང་ནི། །༼མི་སྣང་བའི་་་་་་ཝེ་་་་་་སྟེང་དུ་འོང་གསུང་༽རི་ལུ་༼ལོ་ཀ་གསུམ་སྣང་བར་བྱེད་པ་༽མིག་སྨན་༼གྱི་དངོས་གྲུབ་༽གཏེར་རྣམས་སམ། །རྐང་མགྱོགས་དག་གམ་༼ཚེ་རིང་བ་ལ་སོགས་པ་༽བཅུད་ཀྱིས་ལེན། །༼དེ་རྣམས་ཀྱི་ནང་ནས་འདིའི་མཚམས་ན་མི་གསལ་་མི་སྟེར་༽གཅིག་གཅིག་སྦྱིན་པར་བྱེད་ནས་ནི། །འགྲོ་བར་༼རོ་དེ་གར་སོང་། རོ་དེ་བསྒྲུབ་གཡོག་ལ་སྟེར་ཏེ་དེས་གཡོག་བྱེད་པའམ་ཡང་ན་དེ་གསེར་འགྱུར་པས་ལོངས་སྤྱོད་དུ་འགྱུར་རོ་གསུང་། ཡང་ན་རོ་དེ་གསེར་དུ་འགྱུར་གསུང་རྩ་སྔགས་བཟླས་ཀྱིན་༽འགྱུར་གྱི་གཞན་དུ་མིན། །སྟེང་༼མཁའ་སྤྱོད་༽དང་འོག་༼ས་འོག་༽ཏུ་༼བསྒྲུབ་པ་པོ་ལ་༽ཕོ་ཉ་འགྲུབ། །རྒྱུད་འདིར་ཐེ་ཚོམ་མེད་པ་ཡིན། །༼བརྡ་སྐད། ལེའུ་དང་པོར་ལཾ་གྱི་གསང་བ་བཤད་པ་མཆོག་ཅེས་བྱ་བ་ལས་གསང་བའི་རྒྱས་བཤད་༽བ་ལང་ལྷས་ཀྱི་མི་འབྱིང་དང་། །༼ཚིག་ཕྲད་༽ལྷག་མ་༼ས་དང་ཆུའི་གཏིང་ལ་མེ་ལོང་བས་ན་ཚིག་ཕྲད་ཅེས་བྱའོ། མེ་༽སྐེམ་བྱེད་རྩ་གནས་སོ༼རླུང་༽། །༼གསེར་གྱི་ས་གཞི། དུུང་ཆེན་ཟེར་༽བྲག་ཆེན་པོ་ཡི་ངོ་བོ་རུ། །༼རྫུས་སྐྱེས་ཀྱི་རིམ་པ་འདི་ལྟར་མ་ལས་སྐྱེས་པ་ནི་འགྱུར་བས་དང་། དང་པོ་རླུང་ལས་འོང་༽ཡང་ན་རུས་སྦལ་དག་གིས་སོ། །མྱུར་དུ་དངོས་གྲུབ་༼དངོས་གྲུབ་གསུམ་༽སྨིན་འགྱུར་༼རྟེན་སྐྱེད་པ་༽ཡིན། །༼རྟེན་པ་༽ཕྱག་བཞི་པ་དང་༼ཕྱག་འབུཾ་གྱི་བར་དུ་ཡང་གསུང་༽ཞལ་བཞི་པ། །ཇི་སྲིད་ཕྱག་ནི་འབུམ་གྱི་བར་༼ཕྱག་མཚན་ཅི་འཛིན་ན་གྲགས་པ་དང་ཡོད་པའི་མཚོན་ཆ་རྣམས་བསྣམས་པ་༽། །སྐུ་མདོག་དཀར་པོ་ཁྲོ་བོ་ཆེ། །རྡོ་རྗེ་ཕག་མོ་༼དཀར་པོ་ཡང་ན་དམར་མོ་༽དེ་ཡི་ནི་། །སྐུ་མདོག་མཚོན་ཆ་འཆང་ལ་༼སྒོང་སྐྱེས་ལ་རྒྱུ་འབྲས་ཁྱད་པར་མེད་དོ་༽གཟིགས། །དཔའ་བོ་༼འབྲས་བུ་རྡོ་རྗེ་འཛིན་༽ཐོད་པའི་ཕྲེང་བ་ཅན། །སྐུ་ལ་ཐལ་བས་ཉེ་བར་བྱུགས་༼དྲུག་པ། མདོག་ནག་པོ་ལ་ཐལ་བས་བྱུགས་པས་སྔོ་སྐྱའོ་༽། །ཕྱག་རྒྱ་༼ལྔ་༽ཡིས་ནི་སྐུ་ལ་བརྒྱན། །རལ་བའི་༼སྤྱི་བོའི་རུས་པའི་ཙཀྲ་ལ། རུས་པ་ནས་ཙམ་པ་ཙར་ཙར་བ་ཡོད་པ་རལ་བའི་རྩེ་མོ་རྣོ་བས་༽ཅོད་པན་མདུང་དང་ལྡན། །༼དངོས་གྲུབ་ཀྱི་རྒྱུ་རྟེན་དང་རྟེན་པ་༽ཞལ་གྱི་མཆེ་བ་ཅུང་ཟད་གཙིགས། །ཡི་དྭགས་ཆེན་པོ་༼འཇིགས་བྱེད་དུས་མཚན་༽གདན་དུ་བྱས། །དེ་ནས་རྟག་ཏུ་བསྒྲུབ་པ་པོས། །༼དཀྱིལ་འཁོར་རྫོགས་པ་རྫུས་སྐྱེས་སམ་མངལ་སྐྱེས་ཀྱི་༽སྔགས་ཀྱི་ལྷ་ནི་༼དབུ་རྒྱན་གྱི་ལྷའི་བར་དུ་༽ཤེས་ནས་བསྒོམ། །༼མངལ་སྐྱེས་ཀྱི་དབང་དུ་བྱས་ཏེ་རྒྱུ་རྡོ་རྗེ་འཛིན་ཉམས་སུ་བླངས་པའི་༽དེ་ལྟའི་ཡོན་ཏན་ཁྱད་པར་གྱིས། །བསྒྲུབ་པ་པོས་ནི་འགྲུབ་པར་འགྱུར། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་དུད་འགྲོ་ཕྱུགས་༼ཤ་རྣམས་༽དང་རོ་ལངས་བསྒྲུབ་པ་དང་བསྐྱེད་པའི་རིམ་པའི་ཆོ་གའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་གཉིས་པའོ། །དེ་ནས་བསྒྲུབ་པ་པོ་རྣམས་ཀྱིས། །སྦྱོར་བ་༼བཟའ་བའི་དམ་ཚིག་བརྟེན་པའམ་ཐབས་་་་་་དང་་་་་གཞན་༽ཀུན་ལ་མེད་པར་༼ཁྱད་པར་དུ་འཕགས་ཅེས་པའོ༽བཤད། །༼རྫས་བསྟན་༽བཟའ་དང་༼བདུད་རྩིར་བྱས་ལ་དེ་ལ་ལོངས་སྤྱད་༽སྤྱད་དང་དཔའ་བོ་སོགས། །ཅི་ནུས་པ་དང་༼འདིར་མང་དུ་བཤད་ཀྱང་ཇི་སྙེད་༽རྣམ་པར་བྱ། །༼ཀུན་ནམ་དངོས་སུ་བདུད་རྩི་དངོས་སུ་༽མེད་པར་གྱུར་ཀྱང་བཟའ་བ་༼གང་ཡང་རུང་བ་༽ནི། །༼དགོས་མཆོད་རྣམ་རྟོག་རིམས་ཀྱིས་ཞི་བར་བྱ་བའི་ཕྱིར་༽ལྔ་བོ་༼ཤ་ལྔ་བདུད་རྩི་ལྔ་༽ཉིད་དུ་བྱ་བ་༼བྱིན་གྱི་བརླབ་༽ཡིན། །༼དང་པོ་༽བཟའ་༼བའི་དམ་ཚིག་༽དང་བཅའ་བ་རྒྱ་ཆེ་༼བྱིན་རླབས་ལ་སྦྱོར་༽བ་༼དེའི་དུས་སུ་༽། །༼དུས་བསྟན་་་་་ཉིན་མོ་ལོ་ཀ་མི་མོ་་་་་་ས་སྐྱེ་བསུ་༽མཚན་མོའི་དུས་ནི་ཉིད་དུ་བྱ། །༼ཚོགས་བསོག་པའི་དུས་གཞན་ལ་༽དེ་ནས་ཕོ་ཉ་༼གཉིས་པ་ཕོ་ཉ་བརྟེན་ཅིང་མཆོད་པ་༽རབ་༼ཏུ་༽སྦྱིན་ཞིང་༼བརྟེན་༽། །༼འཕོ་བ་༽གཡོན་ཕྱོགས་༼སུ་ཕྱག་རྒྱའི་བསྒྲུབ་པ་པོའི་༽མགོ་བོ་བསྟན་ནས་ནི། །༼རིམས་ཀྱིས་ཡིད་ཚིམ་པ་༽རང་གི་མགོ་བོ་༼ཕྱག་རྒྱའི་༽བང་༼དུ་༽བཞག་༼དུས་རེས་འགའ་༽སྟེ། །༼དེ་ནས་༽དཔའ་བོ་༼དང་ཕོ་ཉ་མཐར་༽གཉིས་སུ་མེད་པས་མཆོད། །༼བྱིན་གྱིས་བརླབས་པ་དེ་༽༼མ་བརྟགས་ཀྱང་སྙོམས་པར་འཇུག་པའི་བདེ་བ། ཕོ་ཉའི་མཚན་ཉིད་སྔར་བསྟན་པ་ལྟར་ན་གིས་མཆོད་པའི་མཆོད་གསུང་༽ཡང་ན་༼རྟག་ས་༽མའམ་སྲིང་མོ་འམ། །བུ་མོ་འམ་ཡང་ཆུང་མར་ནི། །འདི་འདྲའི་ཆོ་གའི་སྦྱོར་བ་༼དེ་ཡང་ཡོ་མ་སྐུར། དེ་ནས་སྔགས་དང་རྒྱུད་ལ་སོགས་པས་རྒྱུད་སྦྱངས་ཏེ་བརྟེན་པ་༽ཡིས། །༼བརྟེན་ན་འཁོར་བ་༽བཅིངས་༼པ་༽ལས་༼ཉོན་མོངས་པ་ལ་སོགས་༽གྲོལ་བ་ཉིད་དུ་བྱ། །དེ་ནས་༼ལྷའི་དེ་ཁོ་ན་ཉིད་༽སྔགས་ནི་འགྲུབ་འགྱུར་ཏེ། །ཇི་སྲིད་འབྱུང་བ་ཡོད་པར་དུ་༼དང་པོ་ལྷར་སྐྱེད་པ་ནས་བཟླས་བསྒོམ་རྫོགས་ཀྱི་བར་དུ་བྱས་ལ་༽། །༼བདག་ཉིད་༽སློབ་དཔོན་ལུས་༼ཀྱི་དཀྱིལ་འཁོར་ལས་༽སུ་གནས་༼བསྒོམ་༽ནས་སུ། །༼དེ་ལྟ་བུ་ལ་མཉམ་པར་བཞག་པས་༽བསྒྲུབ་པ་པོ་ཡི་མཆོད་པ་བླང་༼ཕོ་ཉ་༽། །༼དེ་ལྟར་བྱས་ནས་བརྟེན་ན་༽དཔའ་བོ་རྣམས་ཀྱི་༼དཔའ་བོའི་སྙོམས་འཇུག་གི་ཏན་མུ་ཏྲའི་ཆོས་འབྱུང་ཡིན་༽སྟན་དག་དང་། །ཕྱག་རྒྱ་ཉིད་དུ་༼བྱིན་གྱིས་བརླབས་པ་དེ་༽ཐེ་ཚོམ་མེད། །༼དེ་ལྟ་བུས་མུ་ཏྲ་བརྟེན་པའི་དུས་རེས་འགའ་སྐྱོ་བ་གསང་བའི་ཕྱིར་༽བསྒྲུབ་པོ་ཤིན་ཏུ་མཉམ་བཞག་པས་༼ལྷའི་རྣལ་འབྱོར་ལ་༽། །༼བསྒྲུབ་པ་པོས་ཐབས་ཀྱིས་ཟིན་ན་ཕྱག་རྒྱ་དང་ལྷན་གཅིག་ཏུ་༽གླུ་དང་གར་ལ་སོགས་པ་བྱ། །༼བསྒྲུབ་པ་པོ་༽ལུས་ཅན་ཐམས་ཅད་ཇི་སྲིད་དུ། །རྣལ་འབྱོར་ཡེ་ཤེས་ལ་མ་ཞེན་༼དེ་ཐ་མལ་པའི་ཆགས་པ་ལ་ཞེ་ན་རིམ་གྱིས་རིམ་གྱིས་ཉོན་མོངས་པ་ལ་སོགས་པ་འཕེལ་ནས་༽། །༼ཉེས་་་་་་་་་་་་༽དེ་སྲིད་༼དེ་ཁོ་ན་མ་གཏོགས་པས་༽འཁོར་བར་འཁོར་འགྱུར་ཞིང་། །༼འཁོར་བའི་སྐྱོན་༽མྱ་ངན་སྡུག་བསྔལ་གྱིས་གཡེང་འདིར་༼སྐྱེ་༽། །༼དེ་བས་ན་༽དངོས་པོ་༼ལུས་ངག་ཡིད་གསུམ་༽ཀུན་ནས་བསྒྲུབ་པ་པོས། །ཕྱ་རྒྱ་༼ལྷ་ལ་མཉམ་པར་བཞག་པས་དང་ཕྱག་རྒྱ་་་་་་་་་་རྟོགས་པར་བྱ་བའི་བསམ་པས་༽ཐམས་ཅད་མཆོད་པར་བྱ་༼སྙོམས་འཇུག་བྱ༽། །མཆོད་པ་དེ་ནི་མཆོག་གྱུར་ཏེ། མཉམ་པར་བཞག་པས་ཕྱག་རྒྱ་བརྟེན་ན་བརྙས་པ་བྱས་ན་ཡིས་ནི་ངེས་པར་༼གཞན་ལ་༽བསྲེག་༼ངན་སོང་དུ་འགྲོ༽ །རྣལ་འབྱོར་མ་ཡི་རྒྱུད་རྣམས་ཀྱིས། །༼འདོད་པའི་བསམ་པས་༽ཕྱག་རྒྱ་ཆེན་པོ་༼འམ་གཙོ་བོར་སྤྲོས་པ་དཀྱིལ་འཁོར་ཐམས་ཅད་་་ཡབ་ཡུམ་སྙོམས་པར་ཞུགས་པ་ལས་བྱུང་བའི་ཐིག་ལེ་བདེ་བའི་རང་བཞིན་ཅན་དེ་ཨ་ལི་བརྗོད་ཅིང་སྦྱོར་བའི་བར་ནས་འདུ་ཏི་ནས་དྲངས་པ་དང་དེ་ནས་་་་་་་་་་སྣ་བུག་ནས་བདེ་བའི་དལ་ཐ་མས་ཅད་ལ་བདེ་བ་ཁྱབ་པར་བྱས་ཚུལ་བསྡུ་བའོ་༽དང་པོར་བསྒྲུབ། །དེ་བཞིན་༼མཉམ་པར་བཞག་པས་ཕོ་ཉ་བརྟེན་པ་ལ་༽རབ་ཏུ་འབད་པ་དང་། །༼་་་་་སྟོན་བདེ་ལ་་་་་་་་་༽ཀུན་ནས་དང་བས་༼སྙོམས་འཇུག་གིས་༽མཆོད་པར་བྱ། །དེ་ཡི་འོག་ཏུ་དཔའ་བོ་ཡིས། །དཔའ་བོ་༼ཕོ་ཉ་དང་༽ཀུན་ཏུ་སྤྱད་པར་བྱ༼༣་པ་ཕོ་ཉ་བརྟེན་པའི་ཕན་ཡོན་༽། །༼སྔགས་སྐྱེས་མངལ་སྐྱེས་ཞིང་སྐྱེས་མའམ་ལྷན་སྐྱེས་མར་ཞེན་ནས་བརྟེན་པའི་ཕན་ཡོན་འདི་དག་འབྱུང་ངོ་༽དེ་ལྟར་མཆོད་བྱས་དེ་ནས་ནི། །༼ཐུན་མོང་གི་དངོས་གྲུབ་༽སྟེང་༼མཁའ་སྤྱོད་༽འོག་༼ས་འོག་༽འགྲོ་བ་བསྒྲུབ་པ་༼ཕོ་ཉ་ན་ལ་ཉི་ཤུ་ཡོན་ཏན་འབྱུང་བ་༽དང་། །ཞི་དང་༼ལག་པའི་དངོས་གྲུབ་༽རྒྱས་དང་དབང་དང་དགུག །བསད་དང་བསྐྲད་པ་ལ་སོགས་དང་། །རྨོངས་དང་རེངས་སོགས་ལ་སྦྱར་ཞིང་། །དབྱེ་༼མཛའ་བ་༽དང་དེ་བཞིན་༼བསྐྲད་པ་གསུང་༽ཚར་བཅད་དང་། །༼དུས་རིང་མོར་འགོར་བ་༽ལས་རྣམས་གང་ཅིའང་རུང་བ་ལ། །༼རྨོངས་ཟེར་༽སྨྱོན་མི་དགོས་པར་༼རེ་རེ་ནི་བསྟན་པའི་ན་་་་་་ཀས་་་༽བསྒྲུབ་པ་པོས། །འགྲུབ་པར་འགྱུར་བར་གདོད་མི་ཟ། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་གསང་བའི་མཆོད་པ་དང་༼ལྷ་དང་སྔགས་༽བསྙེན་བསྐུར་གྱི་ཆོ་གའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་གསུམ་བའོ། །དེ་ནས་༼སྦྱིན་སྲེག་དང་རྫོགས་པའི་རིམ་པ་གཉིས་ཀའི་སྔོན་དུ་སྐྱེད་རིམ་འགྲོ་བས་དང་པོ་སྐྱེད་པའི་བསྟ་་་་་་་་རྫོགས་པ་ནི་བདེ་་་་་་་་་སྔོན་དུ་བི་་་་་་་སྟོང་པ་་་་་་་༽མཁའ་འགྲོ་མ་དྲ་བའི། །༼ལུ་ཨི་པའམ་ནག་པོ་ལྟར་ལྷ་སུམ་བཅུ་རྩ་བདུན་ཚང་བར་མངལ་སྐྱེས་སྒོང་སྐྱེས་གཉིས་ཀ་གསུང་༽འཁོར་ལོ་ཆོ་ག་རྒྱས་པ་སྟེ། །ལས་གང་ལས་ནི་༼འདི་ཡན་ཆད་གྲང་དོན་དང་ངེས་དོན་༢་ཐུན་མོང་༽ཀུན་བརྗོད་པས། །༼ལས་རྣམས་༽འགྲུབ་པར་ཐེ་ཚོམ་མེད་པའོ། །དཔའ་བོ་༼ཉི་ཤུ་རྩ་ལྔ་་་་ལོ་ཀ་ལས་འདས་པའི་མེ་ལྷ་མངོན་པར་བསྟན་༽ཀུན་༼ཡབ་ཐབས་༽དང་༼ཡུམ་ཤེས་རབ་༽རྣལ་འབྱོར་མའི། །༼དང་པོ། ཤུ་ལོ་༡་གི་ཕྱིའི་ཞི་བ་ལ་སོགས་པའི་ལས་རྫོགས་པ་བསྒོམ་པའི་ལས་གཉིས་ཀའི་དོན་དུ་འགྲོ་བ་སྐྱེད་རིམ་ཡིན་པས།ཀུན་ཏུ་སྤྱོད་པ་ལྟར་གནས་ལྔར་ཡི་གེ་འབྲུ་ལྔ་བཀོད། ལོ་ཀའི་མེ་ལྷ་འབར་བར་མ་ཐིམ་ན་དེའི་ཁོང་པའི་པད་མའི་ལྟེ་བར་འདས་པའི་ལྷ་རྣམས་སྐྱེད་པ།འབར་བར་ཐིམ་ན་ཐབ་ཀྱི་པད་མ།༽་པད་མའི་ལྟེ་བར་ངེས་པར་སྦྱར། །ཨ་བ་དྷུ་ཏི་གནས་༼གནས་ནས་མར་འདས་པའི་དཀྱིལ་འཁོར་གཞུགས་སྟེ་ལྟེ་བ་ན་མོའི་དམ་ཚིག་པའི་དཀྱིལ་འཁོར་བསྐྱེད་པ་ལ་སྟིམ་མོ་༽དེ་བཞིན། །༼དེ་ནས་དཀྱིལ་འཁོར་ཐམས་ཅད་བདེ་བས་ཁྱབ་པར་བྱ་སྟེ་ཚུལ། ༽སྨིན་མའི་བར་དུ་༼ལོ་ཀ་བའི་མེ་ལྷའི་སྨིན་འཚམས་ནས་མར་ལ་ཡེ་ཤེས་པ་སྟིམ་མོ༽་ངེས་པར་བཞག །དཔའ་བོ་རྨེ་བརྩེགས་༼ཡབ་ཡུམ་ཞུ་བའི་དང་པོའི་ཐིག་ལེ་དཀར་དམར་བདེ་བ་ཆེན་པོའི་ཐིག་ལེ་ལ་༽ཆགས་བྱས་ལ༼ལོ་ཀ་པས་འདས་པའི་མེ་ལྷ་གསལ་བར་དམིགས་པ་ཡང་ལོ་ཀ་ལས་འདས་པའི་མེ་ལྷ་བསྲེག་རྫས་ལ་ཆགས་པར་དམིགས་པར་གསུང་༽། །དེ་ནས་མེས་བསྲེག་༼བསྲེག་རྫས་མི་རྟོག་པའི་ཐབ་ཁུང་དུ་རྟོག་པར་བྱ་བའི་བསྲེག་པར་བྱ་༽གཞན་དུ་མིན། །༼བསྲེག་རྫས་བསྟན་པ་ལ་ཤ་༽གོ་མཾ་ས་དང་༼དེའི་ཁྲག་༽རུ་ཏིར་བཅས༼་འདིར་ཐུན་མོང་མ་ཡིན་པའི་ཐུན་མོང་བ་ཤུགས་ལ་བྲེས༽། །འབད་པས་རྫོགས་པ་ལྟར་ན་ཕུང་པོ་ལྔའི་རྟོག་པ་བསྲེག་བསྲེག་བྱ་་༼བསྲེག་རྫས་བསྡུས་པ་ནི་འདི་ཡང་སྐྱེད་པའི་བདུད་རྩི་ལྔ་༽ལྔ་དག་བྱ། །༼བསྲེག་རྫས་རྒྱས་པར་བསྟན་ཏོ་༽དེ་ནས་འབར་བའི་མེ་ལ་ནི། །བསྲེག་བྱ་ཕུང་པོ་ལྔ་དང་འབྱུང་བ་བཞིའི་རྟོག་པའམ་རྟོག་པ་རབ་འབྲིང་དགུ་དགུ་ནི་འདི་སྒྱེད་པའི་ཤ་ལྔ་བདུད་རྩི་ལྔ་ལས་ཤ་ཆེན་གཉིས་གཅིག་ཏུ་བྱས་པ་ལ་དགུ་བྱ་བ་ཡིན། །༼འདི་མན་ཆད་ཕྱིའི་དཀྱིལ་འཁོར་དང་སྣོད་བཅུད་ལ་་་་བ་ཆེན་པོ་སྤྲོ་བའི་གཞུང་དུ་གསུང་༽དེ་ནས་༼འདིར་་་་བདེ་བ་དང་མི་རྟོག་པ་ལས་སེམས་གཡེངས་ནས་དཀྱིལ་འཁོར་རྒྱས་པ་ལ་སེམས་སྤྲོ་བ་༽འབར་ཕྲེང་རྒྱ་མཚོར་ནི། །ཀུན་ནས་༼རྟེན་གཞལ་ཡས་ཁང་བརྩེགས་མ་༽སྒོ་ཡི་འཁོར་ལོར་བསམ། །དཔའ་བོའི་དབང་པོ་ཞལ་བཞི་པ། །༼བརྟེན་པ་༽དཔའ་བོའི་གནས་ཀྱི་འདབ་མ་ལ། །ཕོ་ཉ་མོ་ནི་བཞི་བོ་དག །༼དཔའ་བོ་དང་དཔའ་མོ་ཉི་ཤུ་བཞི་༽དཔའ་ཀུན་གཉིས་སུ་མེད་བདེ་བ། །༼ཞི་རྒྱས་ལ་སོགས་པའི་༽ཆོ་གའི་རིམ་པ་༼ཞི་བའི་སིཏི་ལ་འདོད་ན་ཉི་མ་ཉམས་སུ་བླང་དེས་འདྲེ་༽ཇི་བཞིན་དུ། །ཁཎྜ་རོ་ཧ་༼ལ་སོགས་པ་ནད་པ་ལ་ཉི་མ་ལ་སོགས་པའི་ལས་བདག་གི་སྙིང་ཁ་ནས་ཁན་ཊ་རོ་ཧ་བཞི་སྤྲོས་ལ་ཞི་བར་བྱ་རྒྱུ་ལ་སོགས་པའི་བསྒྲུབ་བྱ་བཀུག་ལ་དེ་ནས་ཡང་ཁཎྜ་རོ་ཧ་ན་སྣ་བུག་ནས་བཅུག་པས་དེའི་ནད་ཞི་བ་ལ་སོགས་པ་ཐམས་ཅད་ཞི་བར་བསམ་དེ་བཞིན་ཏུ་དབང་དུ་བྱ་བ་དང་རྒྱས་པར་བྱ་བ་ཡང་བསམ། དེས་འདྲེའོ༽ཕྱི་རོལ་༼ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་དང་སྣོད་བཅུད་ཐམས་ཅད་བདེ་བ་ཆེན་པོར་༽སྦྱོར། །༼ཐིག་ལེ་བདེ་བ་ལ་༽རང་གི་གཟུགས་སུ་༼ནི་བདེ་བ་སྟེ་༢་ཕྱི་རོལ་༽མངོན་ཞེན་པ་༼པར་བྱ་བའམ་སྤྲོས་པས་སམ༽། །འཁོར་ལོའི་དབུས་སུ་བསྟན་པར་བྱ་༼ནད་པ་དེ་རང་གི་གཡོན་དཀྱིལ་འཁོར་གྱི་ལྷའི་གཡས་སུ་བཞག་ལ་ལས་གོང་མ་བྱ་གསུང་༽། །༼དེ་ལྟར་དཀྱིལ་འཁོར་གྱི་༽འཁོར་ལོ་༼དཀྱིལ་འཁོར་རྫོགས་པ་༽འདི་དག་༼ཐམས་ཅད་བདེ་བ་ཆེན་པོར་པོ་༽བསྟན་པ་ནི༼དེ་ལྟ་བུ་གང་ལས་གསུངས་ན༽། །དངོས་གྲུབ་༼༣༽རིམ་བཞིན་གསལ་བྱེད་ཡིན༼ཐིག་ལེ་བདེ་བས་ལྷ་ཐམས་ཅད་ཀྱང་བདེ་བ་མི་རྟོག་པས་ཁྱབ་པར་བསྒོམ་མོ༽། །༼ཐིག་ལེ་བདེ་བས་ལྷ་ཐམས་ཅད་ཀྱང་མི་རྟོག་པས་ཁྱབ་པར་བསྒོམ་མོ་༽རིག་པའི་རྒྱ་མཚོ་ལས་དཔའ་བོ། །༼འདིར་༽མདོར་བསྡུས་ནས་༼ཐབས་འདི་༽ནི་གསུངས་པ་ཡིན། །༼དེ་ཡང་༽ཕོ་ཉ་༼འོད་རིག་གམ་ཕོ་ཉ་དངོས་དང་༽གཉིས་༼སུ་༽མེད་༼པར་༽སྦྱོར་བའི་བདག༼གིས་༽ །འགྲུབ་འགྱུར་འདི་ལ་ཐེ་ཚོམ་མེད།དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་ཕོ་ཉ་མོའི་གཉིས་སུ་མེད་པའི་སྦྱིན་བསྲེག་དང་ལས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་བཞི་པའོ། །༼ལེའུ་འདིས་དྲང་དོན་དུ་ལས་བཞིའི་སྔགས་ཀྱི་བཟླས་པ་བསྟན།ངེས་དོན་ཆོས་ཀྱི་ཕྱག་རྒྱའི་རིམ་པ་བཞིན་བསྟན་༽དེ་ནས་༼རིམ་པ་༤༽ལས་ཀྱི་༼ཞི་བ་ལ་སོགས་པ་༽མཆོག་རབ་ནི། །༼ལུ་ཨི་པའམ་ནག་པོ་ལྟར་དང་པོ་ལྷར་སྐྱེད་ནས་དེ་ནས་བཟླས་པ་༽ཇི་བཞིན་༼ཆོས་ཀྱི་མུ་ཏྲས་བླ་མའི་གདམས་ངག་གི་རིམ་པ་༽རིམས་ཀྱིས་མཚོན་བྱ་སྟེ། །༼ཚོགས་བསགས་ན་་་་་་་དབང་བསྐུར་་་་་གདམས་པ་་་་་་་གསང་བའི་་་་ ་་་་་པའི་བར་དུ་བྱ་་་་་་ ་་་ནས་བཟླས་པ་ལ་འཇུག་པས་༽མཆོད་པ་གཉིས་མེད་སྦྱོར་བདག་ཉིད། །༼རིམ་པ་བཞི་བསྒོམ་པ་སོ་སོར་སྦྱོར་བའོ། ཞི་བ་ལ་སོགས་པ་ལས་བཞིའི་ཁ་དོག་ལ་སོགས་པ་༽ལས་ནི་སོ་སོར་སྦྱར་བར་བྱ། །༼རིམ་པ་༤་ལས་རྒྱུད་ཀྱི་རིམ་པ་སྟོན། དྲང་དོན་དུ་དེ་ལྟར་ཡབ་ཡུམ་གྱི་རྣལ་འབྱོར་ལ་གནས་པ་སྙོམས་པར་ཞུགས་པ་ལས་བྷ་གར་ཐིག་ལེ་ལས་སྔགས་བཞི་བོ་གང་རུང་དུ་བསྐྱེད་པའོ༽གང་ཡང་རབ་ཏུ་གྲགས་པའི་སྔགས། །༼དེ་ཡང་དང་པོ་སྤྲུལ་བ་ནས་གསལ་བར་བྱ་༽ དེ་ཡི་དབྱེ་བ་རིམ་༥༦༦༧༧༨༨་ཇི་བཞིན། །༼བཟླས་པའིདུས་སུ་དཔའ་བོ་༽ཁ་དོག་༼དཔའ་བོས་མཚན་པ་ཀ་ལི་༽ཕོ་ཉ་ལ་སོགས་སྔགས༼དཔའ་མོའི་སྔགས་་་་་་པ་་་ཨ་ལི་་་་་པུང་་་་་་་ཏེ་རྩ་གཡས་གཡོན་གཉིས་སུ་གསལ་བར་བསམ་པའོ་༽་ཀྱང་གསལ་བར་་་་ ་་དམིགས་ཏེ༽། །༼མྱུར་བར་༽མདའ་ཡི་༼འདི་མན་ཆད་ཀྱིས་རྒྱུད་རིམ་བསྟན་ངེས་དོན་དུ་༽ཤུགས་བཞིན་༼དེ་ཡང་རླུང་འབྱུང་འཇུག་གི་ སྟོབས་ཀྱིས་དཀྱིལ་འཁོར་བསྡུ་བ་དང་ཙཀྲ་གསལ་བར་དམིགས་པ་ལ་སོགས་པ་བྱེད་པས་༽ཡོངས་སུ་འཁོར། །༼ཡབ་ཀྱི་ལ་ཡུམ་གྱི་༽ཕན་ཚུན་མདུད་པའི་གསང་སྔགས་ནི། །༼ཞི་བ་ལ་སོགས་པའི་༽ཡུལ་ཉིད་ཀྱིས་ནི་༼ཙཀྲ་བཞི་དང་རྩ་གསུམ་གྱིས་༽ཕྱེ་བ་ཡིན། །ཞི་བ་ལ་ནི་༼དལ་བུས་༽ལྷོད་པ་སྟེ། །༼སྤྱིར་སྔགས་ལ་ཞི་དྲག་གཉིས་ལས་འདིས་སྔོན་ལ་ཞི་བ་གཙོ་བོར་བསྟན་༽དྲག་ཅིང་རྩུབ་པ་མ་ཡིན་ནོ་༼འདི་བབའ་ཏན་ཏའི་་་་རེས་ལ་མེར་་་སྒྲེས་པོ་རྣམས་ཀྱི་ལ་ཡེད་་་་་དེ་ཡན་ཆད་ཞི་བའི༽། །༼དྲག་པོ་ལ་༽ས་བོན་ཕྲེང་བ་༼སྔགས་དང་བསྒྲུབ་བྱའི་མིང་སྤེལ་བ་༽དེ་ནས་འཛིན། །ཧཱུཾ་ནི་༼སྙིང་གི་ཧཱུཾ་གི་༽མཐའ་རུ་༼ཧཱུཾ་ནས་མར་སོང་ནས་དད་ན་བཞི་བོ་གང་རུང་གི་མཐར་ཧཱུཾ་ཆེ་གེ་མོ་མ་ར་ཡ་ཧཱུཾ་ཅེས་པ་་་་ནི་ལྟེ་བར་དེ་དེའི་བར་དུ་སོང་བའོ༽གནས་པ་༼ལ་དེ་ནས་ ཨཾ་ལས་རླུང་སྟིམ་་་་དེ་མནན་པ་ལས་ལས་ཀྱི་རླུང་རིམས་ཀྱིས་དྲང་དོན་ངེས་དོན་༢་ཀ་འགགས་པ་ནི་༽ཡིན། །༼རླུང་༽བསྒྲུབ་བྱ་༼སྲོག ༽་་་འགོག་པར་གྱུར་ནས་ནི། །༼མྱུར་བར་འཆི་བ་༽གོམ་པ་༼རླུང་དབང་དུ་འདུས་པ་ལས་རླུང་ཕྱིར་མི་འགྲོ་བ་༽གཅིག་ཀྱང་མི་འགྲོ་འོ། །༼སྔགས་ཀྱི་རིམས་པ་བསྟན་ཏོ་༽ཁ་སྦྱོར་༼ཏ་ཐའི་རྒྱུད་བདག་གི་རྒྱུད་གཉིས་རླུང་གི་འགྲོ་འོང་བྱེད་པས་༽སྦྱོར་བར་གྱུར་བ་༼བཟླས་པ་ཡབ་ཡུམ་ཁ་སྦྱར་ལ་འཁོར་བ་༽དང་། །༼ཨ་ལི་དང་ཀ་ལི་ལས་བྱུང་བའི༽རྡོ་རྗེ་ལུ་གུ་རྒྱུད་༼དེ་ལྟར་གཏུམ་མོ་སྟོབས་སུ་གྱུར་པས་ཀྱང་༽བཅིངས་བས། །༼འོད་༽རྡོ་རྗེས་༼སྨིན་མཚམས་༽ཕྱེ་བ་ཉིད་དང་ནི། །དེ་བཞིན་༼འོད་ཀྱི་ཏ་ཐའི་ཙཀྲ་བཞིའི་བདུད་རྩི་་་་་༽་སྦྲང་བུའི་ཆུན་པོས་༼རབ་ཏུ་༽བསྐོར༼འོད་ཟེར་བསྒྲུབ་བྱའི་ཤེས་པ་འགུག་པ་འདིས་སྒྲོའི་ཆུན་་པོ་ལྟར་བུངས་ཆེ་བ་སྦྱར་བ་སྟེ་རྒྱས་པའི་མུར་ཡང་ཏ་ཐའི་ཡེ་ཤེས་ཀྱིས་བདུད་རྩི་་་་་་་བའི་ཕྱིར་འཁོར་་་་་་་ཐའི་ཤངས་བུ་་་་་་་གཡས་ནས་ཞུགས་༽། །༼ཨ་ལི་དང་ཀ་ལི་བྱུང་བའི་༽ལྕགས་ཀྱུ་༼ལྟ་བུའི་འོད་ཀྱིས་༽ཉིད་ཀྱིས་༼འདིས་ཀྱང་དབང་ཟིན་དུ་རླུང་གཟུང་ངོ་༽འགུག་པ་དང་། །༼སྔགས་ལས་བྱུང་བའི་འོད་ཀྱིས་གཏུན་ཤིང་ལྟར་བསྒྲུབ་བྱའི་སྙིང་བརྡུངས་པར་བསམ་༽གཏུན་ཤིང་གིས་ནི་༼འོད་ཀྱིས་ཙཀྲའི་ཤ་བུ་༽དཀྲུག་པ་དང་། །༼སྔགས་ལས་བྱུང་བའི་རྡོ་རྗེ་ལྟ་བུའི་འོད་ཀྱིས་དེའི་སྙིང་་་་་་་འི་ལག་པས་ཟེར་༽རྡོ་རྗེ་ཁ་ཡིས་༼འོད་ཀྱིས་བདུད་རྩི་བཀུག་སྟེ་༽བཟའ་བར་བྱ། །༼རེངས་པ་སྟེ་དབང་དུ་གྱུར་པ་འོད་མཎྚལ་ལྟ་བུས་སྙིང་དཀར་ནག་ལ་ཕོག་ལ་༽དབུག་པ་མདའ་ཡིས་སྦྱར་བར་བྱ༼ཚར་བཅད་པ༽། །༼འཁོར་རྗེས་སུ་བཟུང་བ་རྩ་བའི་རླུང་བྱང་སེམས་ལས་རྒྱ་ལ་ཡིན་ན་ཡིད་ཀྱིས་སྙོམས་འཇུག་བྱ་༽དུས་མིན་འཆི་ལས་རྒྱལ་བ་ཉིད། །༼ལུས་ལ་་་་་་བསྒྲུབ་བྱའི་སྤྱི་བོ་༽ཡན་ལག་༼སྤྱི་བོར་ཁཊྭཾ་ཀ་བསྒོམས་ལ་ཕྱོགས་བཅུའི་་་་བུད་དྷ་་་་་དང་པོ་དེས་ཏ་ཐ་ཐམས་ཅད་སྤྱན་དྲངས་ཏེ་དེ་ལ་ཐིམ་པས་་་་ཝི་དང་ལྡན་པར་གྱུར་ནས་མེར་གྱིས་ཞུ་སྟེ་ཚངས་བུག་ན་མར་ཐིམ་པས་ལུས་ཐམས་ཅད་བྱང་སེམས་ཀྱིས་མེར་གྱིས་ཁེངས་པར་བསམས་པ་་་་བས་དཔག་བསོ་བའམ་འཆི་བ་བསླུས་པར་འགྱུར་རོ་ཐོད་པའི་ལ་ཡང་དམིགས་རབ་དེ་བཞིན་ནོ་༽ ཁཊྭཾ་ཀ་དང་སྦྱར། །༼ཡང་ན། འབྲུ་་་་གསང་བའི་རིམ་པ་༽ཐོད་པའི་༼བདག་གི་རྒྱུད་ལ་བྱ་༽མཆོད་ཡོན་སྣོད་དུ་ནི་༼ཏེ་གཉིས་༡་དུ་སྦྱོར༽། །༼བདའ་་་སྐྱེད་པའི་བསྒྲུབ༽ཞལ་དུ་༼རྩ་དབུ་མ་༽མཚོན་ཆ་ངེས་པར་སྦྱར༼བས་སླར་འཚོ༽ ། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་གཉིས་སུ་མེད་པའི་༼དྲང་དོན་དུ་སྔགས་དང་བསྒྲུབ་བྱའི་མིང་།ངེས་དོན་དུ་བདག་གི་རྒྱུད་དང་ཏ་ཐའི་རྒྱུད་༽གནས་དང་དུས་མ་ཡིན་པར་༼ངེས་དོན་དུ་འཁོར་བ་ལས་རྒྱལ་བ་བསད་པ་གསོ་བ་༽འཆི་བ་བསླུ་བའི་ཆོ་གའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་ལྔ་པའོ། །དེ་ནས་༼ལེའུ་འདིས་འོག་རིགས་ལ་བརྟེན་པ་ཕྱག་རྒྱ་དང་ལས་རྒྱ་གཉིས་བསྟན་༽ཕྱག་རྒྱ་མཆོད་ཆེན་དང་། །༼ཀུན་སྤྱོད་ལྟར་གཉིས་ཀའི་གནས་ལྔ་བརླབ་པ་༽སྔགས་ཀྱི་དགོད་པ་རབ་ཏུ་གྲགས༼འོད་རིག་དང་དངོས་གཉིས་ཡིན་ན་ཡིད་ཀྱིས་སྙོམས་འཇུག་བྱ༽། །༼དངོས་མིན་ན་༽ཕྱག་རྒྱའི་༼སྙོམས་འཇུག་གི་བདེ་བ་དེ་ཁོ་ནའི་མཆོད་པའི་བར་གྱིས་༽མཆོད་པ་འདི་དག་གིས། །༼ཆེ་བ་དངོས་གྲུབ་དཔེའི་ཡེ་ཤེས་ཀྱིས་དོན་གྱི་ཡེ་ཤེས་རྟོགས་པས་༽མྱུར་དུ་འགྲུབ་པར་ཐེ་ཚོམ་མེད། །༼འོད་རིག་མ་ལས་རྒྱ་མ་གང་རུང་དང་བསྒྲུབ་པ་པོའི་མཁའ་གསང་ཀུན་སྤྱོད་ལྟར་བསླབ་པ་༽མཚན་མ་གཉིས་ལ་སྔགས་སྦྱོར་བས། །༼ལས་ཀྱི་མུ་ཏྲ་ཝ་ར་ཧིར་སྐྱེད་༽མཁའ་འགྲོ་༼སྙོམས་འཇུག་མུ་ཏྲ་ཝ་ར་ཧིར་སྐྱེད་ཧེ་རུ་ཀ་༽དཔའ་བོ་གཉིས་མེད་པའི། །༼ཡུམ་གྱི་མཁའ་བྱིན་གྱིས་བརླབས་པས་༽༼འདི་དག་་་་་་ཏུ་་་མ་ཀིར་ཏིའི་དཔེ་ལ་མེད་༽པད་མའི་འོད་ནི་དྲི་མེད་པ་༼རྡོ་རྗེ་འོད་ནི་དྲི་མ་མེད་ཅེས་པས་ཡབ་ཀྱི་མཁའ་གསང་བྱིན་གྱིས་བརླབ་པ་ཤུགས་ལ་འོང་༽ ། །༼འོད་རིག་མ་རྐྱང་མ་དང་པོ་་ སྙོམས་འཇུག་༽རྣལ་འབྱོར་མ་ལ་༼ཐིག་ལེ་འཛིན་པ་དང་གསང་གནས་རྨབ་ནུས་པས་༽མཁས་པས་མཆོད། །༼ལས་རྒྱ་ཡིན་ན་དངོས་སུ་ཁ་ནས་བརློབ་པ་༽ཕྱག་རྒྱ་༼ཁ་་་་པང་གཞི་ལ་སོགས་པ་རྨབ་་་་་་་༽གནོན་པའི་༼རེངས་པ་སྟེ་དབང་དུ་གྱུར་བ་༽ལས་རྣམས་ནི། །དེ་བཞིན་མཚོན་ཆ་ཉིད་དང་༼རྡོ་རྗེ་དང་པད་མ་དངོས་སུ་སྦྱར་བའམ་ཡིད་ཀྱིས་༽སྦྱར། །སྔགས་པས་༼དཔའ་མོས་་་་་་ལས་རྒྱའམ་འོད་ཀྱི་མུ་ཏྲ་ཝ་ར་ཧི་དང་༽མཁའ་འགྲོ་མ་སྦྱོར་ལ། །སྙིང་པོ་༼རྩ་སྔགས་ལ་སོགས་པའི་སྔགས་རྣམས་གནས་གསུམ་སུ་སྙིང་པོ་དྲུག་པ་ལ་སོགས་པ་ཡུམ་གྱི་གནས་ལྔ་བརླབ་པ་༽རྣམས་ཀྱིས་དེ་བཞིན་བྱ། །བསྲུབ་པ་༼དངོས་སམ་རིམས་ཀྱིས་འོད་རིག་ལ་བསྐྱོད་པ་༽མཁའ་འགྲོ་༼མ་དང་༽བློ་༼མ་དང་༽ལྡན་མ་༼ཧེ་རུ་ཀ་དེ་ང་རྒྱལ་གྱིས༽། །༼སྤྱིར་་འགྲོ་གསུང་༽དག་པའི་ལུས་ཀྱིས་༼ལུས་ལྷར་བསམ་་་་་ལུས་ཀྱིས་་་་་་པར་འཇུག་༽དེ་བཞིན་བྱ། །༼འདི་མན་ཆད་དམ་རྒྱ་ལྟར་སྔགས་ཀྱིས་ལས་བཞི་བསྒྲུབ། ལས་རྒྱ་ལྟར་དགའ་བ་བཞི་བསྒོམ་པ་སོར་སོར་སྦྱར་བར་བྱའོ་༽དཔའ་བོ་༼ལས་རྒྱ་རྐྱང་མ་དང་སྦྱོར་བས། འདི་ན་རེ་རེ་ལ་མར་སོ་སོར་སྦྱོར་༽མཆོད་པའི་ཆོ་ག་ཤེས་༼དམ་རྒྱ་དང་སྙོམས་འཇུག་བྱས་པ༽ །༼དེ་ལྟར་དེ་ཁོ་ནའི་པུ་ཙའི་བར་བྱས་ནས་སྔགས་འཁོར་བར་བསམ་༽ལས་༼ལས་ཀྱི་རྒྱ་ལྟར་ན་དངོས་སུ་སྙོམས་འཇུག་གི་སྦྱོར་བ་༽ནི་༼རྡེས་ན་འདི་སྔགས་ཀྱི་ཁ་རུ་དེ་དང་སྦྱོར་བ་ལས་བྱུང་བའི་བྱང་སེམས་ཐིག་ལེར་བསམས་ལ་དེ་ལས་སྔགས་སུ་བསམ་པའམ་གསུང་༽འབད་པ་ཉིད་ཀྱིས་བྱ། །༼ལས་བཞིའི་སྔགས་ཀྱི་དབྱེ་བ་ལ་དགའ་༤འི་༽རྣམ་དབྱེ་༼ཁབ་རྩེའི་ཀ་ར་ན་ལས་དཔེས་སྦྱོར་བ་ཤེས་པར་བྱ་གསུང་༽རང་དགར་སྔགས་པ་ནི། །༼འོད་རིག་དང་སྦྱོར་བ་ལས་ཐིག་ལེ་སྔགས་ཀྱི་ཕྲེང་བ་གྱེན་ལ་དྲང་། རྐྱང་མ་དངོས་དང་སྦྱར་བ་ལས་བྱང་སེམས་གྱེན་ལ་དྲང་བ་༽ཕྱིན་ཅི་ལོག་ཏུ་ངེས་པར་༼ཡང་ན་དྲག་པོའི་སྔགས་ཀྱིས་སྦྱར་༽སྦྱར། ༼དགའ་བྲལ། གདུག་པ་རྣམས། དྲག་པོའི་སྔགས་ཀྱིས་༽ཚར་བཅད་པ་དང་ཕན་གདགས་༼མཆོག་དགའ་སྟེ་ལྷན་སྐྱེས་ལ་ཕན་འདོགས་པས་༽ཕྱིར། །༼སྔགས་ཀྱི་ལས་༤་༽ལས་ཀྱི་དངོས་པོ་༼དགའ་བ་ལ་མངོན་དུ་མཆོག་དགའ་དང་བར་དུ་དགའ་བྲལ་ཐ་མར་འབྱུང་བར་ཤེས་པས་སོ་༽རྣམས་པར་བསྒོམ། །༼དགའ་བ་༤་༽དེ་ཉིད་དབྱེ་བས་ཕྱེ་ནས་༼དགའ་བ་བཅུ་དྲུག་གི་དབྱེ་བ་ཡང་གསུང་ལས་བཞིའི་སྔགས་ཀྱིས་༽ནི། །༼དམ་རྒྱའི་ཐིག་ལེ། རྩ་དབུ་མར་རོ་༡་པར་སྦྱར་བར་བྱ་༽རྩ་ཡི་ལམ་དུ་སྦྱར་བར་བྱ་༼སྔགས་ཀྱི་ཕྲེང་བ་ཡར་དྲངས་པ། དབུ་མ་ནས་ཡར་དྲངས་པ་ལས་དགའ་བ་བཞི་སྐྱེའོ༽། །སྦྱོར་༼པའི་དུས་སུ་སྙོམས་འཇུག་གི་དགའ་བ་༽བ་རབ་ཏུ་བསྒྲུབ་རྣམས་ལ༼འབྲས་བུ་དམ་རྒྱ་དང་ལས་རྒྱ་༢་ཀ་ཐུན་མོང་དུ་བསྟན་པའོ། འདིས་མཚོན་ནས་ཐུན་མོང་གི་དངོས་གྲུབ་ཐམས་ཅད་དང་མཆོག་ལ་སོགས་པ་འགྲུབ་པར་ཤུགས་ཀྱིས་ཤེས་པར་བྱ༽། །༼སྙོམས་འཇུག སྔགས་༽འདི་ཡིས་རབ་ཏུ་བསྒྲུབ་བྱ་སྟེ། །ལྷ་དང་ལྷ་མིན་རྣམས་དང་ནི། །མི་དང་བཅས་པ་མྱུར་འགྲུབ་འགྱུར། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼སྙོམས་འཇུག་གི་བདེ་བ་༽དེ་ཁོ་ན་ཉིད་ཀྱི་མཆོད་པ་དང་༼ཐིག་ལེ་ལས་བྱུང་བའི་སྔགས་ཁ་དོག་བཞི་ལས་བཞི་བཞི་བསྒྲུབ་པ་༽ལས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་དྲུག་པའོ། །༼ལེའུ་འདིས་གོང་དུ་བསྟན་པའི་རྐང་པ་བདེ་བླག་ཏུ་མ་རྙེད་ན་དབང་དུ་བྱ་བའི་ཐབས་བསྟན་༽དེ་ནས་གཞན་ཡང་བཤད་པར་བྱ༼རྩ་བའི་སྔགས་བསྙེན་པ་སྔོན་དུ་སོང་བས་དོན་༣་ལས་དོན་དང་པོ་ཁ་ཟས་ཀྱི་ལས་ཀྱི་ཕྱག་རྒྱ་མ་དབང་དུ་བྱ་བ་བསྟན༽། །༼རྐྱང་མ་དབང་དུ་བྱ་བའི་ཆོ་ག་རྩ་བའི་སྔགས་ཀྱི་ལས་༽གཟུགས་ནི་གནོན་པའི་ཆོ་ག་སྟེ། །༼ཡུམ་གྱི་རྩ་བའི་སྔགས་གཉིས་སུ་མེད་པ་༽ཕན་ཚུན་སྦྱོར་བའི་གསང་སྔགས་ནི། །༼རྐང་པ་༽མཁའ་འགྲོ་མ་དང་༼མིང་ཤམ་དུ་སྤེལ་ལ་བཟླས་༽གཅིག་ཏུ་སྦྱར། །ཆང་དང་ཤ་དང་བདུད་རྩི་ལྔ་བསྲེས་ཏེ་ཟོས་པ་ཟོས་ནས་མིད་པའི་རྫས་ལ་༼ལྟོ་བ་འཇུ་བའི་བར་ལ་སྔགས་བཟླས་ན་༽ནི། །༼རྩ་བའི་སྔགས་སྤེལ་ཚིག་དང་བཅས་པ་༽བཟླས་པའི་མཐར་ནི་སྐྱུག་པར་བྱ། །༼སྐྱུགས་པ་དེ་ཡང་ཐོད་པར་བླུག་ལ་སྲིན་ལག་གཡོན་པས་གཉེ་ཞིང་བཟླས་ལ་༽མཚན་མོ་བདུན་ནི་རྫོགས་པ་དང་། །༼ཞག་བདུན་དུ་བྱས་ལ་དེ་ནས་༽བཟའ་བ་༼དང་་་་་་་༽བཏུང་བ་དག་ལ་སྦྱར༼ལ་དེ་བྱིན་ནས་ཟ་རུ་བཅུག་པས༽། །འདི་ཡིས་ཇི་སྲིད་འཚོ་ཡི་བར། །༼རྐྱང་མ་དེ་༽དབང་དུ་འགྱུར་བར་གདོད་མི་ཟ་༼གཞན་ཡང་༽། །༼བ་༽སེར་སྐྱ་མར་ནི་༼བཞུ་སྟེ་༽འཐུངས་ནས་སུ། །དེ་ནས་བཟླས་༼པའི་༽མཐར་༼མར་དེ་༽སྐྱུག་པར་བྱ། །༼བསྒྲུབ་པ་པོའི་ནུབ་བདུན་རྫོགས་པ་དང་༽དེ་ཡི་རང་གི་གདོང་བཀྲུས་ནས། །གལ་ཏེ་༼སྔགས་བདག་ལ་༽རྟག་ཏུ་ཁྲོས་༼པར་༽གྱུར་བ༼དེ་༡་ཡིན་ཡང་༽། །༼བསྒྲུབ་པ་པོ་༽མཐོང་བ་ཙམ་གྱིས་དབང་དུ་འགྱུར། །༼གཞན་ཡང་༽ཏིལ་མར་༼གྱིས་དང་པོ་ལུས་ཐམས་ཅད་ཁྱབ་པར་བྱུགས་ལ་དེ་ནས་འབྲས་༽ས་ལུ་༼འབྲས་ཆན་གྱིས་༽བཏགས་པ་དང་༼ས་ལུས་དྲིས་ལ༽། །ལྡན་པའི་ལུས་ནི་བསྐུས་༼དྲིལ་༽འགྱུར་ཞིང་། །༼དྲིལ་བའི་འབྲས་ཟན་དེ་ཏིལ་མར་གྱིས་བཙོས་པ་༽སྣུམ་ཁུར་སྔགས་པ་བྱས་ནས་ནི༼དེ་ཚ་ཟར་གཞུག་པ༽། །བཟའ་བ་ལ་ནི་རབ་ཏུ་སྦྱར། །གལ་ཏེ་ལས་ནི་མ་བཏང་ན་༼ཟོས་པ་དང་རྗེས་སུ་བཟུང་བ་མ་བྱས་ན། བཟའ་བས་རྐྱང་མ་དབང་དུ་བྱ་བ༽། །ཇི་སྲིད་འཚོ་བར་དབང་དུ་འགྱུར། །༼གཉིས་པ་བྱུག་པས་རྐྱང་མ་དབང་དུ་བྱ་བ་༽ཏིལ་ནག་༼ག་༽དང་༼སྐྱེ་ཚེ། དེ་བལྟས་༽ནི་ཟོས་ནས་སུ། །སྐེ་ཚེར་བཅས་པ་སྐྱུག་པ་དང་༼དེའི་སྲིན་ལག་ཁར་བཅུག་སྟེ༽། །རུ་རྟ༼འི་ཕྱེ་མ་དང་བསྲེས་བ་༽་དག་དང་ལྡན་པར་ནི། །༼དེ་ནས་རང་གི་སེན་མོ་༽ལག་སྐྱེས་༼དང་༽བཤང་ལམ་༼ནས་༽འབྱུང་༼བའི་༽སྲིན་བུ༼དང་༽། །རང་གི་༼སྲིན་ལག་གཡོན་པའི་༽ཁྲག་དང་བརྟགས་ནས་ནི། །༼རང་༽སྭ་༼བྱེངས་༽ཤུག་ཀྲ་ནི་ཉིད་དག་༼དང་སྦྱར་ཟེར་༽དང་། །བཟའ་བཏུང་༼དུ་བྱ་བའི་བསྒྲུབ་བྱའི་༽མིག་སྨན་༼དུ་བྱས་ཏེ་བསྐུ་༽གོས་ལ་ནི། །༼བསྒྲུབ་བྱ་རྐྱང་མ་ལ་༽བྱུག་པ་ཉིད་དུ་རབ་ཏུ་སྦྱར། །༼བྱུག་པ་༽འདི་ཡིས་ཇི་སྲིད་འཚོ་ཡི་བར། །༼རྐྱང་མ་༽དབང་དུ་འགྱུར་བར་གདོད་མི་ཟ་༼བྱུག་པས་དབང་དུ་བྱ་བའོ༽། །༼༣་པ་སྦྱིན་བསྲེག་གི་དབང་དུ་བྱས་ན་༽བ་གླང་ཤ་བསྲེག་༼པ་དེས་༽སྦྱིན་བསྲེག་༼བྱེ་བ་༽དང་། །༼དེ་ཡང་བ་གླང་གི་༽ཁྲག་གིས་བསྐུས་༼ཀྱིན་སྦྱིན་བསྲེག་བྱས་༽ནས་ལྷ་རྣམས་༼བུ་མོ་ལ་སོགས་༽ནི། །དེ་ཡི་མོད་ལ་དབང་འགྱུར་བའམ། །གལ་ཏེ་མ་འོངས་༼དབང་མ་གྱུར་ན་ལྷ་དེ་༽འཆི་བར་འགྱུར། །༼བསྒྲུབ་བྱ་དངོས་སུ་༽ཤ་ཉིད་དེ་ཡི་མདུན་དུའམ། །༼ཡང་ན་བསྒྲུབ་བྱ་ཡིད་ཀྱིས་མདུན་དུ་༽བསྒོམས་ནས་མཁས་པས་༼བ་ལང་ཤའི་༽སྦྱིན་བསྲེག་བྱ། །༼བུ་མོ་༽སྦྱི་བསྲེག་༼གྲུབ་པ་བསྟན་པས་༽མཐར་ནི་༼བ་ལང་ཤའི་༽གཏོར་མ་བྱ། །༼བུ་མོ་༽ཁམས་གསུམ་༼ན་ཡོད་ཀྱང་༽སྐད་ཅིག་གིས་འགུགས་༼ཤིང་དབང་དུ་༽འགྱུར། །༼བར་མ་ཆད་པར་༽མཚན་བདུན་གྱིས་ནི་༼ཉིན་མོ་གསུང་༽འགྲུབ་པར་འགྱུར། །༼དེ་ལྟ་བུའི་ཐབས་དེ་གཞན་ལ་སྦ་བ་བསྟན་༽འཇིག་རྟེན་གསུམ་ན་རྙེད་དཀའ་བའི༼རྒྱུད་ཀྱི་ཆེ་བ་ཕན་ཡོན་མང་གསུང་༽། །༼རྐྱང་མ་དབང་དུ་བྱ་བའི་ཐབས་བསྟན་པ་༽དམ་ཚིག་སྤྱོད་པའི་མཚན་ཉིད་ནི༼ཐམས་ཅད་ལས་རྩ་བའི་སྔགས་བཟླས་པ་དང་བཅས་པ་ལས་སྒྲུབ་པ་གོ་བར་བྱའོ༽། །རྟག་ཏུ་རང་སྔགས་༼རྩ་བའི་སྔགས་༽སྦས་པ་ཡིན། །༼དམ་ཚིག་པ་ལ་རྩ་སྔགས་དང་རྐྱང་མ་ལ་སོགས་པ་༽རབ་ཏུ་འབད་དེ་གསང་བར་བྱ། །༼རྩ་སྔགས་ལ་བརྟེན་པའི་དབང་དུ་ཐབས་གཞན་ནས།  དམ་ཚིག་ལ་སོགས་པ་མ་ཐོབ་པ་ལ་དབང་གི་དམ་ཚིག་བྱིན་ཀྱང་༽སྦས་དོན་རྙེད་པར་མི་འགྱུར་ཞིང་། །སྐལ་བ་དམན་པས་འགྲུབ་མི་འགྱུར། །༼སྔར་༽བསོད་ནམས་ཆུང་བའི་བསྒྲུབ་པོས་ཀྱང་། །༼དམ་ཚིག་བསྲུངས་ཤིང་༽ང་མཉེས་བྱས་པས་འགྲུབ་པར་འགྱུར། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼རྐྱང་མ་དེ་ལ་བརྟེན་ཏེ་གྲུབ་ཉེ་བས་ན་༽ནང་གི་བདག་ཉིད་ཀྱི་དབང་དུ་བྱ་བའི་༼སྦྱིན་བསྲེག་༽ཁྱད་པར་དུ་བྱ་བའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་བདུན་པའོ། །དེ་ནས་༼ལུས་ཀྱི་བརྡ་ལ་སོགས་པ། རང་དོན་གྱི་སྤྱོད་པ་༣་ལས་སྤྲོས་བཅས་ཀྱི་སྤྱོད་པའི་བྱ་བ་དང་བྱ་བ་མ་ཡིན་པའི་ཆ་བསྟན་༽བརྡ་རྣམས་༼ཀྱིས་བསྟན་པའི་༽མཁའ་འགྲོ་མའི། །༼གཡོན་གྱི་ཀུན་ཏུ་སྤྱོད་པའི་༽ལུས་ཀྱི་མཚན་ཉིད་༼ གཡོན་གྱི་ཀུན་སྤྱོད་སྦ་བ་ལ་སོགས་པ་བྱ་བ་དང་བྱ་བ་མ་ཡིན་པའི་ཆ་རྣམས་༽གང་ཡིན་དང་། །དཔའ་བོའི་ཡན་ལག་དབྱེ་བ་ནི། །དེ་བཞིན་དུ་ནི་བཤད་པར་བྱ། །༼ཉིན་མོ་དམ་ཚིག་མེད་པའི་ཐད་དུ་༽དཔའ་བོའི་༼ཧེ་རུ་ཀའི་༽དབང་ཕྱུག་༼བྲིས་སྐུ་ལ་སོགས་པ་གཞན་གྱིས་མཐོང་བར་༽མི་བྲི་ཞིང་། །༼དམ་ཚིག་མེད་པ་དང་དབང་མ་ཐོབ་པ་ལ་༽གང་གི་༼པོ་ཏི་ལ་སོགས་པ་༽ཐད་དུའང་མི་༼དེ་གླག་པའམ་གདོན་པར་མི་བྱ་༽གདོན་ནོ། །༼དམན་པའི་འགྲོ་བས་མི་ཚོར་བར་༽གཡོན་པའི་ཀུན་སྤྱོད་༼དང་༽ལེགས་༼པར་༽སྦས་པ། །༼གཞན་ཡང་སྣོད་མིན་ལ་༽གསང་བའི་མཚན་ཉིད་མཁའ་འགྲོ་ཡི། །༼རྩ་བའི་སྔགས་ལ་སོགས་པ་༽སྔགས་ནི་བག་མེད་པས་༼སུ་རུང་རུང་གི་གམ་དུ་༽འདོན་ན། །དེ་ལ་ང་ནི་མི་ལྟ་སྟེ། །༼ཧེ་རུ་ཀས་མ་བསླབས་པས་༽མཁའ་འགྲོ་༼ལས་ཀྱི་མཁའ་འགྲོ་༽སྟོང་ཕྲག་དུ་མ་༼ལོ་ཀ་པའི་༽ཡིས། །༼འདིའི་ཉེས་པ་༽ངན་པའི་བདག་ཉིད་ཅན་དེ་ཟ། །༼གཞན་ཡང་སྐྱོན།  ཉམས་པ་དེ་མན་ཏྲའི་གཞུང་ལས་འགལ་བར་སྤྱོད་པ་༽དམ་ཚིག་འཛོམས་ཞིང་༼བླ་མ་ལ་སོགས་པ་༽ངན་སྤྱོད་པ༼་ལ༽། །༼ཕ་རོལ་གྱི།འཇིག་རྟེན་པ་་་་་མི་དང་དེའི་ནང་ནས་་་་དང་བྲམ་ཟེ་༽བྲམ་ཟེ་གསོད་༼པ་དང་འདྲ་བར་༽པ་ཐེ་ཚོམ་མེད། །༼དེ་ལྟ་བུར་༽སྡིག་སྤྱོད་༼སྡིག་ཆེ་བས་དེ་བཞིན་དུ་དམ་ཚིག་མི་བསྲུང་བའི་༽རྨོངས་པའི་བདག་ཉིད་ཅན། །བསླུས་འགྱུར་༼བླ་མའི་བཀའ་༽ངན་བའི་བདག་ཉིད་དེ། །མཁའ་འགྲོ་མ་ཡིས་ཟོས་གྱུར་ཀྱང་། །དེ་ལ་ང་ནི་སྐྱོབ་མི་བྱེད། །༼འགྲོ་བ་རིགས་དྲུག་གསུང་༽གསང་བ་ཡི་ནི་ནང་ན་ནི། །བསྒྲུབ་པོ་དེ་ནི་༼མཁའ་འགྲོ་མ་རྣམས་ཀྱི་གྲོང་རྒྱུར་མཐོང་བས་༽ཕྱུགས་དང་འདྲ། །༼བྱ་བ་དང་བྱ་བའི་ཆ་བསྟན་པ་༽བླ་མ་ལ་འཁུས་༼པ་དང་༽དམ་ཚིག་ཉམས་༼པ་དེ་༽། །༼དངོས་གྲུབ་མི་ཐོབ་པ་ལྟ་ཞོག་གི་༽མཐོ་རིས་འཇིག་རྟེན་ལས་དེ་༼མི་ལུས་ལས་ངན་སོང་དུ་ལྷུང་༽ལྟུང་༼སྟེ་དམྱལ་བར་སྐྱེ༽། །ཧེ་རུ་ཀ་དཔལ་༼གྱི་སྔགས་ལ་༽འཇིགས་༼པའི་༽སྔགས་༼སུ་རང་གི་སྲོག་ལྟར་༽བལྟ། །གང་ཞིག་༼གསང་༽བསྲུང་བར་བྱེད་པ་ནི། །མཁའ་འགྲོ་མར་༼དཔའ་བོ་དང་༽བཅས་དགེ་༼བའི་བསམ་པ་དང་ལྡན་པའི་༽བསྡོང་དང་། །དེ་ལ་༼ཧེ་རུ་ཀ་༽ང་ནི་༼བསྲུང་ཞིང་བྱིན་གྱིས་བརློབ་༽ཕན་འདོགས་སོ། །བླ་མས་ཀྱང་ནི་༼བྱིན་གྱིས་བརློབ་༽དགོངས་པ་སྟེ། །༼སྔགས་ལེགས་པར་བསྒྲུབ་པ་པོ་༽གསང་བར་བྱེད་ཚེ་བསྒྲུབ་པ་པོ། །༼དམ་ཚིག་ལ་གནས་པ་༽མཁའ་འགྲོ་མ་ལ་རྟག་དགའ་བ་༼ཡིན་པས༽། །དེ་ལ་དངོས་གྲུབ་༼༢་ཀ་༽འབྱུང་བར་འགྱུར། །བསྒྲུབ་པ་པོ་༼ཚད་མའི་སྐྱེས་བུ་ཡིད་ཆེས་པའི་གནས་སུ་༽དབང་ཉིད་༼ཀུན་ལ་བསྟན་ལ་ཡིད་ཆེས་སུ་མི་འགྱུར་ཏེ་རེ་རེ་ཙམ་ལ་༽འགྱུར། །ཁམས་གསུམ་མཁའ་ལ་རྒྱུ་བའི་བདག་༼ ཉིད་རྣམས་ཀྱི་༽ །བསྒྲུབ་པོ་དཔའ་བོ་ཉིད་འདོད་པ་༼གསང་པ་ལ་གནས་པའི༽། །ཐམས་ཅད་དུ་ནི་༼བསྒྲུབ་པ་པོ་དེ་ལ་༽མཆོད་༼པ་བྱེད་༽པར་འགྱུར། །དེ་ནི་རྣལ་འབྱོར་ལ་༼གཉིས་ལ་འཇུག་པས་༽འཇུག་དགའ། །༼དེ་༽ཡང་དག་སྦྱིན་པའང་རིག་པར་༼བླ་མས་གདམས་པ་གནང་ཞིང་གོ་བར་༽འགྱུར། །༼ང་རྒྱལ་བརྟན་པའི་༽ཧེ་རུ་ཀ་ཡི་བརྟུལ་ཤུགས་འཛིན། །སློབ་དཔོན་དཔའ་བོ་མཐོང་གྱུར་ན་༼དགའ་བར་བྱ་༽། །བསྒྲུབ་པ་པོས་ནི་སྔགས་འདི་དག་༼ལྷག་པའི་ལྷ་༽ །མཐོང་ཞིང་མཐོང་ཞིང་༼ལྷག་པའི་ལྷ་མཐོང་པ་དང་འདྲ་བར་བླ་མ་ལ་༽ཀུན་ཏུ་དགའ་༼བར་བྱེད༽། །རྩ་བའི་སྔགས་ཀྱི་༼ནི་མཆོག་ཡིན་ལ། དེ་བས་དང་༽གསང་སྔགས་མཆོག་༼ཏུ་གྱུར་པ༽ །དཔའ་བོ་ཡི་གེ་བདུན་པ་ནི། །༼གཞན་ལ་གསང་བའི་ཚུལ་གྱིས་༽འཛིན་པར་གང་ཞིག་བྱེད་པ་ནི། །༼ཧྲི་ད་ཧ་ལ་༽ཨོཾ་དང་ཧཱུཾ་གིས་ཁྱད་པར་དབྱེ། །དེ་རྣམས་༼དེ་རྣམས་བླ་མ་དང་སྔགས་ལ་སོགས་པ་ལ་༽འབད་དེ་༼སཾབྷ་རའི་རྣལ་འབྱོར་༽ཕྱག་བྱ་ཞིང་། །སངས་རྒྱས་ཐམས་ཅད་ལ་སོགས་མཆོད༼་པ་དང་འདྲ༽། །༼༣་པ་ཕན་ཡོན་དངོས། ཡང་ན་ཤིན་ཏུ་སྤྲོས་མེད་སྟོན་༽རྟག་ཏུ་དཔའ་བོ་ཆེན་པོ་༼ཧེ་རུ་ཀ་༽དང་། །རོལ་བར་༼བྱིན་གྱིས་བརློབ་པར་༽ལྡན་བར་༼གོ་འཕང་ཐོབ་པ་༽ཐེ་ཚོམ་མེད། །༼ཧེ་རུ་ཀ གཞན་ཡང་༽དེ་ཡི་ཐུགས་ཁ་ནས་ཕག་མོ༼དང་༽། །དཔའ་བོ་༼རྣམས་ཉི་ཤུ་རྩ་་་་་༽དང་ནི་རྣལ་འབྱོར་མ་༼གསུམ་བཅུ་བདུན༽། །ཕོ་ཉ་རྣམས་དང་ལྷན་ཅིག་བཅས༼་པས་བྱིན་གྱིས་བརློབ༽། །དེ་ཡིས་གང་ཞིག་ལེགས་སྐྱེས་པ། །༼བསྒྲུབ་པ་དེ་གཞན་གྱིས་མཐོང་ནས་མཐོང་བ་དེ་ལ་་་་སུ་་་འགྱུར་༽སྲོག་ཆགས་༼ཀྱིས་མཐོང་བ་ལ་སོགས་པས་ཀྱང་༽བསོད་ནམས་༼་་་་་་༽མཐོང་བ་ཡིན། །༼གཞན་ཡང་༽ཆུ་བོ་རྒྱ་མཚོ་རྫིང་བུ་དང་། །རི་བོ་དང་ནི་བཞི་མདོ་༼སྟེགས་དང་ཟེར་༽དང་། །ལྟེང་ཀ་དང་༼ཙཀྲ་ལ་བརྟེན་པ་ཙཀྲའོ་ནི་ཁ་ལྔ་པའི་དང་འདྲ་གསུང་སྟེ་མི་གཙོ་༽ནི་ཁྲོན་པ་དང་། །ཁང་སྟོང་དང་ནི་༼གཞི་མདོ་ཟེར་༽ལམ་སྲང་དང་། །༼གནས་དེ་རྣམས་༽ཐམས་ཅད་དུ་༼བསྒྲུབ་པ་པོ་གནས་ཀྱང་༽ནི་༼དེ་གནས་ཀྱང་༽མཁའ་འགྲོ་མ། །༼དེ་དག་བསྒྲུབ་པ་པོ་ལ།  ཐུན་བསང་དང་མཆོག་གི་དངོས་གྲུབ་གཉིས་ཀ་འཇིགས་མེད་ལ་སྟེར་༽ཀུན་ཏུ་ཞན་པར་ལྟ་ལ་གནས། །༼གཞན་ཡང་༽འཇིགས་པ་ཆེན་༼བསྒྲུབ་པ་པོ་ལ་ཆགས་པས་གསུང་༽པོའི་དུར་ཁྲོད་དང་། །མཁའ་འགྲོ་༼སྟེང་དུ་འགྲོ་བ་༽དེ་བཞིན་ས་འོག་དང་༼དེར་རྒྱུ་ལ་༽། །རོ་ལངས་ཀྱི་ནི་དུ་མ་༼གཟུགས་༽ཞིག །འཇིགས་པའི་གཟུགས་དང་སྟོབས་ཆེན་པོས། །དེ་༼དག་༽དང་ལྷན་ཅིག་དཔའ་བོ་ཆེ། །༼བསྒྲུབ་པ་པོ་༽ཅི་བདེ་བར་ནི་༼འཇིགས་པའམ་ཉམ་ང་བག་ཚ་མེད་པར་༽རོལ་བར་མཛད། །རི་སུལ་ཚང་ཚིང་༼དུ་གནས་ཀྱང་༽གསང་བ་དང་༼དཔའ་བོ༽། །༼རྣལ་འབྱོར་མ་༽གསང་བའི་མི་མོ་རྣལ་འབྱོར་མ། །ཕྱོགས་ནི་༼གང་དུ་༽དེ་དང་དེ་དག་ཏུ་༼གནས་པའི་ཆེ་བ༽། །བསྒྲུབ་པ་པོ་དང་༼ལྷ་༢་བྱིན་གྱིས་བརློབ་༽ས་སྟེང་རོལ། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་རྣལ་འབྱོར་མའི་ས་དང་གསང་བའི་དཔའ་བོ་སྔགས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་སུམ་ཅུ་རྩ་བརྒྱད་པའོ། །༼ཧ་བརྒྱད་དང་ལྡན་པས་དུར་ཁྲོད་ལ་སོགས་པར་འཇིགས་པ་མེད་པར་གནས་པ་ལ་ཐུན་མོང་པའི་སི་ཏི་འགྲུབ་སྐུ་གསུམ་འགྲུབ་པར་བཤད་༽༼ལཾ་གྱི་གསང་བའི་རིམ་པ་གཉིས་ལ་གནས་པའི་རྟགས་སམ་མཚན་མ་བསྟན་པ་གསུང་༽༼སི་ཏི་དེའི་མཚན་མ་ལེའུ་སོ་དགུ་པ་ནས་ཞེ་གཉིས་པའི་བར་གྱིས་བསྟན། དེ་ལས་དང་པོ་བསྟན་པ་ཐོབ་པའི་ཛོ་གིའི་དུར་ཁྲོད་ལ་སོགས་པར་རྒྱུ་བའི་དུས་སུ་ཊ་ཀི་རྣམས་བསྐུལ་བའི་ཕྱིར་ཧ་ཧོ་སྔགས་བརྒྱད་བརྗོད་པས་བསྐུལ་ནས་ཊ་ཀི་རྣམས་དང་། དེས་མི་འཇིགས་ན་བྱིན་གྱིས་བརློབ་ ་དེ་ལྟ་བུ་དེ་ཚད་མའི་སྐྱེས་བུའམ་གང་ཟག་མཆོག་ཡིན་པས་༽དེ་ནས་བསྒྲུབ་པའི་རྣལ་འབྱོར་ཆེ། །སྔགས་ནི་རྣམ་པ་བརྒྱད་པོ་༼བཞད་པ་རྣམས་པ་བརྒྱད་པའི་སྔགས་༽དགོད་༼བརྗོད་པས་༽། །དེ་ནས་༼རྣལ་འབྱོར་པ་༽འདི་ལ་༼མཁའ་འགྲོ་རྣམས་ཀྱི། ཧེ་རུ་ཀར་༽ཡང་དག་མཐོང་། །༼མཁའ་སྤྱོད་མ་ལ་སོགས་པར། དང་པོ་ ཏྲིས་འདིའི་ལས་ཀྱི་ཚོགས་ཙཀྲ་བརྟེན་པའོ།  བར་དུ་བྲིས་པས་འདི་ལས་བཞི་གང་འདོད་བསྒྲུབ་གསུང་ཕྱིས་འཁོར་ལོ་ལས་བསྒྲུབ་པ་མི་འོང་ཞེས་ ཏྲིས་པས་གསུང་༽གསོལ་བར་འགྱུར་བར་གདོད་མི་ཟ། །འཇིགས་པའི་༼བསྒྲུབ་པ་པོ་ཡིས་དུར་ཁྲོད་དུ་ཧ་ཧ་ལ་སོགས་པའི་སྒྲ་སྒྲགས་ན༽སྒྲ་ནི་རྣམ་མང་པོ་༼ས༽། །མི་བཟད་༼ཧ་ཧའི་སྒྲས་༽མཁའ་འགྲོ་༼མ་ཐམས་ཅད་༽འཇིགས་༼པར་༽བྱེད་༼པ༽་པ། །༼ཧ་ཧ་ལ་སོགས་པའི་སྔགས་ཀྱིས་༽ཤིན་ཏུ་འཇིགས་པའི་༼བསྒྲུབ་པ་པོ་༽དཔའ་བོ་ནི་༼རྗོད་པས༽། །༼མཁའ་འགྲོ་རྣམས་༽སྐྲག་ཅིང་རྣམ་པར་འབྱེར་བར་༼བྲོས་ནས་འགྲོ་༽བྱེད། །གལ་ཏེ་དཔའ་བོ་༼ལས་ཀྱི་མཁའ་འགྲོ་ལ་སོགས་པ་འཇིགས་པའི་སྒྲས་༽མི་འཇིགས་ན། །༼བསྒྲུབ་པ་པོའི་༽ལག་པ་གཡོན་པས་བཟུང་ནས་ནི། །རང་གི་གནས་སུ་༼མཁའ་སྤྱོད་ལ་སོགས་པར་༽ཁྱེར་བར་བྱེད། །༼བསྒྲུབ་པ་པོ་༽མི་རྣམས་མཁའ་འགྲོ་༼ཞིང་སྐྱེས་༽དེ་དག་དང་། །རྟག་ཏུ་༼ནམ་མཁའ་ལ་འགྲོ་བར་༽མངོན་པར་རྩེ་བྱེད་དེ། །༼བ་ར་པས༽བདེ་བ་ཅན་གྱི་༼ཚེ་རིང་བར་འགྱུར་༽གནས་འདྲར་འགྱུར། །ཧེ་རུ་ཀ་དཔལ་གནས་༼སམ་གོ་འཕང་༽འདོད་པས། །མཁའ་ལ་འགྲོ་བའི་གནས་སུ་༼རེས་ཤིག་༽ཁྱེར༼དེ་ཡན་ཆད་ཐུན་མོང་༽། །བསྒྲུབ་པ་པོ་ནི་སྔགས་ལུས་ཅན་༼ལྷར་བསྒོམ་པ་༽། །༼མཆོག་སྐུ་༣་༽འཁོར་བའི་རྒ་༼པ་པ་ མཚོན་བ་དང་འཆི་བ༽དང་སྐྱེ་བ་མེད་༼དེར་མ་ཟད་ཆོས་ཀྱི་སྐུ་ཡང་ཐོ་བ་པོ་༽། །༼དེ་ནས་ རྒྱུ་བའི་སྐུ་བྱུང་སྟེ་༽འགྲོ་བ་ཐམས་ཅད་སྡུད་པར་འགྱུར་༼བདུད་རྩི་ལྔ།དོན་བྱེད༽།དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་ཧ་༼ པ་ལ་སོགས་པ་༽ཧ་ཞེས་རྒོད་པའི་ལེའུ་སྟེ་༼་་ རབ་བསམ་གཏན་འབྲིང་སྔགས་དང་༢་ཐ་མ་ལ་རྫས་སམ་འཁྲུལ་འཁོར་དང་༣་གྱིས་ཀྱང་རྐྱང་མ་དབང་དུ་བྱ་བ་བསྟན་༽སུམ་ཅུ་རྩ་དགུ་པའོ། ། ༼ལེའུ་འདིས་སྔར་མ་ འདིས་ལམ་གྱི་གསང་བའི་ལམ་བརྟེན་པའི་དབང་དུ་བྱེད་་་སེམས་བསྟན་པས་ལས་སྦྱར་བ་ཙམ་་་་་གྱི་དབང་དུ་བྱ་བ་བསྟན། སྔ་ཕྱིའི་འབྲེལ་ཡིན་མིན་བྱས་པའི་རྐྱང་མ་དབང་དུ་བྱ་བ་བསྟན། ཤ་ལྔ་ལ་སོགས་པའི་སྦྱིན་བསྲེག་གིས་རིགས་ལྔའི་བུ་མོ་དབང་དུ་བྱ་བ་བསྟན༽ །དེ་ནས་ད་ནི་བཤད་བྱ་བ། །གང་གིས་མི་རྣམས་༼་་་དང་རྐྱང་མ་ལས་ལ་སྦྱར་བ་ཙམ་གྱིས་༽དབང་དུ་འགྱུར། །རྣལ་འབྱོར་༼བདེ་བ་ཅན་ལྟ་བུའི་༽སྔགས་ཀྱི་ཆོ་གར་གནས། །༼ ༣་མ་ལ་ན་མེད་༽ས་ལ་གནས་པ་༼པའི་རྐྱང་མ་རྣམས་༽གང་ཡིན་པ། །དཔའ་བོ་བཟླས་༼པ་ལ་སོགས་པ་ཡིས་༽པས་༼རྐྱང་མ་དབང་དུ་༽འགྲུབ་པར་འགྱུར། །༼སྦྱིན་བསྲེག་གིས་རྐྱང་མ་དབང་དུ་བྱ་བ་བསྟན་ཏེ།ཤ་ལྔ་ཆང་ཁྲག་བསྲེག་རྫས་ཉ་སོགས་ཟེར་༽སྒྲོན་མ་མྱོས་བྱེད་བཅས་པ་དང་། །ཉ་ཡི་ཤ་དང་ལྡན་པར་ནི། །དཔའ་༼བོའི་༽དབང་༼པོས་༽གནས་སྐབས་ཐམས་ཅད་དུ་༼ ཐུན་༣་འམ་༤༨་ཧོ་མ་བྱ་སྟེ་་་ལས་ཀྱི་ཕྱག་རྒྱ་༽། །ཉི་མ་བདུན་གྱིས་སྒྲུབ་བྱེད་པ། །༼དེ་ཡང་དུས་༽མཚན་མོ་སྦྱིན་བསྲེག་བྱེད་ལ་༼ཕྱིའི་དང་ནང་གི་སྦྱིན་བསྲེག་བཟའ་བ་དང་༢་ཀ་༽གཞོལ། །དངོས་གྲུབ་༼རྐྱང་མ་དབང་དུ་བྱ་བའི་༽རྒྱ་ཆེན་༼ལས་ལ་སྦྱར་བ་ཙམ་གྱིས་༽གསོལ་བར་འགྱུར། །བརྒྱ་དང་རྩ་བརྒྱད་ལྡན་ཉིད་ཀྱིས།༼སྦྱིན་བསྲེག་གཞན་ཡང་སྔར་གྱི་རྫས་ཀྱི་སྟེང་དུ་སྒྲུབ་བྱའི་སྐྲ་སེན་དང་རྐང་དྲེག་གྱི་རྡུལ་ ་་པས་སྦྱིན་སྲེག་བྱས་ན་སྦྱིན་སྲེག་སྔ་གྲོ་ཕྱི་གྲོ་དགོངས་ཀ་༣་དུ་༽ །ཐུན་གསུམ་དུ་ནི་སྒྲུབ་བྱེད་ན། །༼འདི་དག་རྒྱལ་རིགས་ལ་སོགས་པའི་བུ་མོ་དབང་དུ་བྱ་བའི་གཞུང་དུ་མཛད་དེ་སེམས་བརྟན་པ་ཐོབ་པས་རྒྱལ་པོ་དང་བློན་པོ་ལ་སོགས་པ་དབང་དུ་བྱ་བའི་གཞུང་དུའང་མངོན་༽རྒྱལ་པོ་དཔུང་དང་བྲམ་ཟེ་ལ་སོགས་པ་བཅས་པ་ནི། །ཞག་བདུན་གྱིས་ནི་དབང་དུ་འགྱུར། །ཕྱེད་ཀྱི་༼སྦྱིན་སྲེག་ལྔ་བཅུ་བཞི་༽དཔའ་བོ་ཆེན་པོ་༼སྔགས་པ་དབང་དུ་འགྱུར་༽སྟེ། །དེ་ཡི་ཕྱེད་ཀྱིས་༼ཉི་ཤུ་༧་༽བློན་པོ་འོ། །རྒྱལ་ཕྲན་ལ་ནི་སུམ་ཅུ་གཉིས། །༼བུད་མེད་དབང་དུ་བྱ་བའི་ཞོར་ལ་ཐམས་ཅད་དབང་དུ་བྱ་བ་བསྟན་༽བསྲེག་པའི་རིམ་གྱིས་སྦྱིན་བསྲེག་བྱ་༼འི་རིགས་ཀྱི་བུ་མོ་འོག་མ་འང་སྦྱར་རོ༽། །ཉི་ཤུ་བྲམ་ཟེ་ཉིད་ལ་ནི། །༼དེ་ཡང་༽ཉི་མ་བདུན་གྱི་སྦྱིན་བསྲེག་བྱ། །༼ར་ཛའི་རིགས་སུ་གྱུར་བ་ཙམ་༽དེ་བཞིན་རྒྱལ་རིགས་དག་ལ་༼སྦྱིན་བསྲེག་༽བདུན། །སྦྱིན་བསྲེག་ལྔ་བོ་༼འདི་དག་བུ་མོ་༽རྗེ་རིགས་ལ། །དམངས་རིགས་ལ་ནི་སྦྱིན་བསྲེག་གསུམ། །ཐ་མ་ལ་ནི་སྦྱིན་བསྲེག་༼གདོལ་བའི་རིགས་སམ་མཐར་སྐྱེས་མ་༽གཅིག །དེ་ལྟར་དཔའ་བོ་༼ས་༽རིགས་༼ལྔའི་༽རིམ་གྱིས། །༼སྔོན་དུ་སྙེན་པ་༽ཟླ་བ་༼ ཨོ་རྒྱན་སྣ་རྩ་ཁ་རང་ནི། རྗེ་ངར་གཏུམ་མོའི་རིགས་སུ་བྲིས། ཁོ་བོའི་ སྡོམ་མོང་ཐམས་ཅད་ལ། རྟགས་དང་མཐེ་བོ་པུས་མོ་དང་། ལྟེ་བ་རྡོ་རྗེ་ཕག་མོ་ཡིན། སྤྱི་བོ་སྤྱི་གཙུག་སོར་མོ་དང་། བོལ་གོང་གཤིན་རྗེ་མ་ཡིན་ནོ། མཆན་ཁུང་ནུ་མ་འགྲིན་པ་དང་། བརླ་ནི་རྨོངས་བྱེད་མའི་རིགས། སྨིན་འཚམས་མིག་དང་སྙིང་ཁ་དང་། འདོམས་བར་སྐྱེད་བྱེད་མིའི་རིགས། ལྟག་པ་སྣ་གཡོན་དཔུང་པ་དང་། ཤཾ་ལམ་སྐྲག་བྱེད་མའི་རིགས ༽གཅིག་ནས་ཡང་དག་སྡུད་༼ དུས་ཀྱི་སྙེན་པ་བྱས་ནས་སྦྱིན་བསྲེག༽། །སྔགས་དང་ལྡན་པའི་བསྒྲུབ་པ་པོས། །༼ འདི་སྦྱར་བ་ཙམ་གྱིས ལས་སྦྱོར་ཙམ་གྱིས་༽འགྲོ་བ་ཐམས་ཅད་༼ཁྱད་པར་དུ་རྐྱང་མ་༽དགུག་པར་བྱ། །༼དེ་དབང་དུ་གྱུར་བའི་རྐྱང་མ་དེ་༽དཔའ་བོ་ཆོ་ག་འདི་༼ ཧོ་མ་ཡི་༽ཡིས་ནི། །༼སྙོམས་འཇུག་བྱས་ན་༽འདོད་པ་བསྟེན་༼ཆོ་ག་༽ན་༼སི་ཏི་༽འགྲུབ་པར་འགྱུར། །༼མ་ཧ་དེ་བ་ལ་ཨུ་མ་ལ་སོགས་པའི་བཙུན་མོ་དུ་མ་ཡོད་པ་དབང་དུ་འདུས་པ་བཞིན་༽ས་སྟེང་འདོད་པའི་དབང་ཕྱུག་བཞིན། །༼རང་༽དཔལ་ལྡན་སྐལ་བ་བཟང་པོར་༼རྐྱང་མ་དུ་མ་དབང་དུ་༽འགྱུར། །༼ ལས་བཅུ་གཉིས་བསྒྲུབ་པ་བསྟན་༽བསྒྲུབ་པོ་མཁའ་འགྲོ་མ་༼རྐྱང་མ་༽རྣམས་ཀྱི། །ཡིད་འོང་འགྱུར་བར་གདོད་མི་ཟ། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་རིགས་ལྔ་བོ་དབང་དུ་བྱ་བ་དང་ཕྱག་རྒྱ་ཆེན་པོ་༼སྐུ་གསུམ་ལམ་གྱི་བདེ་བ་༽བསྟེན་བའི་ལེའུ་སྟེ་བཞི་བཅུ་བའོ། ། ༼ ལེའུ་འདིས་སུཾ་་བྷ་ནིས་ལས་བསྒྲུབ་པ་དངོས་གྲུབ་ཀྱི་མཚན་མ་བསྟན་སུཾ་་བྷ་ནི་ལ་བརྟེན་པའི་ལས་སུཾ་བྷ་ནི། སུཾ་བྷ་ནིས་བསྲུང་ཐབས་བར་ཆ་བསྲུན་པ་༽ །དེ་ནས་ལས་ཀྱི་རབ་མཆོག་ནི། །༼གང་ཞིག་ཟེར་༽གང་གིས་ཤེས་ན་བསྒྲུབ་པ་པོས་༼སྙེན་པ་སྔོན་དུ་སོང་བས༽། །དབང་དང་དགུག་དང་དབྱེ་བ་དང་། །བསད་དང་བསྐྲད་པ་༼ཞི་རྒྱས་ཀྱང་བསྡུ་གསུང་༽ལ་སོགས་དང་། །༼སེམས་རྨོངས་པ་ཙམ་༽རྨུགས་དང་རེངས་བར་བྱ་བ་དང་། །༼འདི་ཡང་སེམས་མི་གསལ་བ་༽རྨོངས་དང་དེ་བཞིན་ཕུར་བུས་གདབ། །ཚིག་འཕྲོག་ལྐུགས་པར་འགྱུར་བ་དང་། །འོན་དང་༼བཅུ་༽དེ་བཞིན་ལོང་བ་དང་། །༼བཅུ་༡་༽མ་ནིང་ཉིད་དུ་བྱ་བ་དང་། །༼བཅུ་གཉིས་པོ་༽གཟུགས་ནི་༼དུ་མར་བསྒྱུར་བ་༽ཡོངས་སུ་༼མི་རྣམས་དུད་འགྲོར་བྱ་བ་ལ་སོགས་པ་༽བརྗེ་བ་སྟེ། །༼ གཙོ་བོར་བར་ཆད་མེད་པ་ཙཀྲ་རེ་རེ་ལ་༣་༣་༽ལས་ཆེན་བཅུ་གཉིས་འདི་དག་ནི། །དངོས་གྲུབ་བསྒྲུབ་པ་པོ་ལ་ནི། །དྲན་པས་༼དབང་པོ་རབ་སེམས་བརྟན་པ་ཐོབ་པའི་དབང་དུ་བྱས་པ་༽འགྲུབ་འགྱུར་གདོད་མི་ཟ་༼འདི་མན་ཆད་ལས་ཆེན་བཅུ་གཉིས་བསྒྲུབ་པར་བསྟན་ཏོ། དབང་པོ་འབྲིང་ལ་སོགས་པ་ལ་སྔགས་ཀྱི་ཆེ་བ་ཙམ་མོ༽། །༼དེ་ལྟར་ལས་ཆེན་བཅུ་གཉིས་བསྒྲུབ་པའི་སྔོན་དུ་ལྷའི་རྣལ་འབྱོར་བསྒོམ་པ་བསྟན་༽ཤར་དང་བྱང་གི་གནས་ལ་༼མཚོན་ཆ་ཙམ་སྟེ་སྐུ་གསུང་ཐུགས་ཀྱི་ཙཀྲ་༣་ཀ་ལ་གདོད་ནས་གྲུབ་པའི་དུར་ཁྲོད་འདི་ལྟ་བུའི་དངོས་གྲུབ་དེ་ཡང་མཁའ་འགྲོ་མར་གསོལ་བས་མཁའ་འགྲོ་མར་བསྟན་༽སོགས། །༼གཙོ་བོ་བཞི་༽མཁའ་འགྲོ་མ་ནི་ཐམས་ཅད་དང་༼གནས༽། །༼ཆོས་ཀྱི་སྐུ་ལས་བྱུང་བས་༽ཡེ་ཤེས་ལྡན་པའི་༼ལོང་སྐུ་ལྷན་ཅིག་སྐྱེས་མ།སྤྲུལ་བ་མཆོག་གི་ཞིང་སྐྱེས་མ།མཆོག་གཅིག་ཡིན་པས་སྔགས་སྐྱེས་མ་སུམ་བཅུ་བདུན་གྱི་ཕག་མོས་བསྡུས་པས་ལས་ཆེན་བཅུ་གཉིས་རྩོལ་བའི་ལྷན་ཅིག་སྐྱེས་མ་ལ་སོགས་པ་༣་༽རང་སྐྱེ་གནས། །ཡུལ་དང་ཡུལ་དུ་མངོན་པར་སྐྱེ། །རྡོ་རྗེ་དཀྱིལ་འཁོར་༼གྱི་༽གཙོ་མོ་སྟེ། །༼དེ་ཕན་ཆད་མཁའ་འགྲོ་མ་༣་སྤྱིར་བསྟན་༽དེ་ནི་མཁའ་འགྲོ་མ་རྣམས་བཤད། །༼བར་འདི་ནས་མར་སོ་སོར་བཤད་༽ཀུ་ལུ་ཏ་དང་༼ཞིང་སྐྱེས་བསྟན།མྱ་ངན་༽དགོན་པ་༼མར་ངོ་༽དང་༼འདི་ནས་མར་བཞི་སྐུའི་ཙཀྲའི་འཚམས་མ་༤་མས་རིམ་པར་བསྟན༽། །སིན་དྷུའི་ཡུལ་༼ན་ག་རར་༽དང་གྲོང་ཁྱེར་དང་། །༼སུ་ཝརྞ་༽གསེར་གྱི་གླིང་དང་༼སྐུའི་ཙཀྲ་ཕྱོགས་བཞི་ལས་རིམ་པས་ཞིང་སྐྱེས་སྤྲུལ་བའི་སྐུ་སོ་སོར་བསྟན་༽སོའུ་ར་ཥཊ། །༼ གྲི་ཧ་དེ་བ་༽དེ་བཞིན་ཁྱིམ་གྱི་ལྷ་དང་ནི། །༼པྲེ་ཏ་པུ་ར། གསུང་གི་ཙཀྲའི་འཚམས་མ་བཞི་ལས་རིམ་་་༽ཡི་དྭགས་གོང་དང་ཁ་བའི་གནས། །ཀན་ཙི་ལམ་པ་ཀ་ཡི་ཡུལ། །ཀ་ལིང་ཀ་དང་ཀོ་ས་ལ༼གསུང་གི་ཕྱོགས་བཞི་ལས༽། །ཏྲི་ཤ་ཀུ་ནེ་ཨོ་ཊེ་དང་། །ཀ་མ་རུ་པ་མ་ལ་བ། །ལྷ་མོའི་མཁར་དང་ར་མི་༼ཤ་ར་༽དབང་། །གོ་ཏ་༼ཝ་༽པཪྻཾ་ཨར་པུ་ཏྱ། །ཨུ་རྒྱན་ཛ་ལན་དྷ་ར་དང་། །པུ་ལུ་ར་མ་ཡ་ལ་སོགས། །ཡུལ་འདི་དག་གི་བུ་མོ་གང་། །༼ཉི་ཤུ་བཞི་༽དཔའ་བོ་༼དང་༽གཉིས་མེད་རྣལ་འབྱོར་མ། །དེ་ཀུན་༼གདུལ་བྱ་བསམ་པ་དང་བསྟུན་ནས་་རྒྱུ་བ་དང་སྤྱོད་ལམ་དུ་མ་བསྟན་ཏོ་༽འདོད་པའི་གཟུགས་ཅན་ཏེ། །ཡིད་ཀྱི་ཤུགས་ཀྱིས་འཇུག་པ་ཡིན། །༼དེ་དག་གི་བསྡུ་བྱ་བཟློག་སྟེ་བསྟན་པ་༽རྣལ་འབྱོར་མ་དྲུག་ཀུ་ལུ་ཏ་༼ར་གང་གིས་ན་བསྡུས་པ་སྟོན༽། །༼མ་ རོར་༽མྱ་ངན་ཡུལ་ན་༼འཁོར་ལོ་བསྒྱུར་མ་༽མ་མོ་རྣམས་༼རྡོ་རྗེ་ཕག་མོའི༽། །སིན་དྷ་༼སིན་དྷུ་དང་ནི་ན་ག་ར་གང་ཞིག་རིགས་ཀྱི་སྐུའི་འཚམས་བཞི་པོ་འདི་དྲུག་གི་ནང་ན་ལ་མས་བསྡུས་༽ཉིད་དུ་ལ་མ་སྟེ། །རིགས་ཀྱི་གཙོ་མོ་༼ཤིན་ཏུ་དཔའ་མོ་༽ན་ག་རར། །༼རྨོངས་བྱེད་མ། གསེར་གླིང་དུའོ་༽ལམ་བ་༼ལཾ་པ་ཀ་དང་སོ་ར་ཥར་གང་ཞིག་རིགས་ཀྱི་ལྷ་ཉིད་༽དང་༼སྐུའི་༽ནི་སོའུ་༼ཤོནྜི་ན་༽རཥཊ་༼འཁོར་ལོའི་གོ་ཆ་མ༽། །རིགས་༼ཁྱིམ་གྱི་༽ཀྱི་ལྷ་མོ་༼ཁཎྚ་རོ་ཧ་༽རྣམས་༼འདི་འཚམས་སྦྱོར་ཡིན་གསུང་༽ཡིན་ཏེ། །ཡི་དྭགས་༼གཙོ་མོའོ་༽གྲོང་དུ་ནག་ཆེན་མོ་༼ཡ་མི་ནི༽། །མཁའ་འགྲོ་མར་བཅས་རུ་པི་ནི་༼་སྟེ་སྐུའི་འཁོར་ལོ་ཕྱོགས་བཞི་བོ་དེ་ གཟུགས་ཅན་མས་བསྡུས༽། །༼ཁྱིམ་གྱི་ལྷར་ནི་བུ་མོ་གང་༽ཁ་བའི་རི་དང་ཀན་ཙི་༼རྟ་རྣ་མ་༽དང་། །༼སྐྱེད་བྱེད་མ་གཉིས་མ་ལ་བའོ།  ལཾ་པ་ཀ་ཡིན་༽པན་ཙ་ལ་ཡི་ཡུལ་དག་དང་། །༼ཤིན་ཏུ་བཟང་མིན་ ཤིང་གྲིབ་མ་༢་སྐྲག་བྱེད་མ་གྲི་ཧ་དེ་བ་ ལྷ་མོ་ཤ་མ་དེ་ཝི་༽ཁྱིམ་གྱི་ལྷ་མོ་ཀ་ལིང་ཀར། །༼ཀ་ལིང་ཀ་དང་ཀོ་ས་ལར་བརྟུལ་ཞུགས་འཛིན་མ་ཤ་ཟ་མ།  ཡོངས་གྱུར་མའི་མིང་གི་རྣམ་གྲངས་༽བརྟུལ་ཞུགས་འཛིན་པ་༼མ་དང་ཤ་ཟ་མ་གཉིས་ཀ་ལྟུང་བྱེད་མའོ་༽རྣམས་༼ཡོངས་གྱུར་མས་གསུང་གི་འཚམས་བཞི་བསྡུས་༽ཡིན་ནོ། །༼གསུང་གི་ཕྱོགས་༽ཀོ་ས་ལར་ནི་༼ཆང་འཐུང་མ་༽ཤ་ཟ་བ། །༼འཁོར་ལོ་ཤུགས་ཅན་མོ་༽ཡི་དྭགས་གྲོང་དུ་གྱུར་བ་རུ་༼བ་ར་ཧི། པྲེ་ཏ་པུ་རི་ཡིན་ནོ། ཡི་དྭགས་ཏྲི་ཤ། ཀུ་ན་གྲོང་དང་དེ་༣་དུ༽། །༼འཇིགས་བྱེད་ཆེན་མོ་གསུང་༽རྡོ་རྗེ་མཁའ་འགྲོ་༼རླུང་ཤུགས་ཅན་མ་ཨོ་དེར་ཨེ་ར་བ་ཏི་གསུང་༽སྦོམ་དབང་ཕྱུག །༼ཨེ་ར་བ་ཏི༽ཏྲི་ཤ་ཀུ་ནི་༼རིམ་བཞིན་ལྟར་ན་འདི་འཇིགས་བྱེད་ཆེན་མོ་གསུང་༽ཁཎཊ་རོ་ཧུ་༼བྱིས་བཅས་མོས་གསུང་གི་ཕྱོགས་བཞི་བསྡུས་༽། །༼འདི་ལ་འདོད་ལྡན་མ་ཞེས་ཀྱང་བྱ་འདི་ཕྱོགས་དང་པོ་རང་ནས་སྨོས་༽དེ་བཞིན་༼འདི་དག་གིས་མཚོན་ནས་མི་ལྡོག་མ་དང་ཨེ་ཧི་ཀ་ལྷ་མོ་༢་ཀྱིས་ཐུགས་ཀྱི་འཚམས་བཞི་དང་ཕྱོགས་༤་སྡུས་པར་བྲེས་པར་བྱ་སྟེ་དེ་ཡང་དེ་བཞི་ ན་གཤེགས་པ་འདིས་ཤེས་གསུང་༽བུ་ལི་ར་མ་ལ། ༼ གསེར་གླིང་དུ་ནི་ཅི་གསུང་དང་། དེ་༤ན་དུ་ནི་ཨུ་རྒྱན་ཉིད ཡུལ་འདི་རྣམས་ཀྱི་བུད་མེད་གང་། དཔའ་མོ་དང་ནི་གཉིས་མེད་ཁྱབ།  སྤྱིར་མཁའ་འགྲོ་མ་དཔག་དུ་མེད་པ་ཡོད་པ་ལས་མདོར་བསྡུས་ནས་འཛཾ་བུའི་གླིང་ན་ཞིང་སྐྱེས་ ཆ་ལུགས་ལྷོད་པར་གྱུར་བ་སྟེ་དེ་ལྟར་ཐུན་མོང་མ་ཡིན་པ་བཞིའོ་༽༼ ཛ་ལན་དྷ་ར་ཨུ་རྒྱན་ཏེ་དེ་གཉིས་གཏུམ་བྱེད་མའི་རིགས༽ །གསེར་གླིང་རྨེ་ཤ་ཅན་བུད་མེད། །༼ཊ་ཀི་ཀ༢་ལྟར་ན་རེ་རེ་ལ་འཁོར་སྟོང་ཕྲག་གཉིས་སེམ་གསུང་༽སྟོང་ཕྲག་ཉི་ཤུ་རྩ་༼བཞི་ཟེར་༽གཅིག་ཡིན། ༼ཉི་ཤུ་རྩ་༤་ལས་ལྷག་བཅུ་གཉིས་ཡིན་ན་ཡང་ཙུམ་བི་ཀ་མ་སྨོས་པས་དེས་མཁའ་འགྲོ་མ་སྙིང་པོའི་བཞི་བསྡུས་ལ།  སྒོ་འཚམས་མ་བརྒྱད་ཧེ་རུ་ཀའི་ཕྱག་རྒྱ་དཾ་བམ་སྡུད་པ་མོས་བསྡུས་པའོ༽ །༼ཉི་ཤུ་་་་་་པོ་༽དེ་ལས་ལྷག་པ་༼བཅུ་གཉིས་སམ་ཕྱིའི་བརྒྱད་༽ཇི་རྙེད་པ། །དཔལ་ལྡན་ཧེ་རུ་ཀ་ཡི་ནི། །༼སྙིང་པོའི་རྣལ་འབྱོར་མ་༤་༽འཁོར་ལོ་རྣལ་འབྱོར་མ་༼བྷ་ར་ཧིས་བསྡུས་པ་༽ཡིན་ནོ། །ཤྲི་ཧེ་རུ་ཀའི་སྲུབ་པ་ཆེ༼ཡུམ་བྷ་ར་ཧི༽། །དེ་ཡི་དཀྱིལ་འཁོར་༼ཧེ་རུ་ཀ་༽གཙོ་མོ་༼བྷ་ར་ཧི་༽ཡིན། །༼དྲུག་གི་བླ་མས་བསྡུས་པས་༽མཁའ་འགྲོ་ཉི་ཤུ་རྩ་བཞི་འདིས། །རྒྱུ་༼བ་ལྟར་༽དང་མི་རྒྱུའི་འཇིག་རྟེན་༼ཐམས་ཅད་གཞལ་ཡས་ཁང་དུ་་་་་་སྤྱི་བཅུ་གཅིག་ཛ་ལན་དྷ་ར་༽གསུམ། །༼རྟེན་དང་རྟེན་པའི་ལྷས་གཅེར་བུ་རྒྱན་བཏགས་སྟེ་གང་བྱས་ན་༽འགྲོ་བ་ཐམས་ཅད་འདི་ཡིས་ཁྱབ། །༼བསྒྲུབ་པ་པོ་ལ་མཁའ་འགྲོ་མས་བྱིན་གྱིས་བརློབ་པ་ཡང་༽མཁའ་འགྲོ་མ་འདིའི་དམ་ཚིག་ནི། །སྤྲུལ་བའི་༼སྐུ་༽བསྒོམ་པ་༼མཆོག་གིས་བསྡུས་༽ཉིད་ཡིན་ཏེ། །བསམ་གཏན་༼སྔགས་སྐྱེས་ཞིང་སྐྱེས་ལ་སོགས་པར་ཞེན་ཏེ་བསྒོམས་པས་༽ལ་སོགས་༼བཟླས་པ་སོགས་༽གང་ཅིའང་རུང་༼ལ་གནས་པས༽། །ས་སྟེང་ན་༼ཡོད་པའི་དངོས་གྲུབ་རྣམས་༽ནི་རྫོགས་འགྱུར་རོ། །སྔགས་པས་རྟག་ཏུ་༼རྣལ་འབྱོར་བཞི་ལ་༽མཉམ་བཞག་པས། །༼དུས་༽མཚན་མོ་ནམ་མཁའི་གོས་ཅན་༼གསང་བར་བྱ་བ་ཡིན་པས་གཅེར་བུའམ་དུར་ཁྲོད་་་་༽བྱ་༼པ་པོ༽། །༼དཔའ་བོ་༽སྐྱེས་པའམ་༼དཔའ་མོ་༽གལ་ཏེ་གཡོན་པ་ཀུན། ༼རླུང་འཛིན་ནུས་པས་དྲངས་པ་ འཛིན་མི་ནུས་པས་ཝེས་བླང་མུ་ཏྲ་༢་བཅར་ལུས་བཟུངས་རྒྱས་པར་བྱའོ༽ །རྣལ་འབྱོར་མ་དང་དཔའ་བོ་དགེས། །ཕྱག་རྒྱ་༼པད་སྐོར་༽གར་༼དང་ཧྲི་ཧ་ཧ་སོགས་ཀྱིས་༽གྱིས་མཆོད་པ་ཡིས། །༼སྔགས་སྐྱེས་ལ་ལྷན་སྐྱེས་ལས་་་་་་་་་ཞེན་ནས་་ཕོ་ཉ་བསྲེས་ལ་༽རང་བྱུང་རྟག་ཏུ་མཆོད་ན་ནི། །མ་ལུས་ལུས་པ་༼སི་ཏི་༽མེད་འགྲུབ་༼པ་ལས་བྱུང་བའི་རྟགས་༽ཅིང་། །གཡོན་པས་མཆོད་ལ་རབ་ཏུ་འཇུག དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼པཱུ་ཛ་སྭོ་༽ཡི་གེ་ཉི་ཤུ་རྩ་བཞིའི་དཀྱིལ་འཁོར་༼ལ་རྣལ་འབྱོར་མ་ཉི་ཤུ་རྩ་བཞི་༽དགོད་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་གཅིག་པའོ། །༼སྔ་ཕྱིའི་བྲེལ་ལོ་་་་སྔགས་སྐྱེས་ལ་མཆོད་པས་ཞིང་སྐྱེས་མཆོད་པར་འགྱུར།དེས་ལྷན་སྐྱེས་མཆོད་པར་འགྱུར། ལེའུ་འདིས་རྣལ་འབྱོར་མ་བརྟེན་པའི་ཐབས་བསྟན་༽དེ་ནས་༼རྟགས་ཉི་ཤུ་ཚང་ན་ལྷན་སྐྱེས་རྟོགས་པ་མཆོག་གི་དངོས་གྲུབ་ཀྱི་རྒྱུའོ་༽དཔའ་བོ་མེ་ཏོག་ཆུ། །འཐུངས་ནས་སྔགས་འདི་༼ཐ་མལ་བའི་ཁ་ཟས་བདུད་རྩིར་བྱིན་གྱིས་བརླབས་ནས་ལོངས་སྤྱོད་༽རྗེས་དྲན་བྱ༼འབྲ་བུ་ཟ༽། །ཕྱག་རྒྱ་༼༢་ཅར་ལུས་ཟུངས་རྒྱས་པར་བྱ་༽ལྷན་ཅིག་༼བུད་མེད་སྔོ་བསང་མ་རྟེན་ལ་དེའི་་་་་ལ་དྲོད་མ་ཡལ་བ་དེ་བདག་གིས་མཐུངས་ན་བདེ་བ་འབྱུང་སྟེ་བསྒྲུབ་པོ་ཉིད་ལུས་རྒྱས་ནས་མདངས་བཟང་བའི་བྱུང་བ་ཡིན་གསུང་༽བསྒྲུབ་པ་པོས། །༼གསང་བ་ཡིན་པས་བྱང་སེམས་རྒྱས་བར་བྱ་བའི་ཕྱིར་༽མཚན་མོ་རྟག་ཏུ་༼མི་ཤ་ལ་སོགས་པ་༽ཤ་༼ཆེ་བ་༽བཟའ་བྱ༼ཆང་ཡང་བཏུང༽། །སྔགས་གསུམ་བྱ་བ་༼ཟས་ཀྱི་ཐ་མལ་པའི་དུག་གཞོམ་པར་བྱ་བའི་ཕྱིར་མེ་གསུམ་གྱིས་བདུད་རྩིར་༽འདི་ཉིད་ཀྱིས། །གྲུབ་པའི་༼མཐར་ཆོས་སྐུ་༽བདེ་བ་ཐོབ་པར་འགྱུར། །༼བྱང་སེམས་ཤ་ཆེན་༽འཐུང་དང་དེ་བཞིན་༼ཕྱག་རྒྱ་མ་༽སྦྱིན་པ་དང་། །༼འདི་ལ་ལ་ན་མེད། སྐྱེ་༽ཐོག་མ་༼་་་་་་་བ་དང་པོར་དཔེའི་ཡེ་ཤེས་སྐྱེ་ལ་དེ་ལས་དོན་གྱི་མི་རྟོག་པའི རྒྱུད་ལ་སྦྱོར་བ་༽ཐ་མ་༼མི་རྟོག་པ་དང་༽དབུས་མེད་པ། །འཁོར་ལོ་༼ལྷན་སྐྱེས་ཀྱི་མིང་༽བསྒྱུར་བའང་དེ་བཞིན་ནོ། །༼ཕྱག་རྒྱ་བརྟེན་པའི་ཐབས་རྒྱས་པར་སྟོན་༽རེག་༼བསྒྲུབ་པ་པོས་༽དང་ལྷན་ཅིག་༼རེག་པར་བྱ། གང་དང་རེག་ན་རྐྱང་མ་ཕག་མོར་བྱིན་གྱིས་བརླབ་པ་དང་༽གཙོ་མོ་ཆེ། །བདེན་༼དང་།བྱང་སེམས་མི་འཆོར་༽པར་ཚངས་པར་སྤྱོད་པ་༼ཞེས་བྱའི་༽དང་། །ཐོག་༼རྐྱང་མ་དང་སྙོམ་པར་འཇུག་པའི་༽ཐོག་༼སྔོན། ཐ་མ་༽མཐའ་བཞད་༼པར་༽པའི་༼སྙོམ་འཇུག་དུས་སུ་ཐོག་མཐར་ཧ་ཧ་ལ་སོགས་པ་་་་་་་་་བརྒྱད་བརྗོད་པས་མཉེས་པར་བྱ་བ་བསྟན་ཏོ་༽ཕྱག་རྒྱ་བྱ༼ཧ་ཧ་ལ་སོགས་པ་ཐུང་ངུ་རྒྱད་བརྗོད༽། །༼མིག་ཐམས་ཅད་༽ལྟ་བའི་སྙེམས་༼སྦྱེག་པའི་ཉམས་༽པ་གྲགས་༼ཧ་ཧ་ལ་སོགས་པ་སྒྲ་ཆེར་༽ལྡན་པ་༼ལ་སོགས་པས་མཉེས་པའི་ཐབས༽། །༼དུས་༽མཚན་མོའམ་དེ་བཞིན་ཉིན་མོ་ནི། །༼ཐུང་ངུ་བརྒྱད་པོ་༽འདིས་ནི་བཞད་པ་དག་ཏུ་བྱ༼དེ་ཡན་ཆད་ཁ་ཟས་ལ་རྟེན་པས་ལུང་ཟུང་རྒྱས་པར་བྱའོ༽། །༼ཕྱིའི་༽གཟུགས་དང་༼ནང་གི ཀྱི་གསང་རྩའི ༽ལས་ཀྱི་གསང་བ་གང་། ཤོག་སྡེབ་༢༣་ངོ་ནས་རྟགས་ཅན་མང་པོ་ཞིག་ལ་བཙུད་རྒྱུ་མ་རྙེད །༼ཡུམ་གཉིས་ལ་ཕྱི་ནང་གཉིས་ཀྱི་གསང་བ་༽ཇི་ལྟར་གནས་པ་དཔའ་བོ་ཉོན༼ཕྱག་ན་རྡོ་རྗེ་ལ་བོས་པ༽། །རྟག་༼ཏུ་མི་གསང་ནིར་ཏེ་༽ཏུ་དེ་ཡི་མཆི་མ་འབྱུང་། །༼ནང་དུ་དགའ་བ་སྐྱེས་པ་༽དད་པས་དེ་ཡི་བ་སྤུ་༼གྱེན་ལ་༽ལྡང་། །རྡོ་རྗེ་ལས་ནི་འགོམ་མི་བྱེད། །དེ་བཞིན་ཕྱོགས་གོས་གྱུར་བ་མཆོད། །གཡོན་པའི་༼རྐྱང་མ་༽དབང་ཕྱུག་ཐམས་ཅད་༼དཔའ་༽ཀྱི། །འདི་ནི་༼འོག་གི་བཞད་པ་བརྒྱད་དང་ལྔར་༽ཕྱག་རྒྱའི་ཚོགས་ཀྱི་རིམ་༼པ་བསྟན༽། །༼བསྒྲུབ་པ་པོའི་ནང་གི་གསང་བ་ལྔ་ནི། རླུང་དབང་དུ་གྱུར་བས་ཅི་ཙམ་བསྡམ་ཡང་ཐུབ་ལ་དབུགས་དྲོ་ན་ཡང་བདེ་བ་བོང་དུ་བཏུབ་པས་༽དབུགས་འབྱིན་༼ལས་ཀྱི་གསང་བ་རྒྱས་བཤད་༽བསྐྱོད་དང་རྒོད་པ་༼དལ་བར་སྐྱོད་པ་དང་དབུགས་གནན་ཅིང་བསྐྱོད་པ་དང་དབུགས་རྔུབ་ཅིང་བསྐྱོད་པའོ་༽དང་། །༼སྔོན་དུ་༽སྒེག་དང་༼གླང་པོ་མ་ལྟ་བུ་ཡིན་ན་ཁབ་རྩེའི་ཀ་ར་ན་ལ་སོགས་པ་བྱ་༽གར་གྱི་ངོ་མཚར་དང་། །སྣ་ཚོགས་མདུན་དུ་བྱས་ནས་༼སོ་དང་སེན་མོ་གདབ་པ་ལ་སོགས་པ་༽ནི། །༼ཕྱོགས་གོས་གྱུར་བ་ནང་ལ་ཡང་ཡོད་༽ཕྱག་རྒྱ་༼དང་བཅས་པའི་བསྒྲུབ་པ་པོས་ཧ་བརྒྱད་ཀྱིས་རྒོད་པའི་འདོད་་་ན་་སུ་་བྱ་ཐུན་མོང་གི་གསང་བ་འདི་ལྔ་རྐྱང་མ་ལ་ཡང་བྲེས་པར་བྱའོ་༽སྔགས་ནི་རྗེས་དྲན་བྱ། །ཧ་ཧ་ཧེ་ཧེ་རྣམ་པ་བརྒྱད། །རྒོད་དང་སྣ་ཚོགས་དབང་མཆོག་དགའ། །ཧ་ཧའི་རྣམ་པ་ཉེ་བར་༼དེ་ལྟར་བསྒྲུབ་པ་པོའི་རྟགས་བཅུའོ་༽བརྟག །༼གཟུགས་ཀྱི་ཕྱག་རྒྱའི་༽ངུ་བར་༼ཕྱིའི་རྒྱུ་བའི་གསང་བ་ལྔ་ནི་༽བྱེད་པ་རྟག་ཏུ་༼རྐྱང་མ་ལ་ནང་དུ་བདེ་བ་སྐྱེ་བས།རྐྱང་མ་ལ་ལྔ་སྦྱར་བ༽བསྔགས། །དེ་ཉིད་ཀྱིས་དེ་དགའ་འགྱུར་ཞིང་༼བསྒྲུབ་པ་པོ་སྙོམས་པར་ཞུགས་པ་ལས་ནང་དུ་བདེ་བ་སྐྱེ་བས༽། །༼ཧ་ཧ་སོགས་༽སྔགས་དང་༼ནང་དུ་དགའ་བ་སྐྱེ་བས་༽བསམ་གཏན་ལེགས་སྦྱོར་བ༼སོ་དང་སེན་མོ་གདབ་པ་ལ་སོགས་པ༽། །གཙོ་མོ་༼བསྒྲུབ་པ་པོ་༽རྣམས་དང་༼འདི་རྣམས་༡་དུ་བགྲང་གསུང་སྟེ་ཐུན་མོང་བ་༽དཔའ་བོ་ཡི། །སྤུ་ལྡང་ལྷན་ཅིག་འབྱུང་བདེ་བ་༼གཏང་དང་བྲལ་བ་བསྣན་པས༽། ༼ གསང་རྩ་ལས་མི་འདའ་རྐྱང་མ་དང་བྱང་སེམས་སྡོམ་པ་༽ །རྡོ་རྗེ་བགོམ་པར་མི་བྱ་བ། །༼བུད་མེད་ཀྱི་བརྡའ་༽གཡོན་པས་ཡོངས་སུ་བརྟག་པ་ཡིན་༼ཅེས་ཕྱོགས་གོས་གྱུར་པ་དང་བཞི་ཧ་བརྒྱད་ཀྱི་དགོད་པ་དང་ལྔའོ༽ ། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་མཁའ་འགྲོ་མའི་གཟུགས་༼ཀྱི་ལས་ཀྱི་གསང་བ་༢་༽ཡོངས་སུ་བརྗེ་བ་དང་༼ཐུན་མོང་གི་ཧ་ཧ་སོགས་བརྒྱད་༽རྒོད་པའི་སྔགས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་གཉིས་པའོ།། །༼ཡི་གེ་བདུན་པའི་ལས་ཀྱི་ཚོགས་རྣམས་བསྟན་ཏེ་འབྲས་བུའི་གསང་བ་བསྟན༽དེ་ནས་༼ཡི་གེ་བདུན་པ་ལ་བརྟེན་པ་འབྲུ་ མ་གཅིག་གམ་བཞི་སྔོན་དུ་བྱ་སྟེ། དེ་ནས་ཉེ་བའི་སྙེན་པ་ཁྲི་ཕྲག་༤་འམ་༡་བྱས་ལ་ལས་སྦྱོར་བྱའོ། ཌ་ཀིའི་སྤྱན་གྱིས་༽གཟིགས་པ་༼འགྲུབ་ངེས་པས་༽བཤད་པ་སྟེ། །༼གང་ལ་གཟིགས་ན། ཧེ་རུ་ཀ་དང་༽དཔའ་བོ་དང་ནི་གཉིས་༼སུ་༽མེད་༼པར་བསྒོམ་པའི་༽མི། །གནས་ཀྱི་དབྱེ་བའི་༼ཕྱི་ནང་སྟེ་ནང་དུ་བསྒོམ་པར་༽ཆོ་ག་༼དེའི་གནས་མདོར་ན་དུར་ཁྲོད་ལ་སོགས་པ་༽ཤེས། ༼ སྤྱན་གྱིས་གཟིགས་པའི་རྒྱུ་བྱིན་གྱིས་བརླབ་པའོ༽ །བསྒོམ་ལ་རྟག་ཏུ་མངོན་དགའ་བའོ་༼བསྒྲུབ་པ་པོ་ལ༽། །༼གནས་ནང་ན་བཞུགས་པས་བྱིན་གྱིས་བརློབ་ན་༽ལམ་༼ཅུང་ཟད་བསྟན་ནས་༽གྱི་བཞི་མདོའམ་ཁྱིམ་དག་གམ། །༼དུར་ཁྲོད་༽དཔའ་བོའི་གནས་༼རོ་གནས་པའི་ས་༽ཀྱི་རི་བོར་ནི། །མཁའ་འགྲོ་མ་༼དང་དཔའ་བོ་༽ཡི་༼དམ་བཅས་པ་ལས་མི་འདའ་བས་༽དམ་ཚིག་གནས་༼བྱིན་གྱིས་བརློབ་པས༽། །༼ཡུལ་གཞན་ན་བཞུགས་ཀྱང་༽རིང་པོ་ནས་༼སྐུ་དངོས་སུ་བྱོན་མི་དགོས་༽ཀྱང་གཟིགས་༼བྱིན་གྱིས་བརློབ་སྤྱན་གྱིས་གཟིགས་༽པར་འགྱུར། །༼ཆ་ལུགས་བསྟན་༽ཕྱག་རྒྱ་༼ཕྱག་རྒྱ་དང་གཉིས་ཀར་༽གཅེར་བུར་༼བྱས་ཏེ་༽མཆོད་པ་༼ སུ་ཀས་༽ཡི། །༼ འདུས་གསུམ་༽ལས་ཉིད་ཀྱིས་ནི་ཡོངས་སུ་གྲོལ། །༼ཐ་མལ་པའི་ཕྱག་རྒྱའི་རྒྱུ་ལ་སོགས་པ་སྟགས་པགས་དང་རུས་རྒྱན་གསུང་༽གོས་༼ལས་༽གཞན་༼པ་༽དག་གིས་བཀབ་ནས་ནི། །༼ཐ་མལ་བའི་བདེ་བ་ལ་མ་ཆགས་སེམ༽་འདོད་པ་རྣམས་ཀྱིས་༼ཐ་མལ་པའི་གོས་ལ་སོགས་པའི་༽རེག་མི་བྱ། །དེ་བཞིན་སྐྲ་ནི་གྲོལ་འགྱུར་བ། །ལས་རྣམས་ཐམས་ཅད་༼བསྒྲུབ་པ་པོ་༽བརྩམས་པ་ལ། །རྩ་བའི་༼བསྙེན་པ་ཡི་གེ་བདུན་པ་ལ་སྐྱལ་ཀྱང་༽སྔགས་༼བཟླས་པ་༽དང་དེ་བཞིན་སྡིགས་༼སུཾ་བྷ་ནི་བརྗོད་པས་བསྲུང་ལ༽༼བར་ཆད་སེལ་བ་ལ ༽། །༼ར་བ་དང་དྲ་བ་དང་གུར་དང་བླ་རེ་དང་ས་གཞི་ལ་སོགས་པ་ཡང་བྱ༽ཕྱོགས་བཅིང་བར་ནི་འཇུག་པ་དང་། །༼དེ་ལྟར་བྱ་པས་བསྲུང་བའི་འཁོར་ལོའི་སྟོབས་ཀྱིས་༽ལྷ་དང་ལྷ་མིན་ཚོགས་ཀྱིས་ཀྱང་། །༼ཁ་ཅིག་གིས་མཐོང་ཡང་བར་ཆ་མི་ནུས་༽མ་མཐོང་པར་ནི་མཆོད་༼ གཡེང་བའི་ཉེས་པ་ཞི་བས་་་བསྒྲུབ་༽པར་གྱིས། །༼ཡི་གེ་བདུན་པ་ལ་སྙེན་པ་སོང་བས་མི་སྣང་བའི་དངོས་གྲུབ་བསྒྲུབ་པ་༽སྙིམ་པ་མེ་ཏོག་གིས་བཀང་སྟེ། །མཁའ་ལ་སྤྱོད་པ་གྱེན་དུ་འཐོར༼བས༽། །༼མེ་ཏོག་དམར་པོ་ལ་ཉེ་སྙིང་བཟླས་ཏེ་ཆུ་ལ་གཏོར་བས་ཆུ་དེ་ཡང་ཁྱིལ་ཁྱིལ་ནས་མེ་ཏོག་དང་བཅས་པར་སྙིམ་པར་ཆུ་བཅུས་ལ་མེ་ཏོག་ལ་སོ་མ་བཏབ་པར་ཁྱུར་མིད་བྱས་ན་མི་སྣང་བ་འགྲུབ༽མེ་ཏོག་དག་ནི་ས་གཞི་ལ་༼མར༽། །གལ་ཏེ་༼བཟླས་ཀྱི་བར་དུ་༽ལྟུང་བར་མ་གྱུར་ན། །དེ་ཉིད་དུ་ནི་མི་སྣང་འགྱུར།༼ བར་སོགས་ལས་གྲུབ་པའི་རྟགས་སོ་སོའི་་་ མེ་ཏོག་དེ་འདོད་ན་གཞན་ཡང་འགྲུབ༽ །༼ ངག་དབང་བསྒྲུབ་པ་བསྟན་གཞན་ཡང་༽གནས་ཀྱི་ཁྱད་པར་༼ཡུལ་ཉི་ཤུ་རྩ་བཞི་ལ་སོགས་པ་༽ལ་གནས་ན།༼ལྷན་སྐྱེས་མ་དང་ཞིང་སྐྱེས་མ་ལ་སོགས་པ་ ༽ །མཁའ་ལ་འགྲོ་བར་སྟོང་ཕྲག་ནི། །༼འདོད་ན་ དེ་དག་དང་ལྷན་ཅིག་སྐལ་བ་མཉམ་པར་མྱོང་་་བསོད་༽གནས་ལ་དབང་ནི་བྱེད་པར་འགྱུར། །༼ཡང་༽ངག་གི་དབང་ཕྱུག་༼རྣལ་འབྱོར་མ་༽མ་༼ཞིང་སྐྱེས་༽རྣམས་དང་། །གསུང་གི་དབང་ཕྱུག་༼འགྲུབ་༽འགུགས་པར་འགྱུར།༼ བཟའ་ཕུར་བུ་པ་ཕྱི་རོལ་པའི་སྒྲ་བརྩམས་པ་དེ་ཡང་བྲིས༽ །༼བསྒྲུབ་པ་པོ་དེ་ལྟར་གྱུར་པས་༽ལྷ་དང་ལྷ་མོའི་༼མ་བསླབ་པར་སཾ་ཀྲི་ཏའི་༽གཏམ་༼འདོད་པ་༽ཤེས་ཤིང་། །ས་འོག་ལ་སོགས་གང་ཡོད་༼་པ་ཐམས་ཅད་བྲིས༽དང་། །སྐར་མ་རྒྱུ་བར་༼ ལ་སོགས་པའི་དུས་ཐམས་ཅད་པ་་་་་་་་མདོར་ན་མངོན་པར་འདོད་པ་ཐམས་ཅད་འཐོབ་ཐོས་པས་༽ཤེས་པར་འགྱུར། །༼ཉུང་བ་བསྟན་ཏེ་གནས་༽ཡུལ་༼མི་སྣང་བསྒྲུབ་པ་༽ ཡུལ་དེ་བཞིན་དགོན་པ་དང་། །གྲོང་ཁྱེར་དང་ནི་བཞི་མདོ་དང་། །ཤིང་གཅིག་དང་ནི་དཔའ་བོའི་ཁྱིམ། །རི་རྩེ་དང་ནི་མཚན་༼མ་༡་པ་༽དྲུང་དུ། ༼ སྔོན་དུ་འབྲུ་འབུམ་་་་སོང་བས་དེ་ནས་མི་སྣང་བར་གྱིས་༡་པའི་སྤེལ་ཚིག་དང་བཅས་པས་བཟླས་ན་༽ །རྟག་ཏུ་སྙིང་པོ་༼དང་༽ཉེ་སྙིང་འདོན་༼པར༽། །༼བར་ཅད་བྱ་བའི་བསམ་་པ་དང་ལྡན་པ་རྣམས་ཀྱིས་༽ལྷ་དང་མི་ཡིས་མཐོང་མི་འགྱུར། །དེ་བས་ཡུལ་ཕྱོགས་༼དེ་༽འདི་དག་ཏུ། །༼དེ་སྣང་མི་སྣང་བསྒྲུབ་པ་པོའམ་༽བསྒྲུབ་པ་པོ་ནི་༼སུས་ཀྱང་མི་མཐོང་བར་༽རྟག་ཏུ་གནས། ༼འདི་ཡང་སྔོན་དུ་སྙེན་པ་འབྲུ་འབུམ་༡་དེ་ནས་ཁྲི་ཕྲག་༡་བཟླས་པས༽ །ཤིང་རྩེར་༼ ལྷུང་པའི་ལ་སོགས་་་་མཐོན་པོ་༽༼འདི་ཡན་ཆད་ལྡེབ་གྲངས་༢༣་གི་རྒྱབ་ལོག་ནས་རྟགས་དང་རྟགས་ཅན་ཁ་ཤས་གསལ་ཁ་ཡོང་མེད་པས་ཞིབ་སྡུར་བྱེད་རོགས༽ཁ་དོག་དམར་༼ཨ་ཤོ་ཀའི་སྡོང་པོ་ཆེན་པོ་ཤིང་གི་རྩེ་མོ་ལ་་་ སྔགས་རི་རབ་ལྟ་བུར་བསམ་སྟེ་དེའི་་་གཙོ་མོ་གནོན་པར་བསམ་ཞིང་མེ་ཏོག་ལ་སོགས་པ་ ལ་སྔགས་སྟེ་གཏོར་ན་༽བསམ་ནས། །༼ལོ་ཀ་ལ་ནུས་པ་བསྟན་པའི་ཕྱིར་༽ཡི་གེ་བདུན་གྱི་བདག་ཉིད་ཅན། །༼ཤིང་དང་སྔགས་༽མི་ཕྱེད་པར་འགྱུར་ཕམ་པར་༼ཤིང་ལྷུང་སྟེ་ཆགས་ན་༽ནི། །༼རི་རབ་ཀྱང་ལྷུང་བས་༽ས་འཛིན་རྣམས་ཀྱང་གཞན་དུ་༼མི་ལྷུང་བ་༽མིན།༼མི་མོས་པ་བཟློག་ལ་གསང་སྔགས་ཐེག་པ་ཆེན་པོ་ལ་འཇུག༽ ༼ འདི་ཡང་སྔོན་དུ་སྙེན་པ་འབྲུ་འབུམ་གཅིག་ལ་སོགས་པ་སོང་བས་བྱ་ ཡི་གེ་བདུན་པའི་ཙཀྲ་བྲིས་ཏེ་བཏགས་ལ༽ །༼རྨི་ལམ་རྟག་པ་༽བདག་གི་ལུས་ལ་རྣམ་དགོད་དེ། །ས་ལ་ཀུ་ཤའི་སྟན་དུ་༼བདུད་རྩི་ལྔ་གཏོར་ཏེ་གདན་དུ་གཏིང་ལ་༽ཉལ། །༼ངག་ཏུ་ཡང་༽ཡི་གེ་བདུན་གྱི་བདག་ཉིད་གནས། །༼འདིས་མཚོན་པ་ཙམ་སྟེ་སྟོང་ལ་སོགས་པ་བཟླས་པ་ཡོད་༽བརྒྱ་རྩ་བརྒྱད་ནི་ཉིད་དུ་༼ཡིད་ལ་གཏོད་པ་རྨིས་ལ་༽བཟླས། །རྨི་ལམ་དུ་ནི་༼དགེ་མི་དགེ་༽བྱ་བ་ཀུན། །ཡིད་ལ་འདོད་པ་སྟོན་པར་འགྱུར། །༼དེ་ཉིད་བསྟན་པ་༽དུས་མིན་འཆི་དང་༼རྫས་དང་༽བཅོམ་དང་༼འོན་པ་དང་ལོང་ང་ལ་སོགས་ཀྱིས་༽ཉམས། །བྱ་བ་ཀུན་ཏུ་༼སྒྱུར་བསམ་པའི་ལས་༽གང་གྱུར་བ་༼པ་དང་༽། །༼ཉེས་པ་ཅི་བྱུང་ཡང་བསལ་ཐབས་༽རྣམ་པ་སྣ་ཚོགས་གཞན་དང་གཞན། །༼ངན་ན་བཟློག་ནུས་པ་༽ཐམས་ཅད་རྨི་ལམ་དག་ཏུ་སྟོན། །༼པྲ་སེ་ན་བསྒྲུབ་པ་བསྟན་༽དེ་བཞིན་སྔགས་བཟླས་༼འདི་ཡང་སྔོན་དུ་སྙེན་པ་འབྲུ་འབུམ་གཅིག་སོང་བས་དེ་ནས་ཡང་ཁྲི་ཕྲག་གཅིག་བཟླས་པས་པྲ་དབབ་པར་བྱས་པ་༽རལ་གྲི་ཆུ་༼ཕུ་ཆུ་མི་ཁྱིས་མ་འབགས་པ་ལ་རྩ་བམ་ལ་བལྟ༽ ། ༼དང་པོ་བགེགས་ལ་སོགས་པ་སྦྱངས་དེ་ཡང་བཀྲག་དང་ལྡན་པར་སྦྱངས་དེ་ནས་ཡི་གེ་བདུན་པ་བཟླས་ཤིང་བདུད་རྩི་ལྔས་ཐིག་ལེ་བདུན་བྱ། དེ་ནས་ཁྱེའུ་གཞོན་ནུ་མ་དང་གཞོན་ནུ་མས་ཁྲུས་བྱས་ལ་བཀུག་ལ་དེའི་ཡིས་ཀྱང་ཡི་གེ་༧་པ་བཟླས་བུས་ ལྟར་གཞུགས་པ་འདི་ཐམས་ཅད་ལ་འདྲའོ༽ །མཐེ་བོང་མར་མེ་མེ་ལོང་དང་༼གཉིས་ལ་ཡང་བགེགས་སྦྱང་ལ་སོགས་པ་བྱས་ལ་ བལྡབ་བསྲེའོ༽། །སྔགས་བཟླས་ཉིད་རྟག་༼ཏུ་གནས་པའི་༽རྣལ་འབྱོར་པ་༼ལ༽། །པྲ་སེ་ན་༼དེའི་ནང་དུ་འཇའ་ཚོན་ལྟ་བུའི་ལུས་མཐོང་༽ན་ནི་༼རྟེན་འབྲེལ་གྱིས་མཐུས་སུ་མཐོང་བའི་་་་་་་་༽འབེབ་པར་འགྱུར། ༼རལ་གྲིའི་གཞུང་ནས་མར་་་་་་་རིཏྲིའི་་་་ཐིག་ལེ་བདུན་བྱ། དེ་ལ་ཡི་གེ་བདུན་པོ་བཀོད་ལ་སྔགས་བཟླས་ལ་ལྟར་བཅུག་ན་མཐོང་གསུང་། ཡང་ན་ཆུ་གཙང་མ་འམ་མཐེ་བོང་ངམ་མར་མེ་འམ་མེ་ལོང་ནང་་་་་རུང་་་་སྦྱངས་སྟེ་བལྟས་ན་མཐོང་གསུང་༽ །༼ལྷར་༽བསྒོམས་དང་ལེན་བདུན་༼ཡི་གེ་བདུན་པ་༽བཟླས་བཀོད་པས་༼ཙཀྲ་བྲིས་སྟེ་བཅིངས༽། །དགེ་༼དངོས་སུ་མཐོང་༽དང་མི་དགེ་སྟོན་པར་འགྱུར་༼ནད་ཞི་བར་བྱ་བ་བསྟན༽། །དེ་ནས་དཔའ་བོ་ཡི་གེ་བདུན། །༼བསྒྲུབ་པ་པོ་ནད་བསོ་བ་ལག་པ་གཡོན་པ་ལ་ཡི་གེ་བདུན་པའི་ཙཀྲ་བྲིའོ༽སྔགས་དགོད་པ་ཡི་དབྱེ་བ་ཉིད། །༼ལག་མཐིལ་དུ་༽ཉི་མའི་དབུས་སུ་༼འཁོར་ལོ་དེ་༽བསམ་ནས་ནི། །༼ཡི་གེ་བདུན་པ་སྔགས་སྤེལ་ཚིག་དང་བཅས་པ་༽སྟོང་གི་བར་དུ་༼བཟླས་ན་ལས་སྦྱོར་དུས་སུ་༽བཟླས་ནས་སུ།༼དེ་ནས་ཙཀྲ་ལས་འོད་ཟེར་དཀར་པོ་བྱུང་སྟེ་ནད་པའི་ལུས་ལ་ཕོག་པས་ནད་བསལ་བསམས་ལ་ལག་པས་བྱོབ༽ །༼ནད་པ་དེ་ནད་དང་བྲལ་ཏེ་༽ཤེལ་གྱི་རྣམ་པ་ལྟ་བུ་ནི། །ནད་ཀྱིས་གདུངས་པ་༼དེ་ལ་སེམས་དང་་་་ ལག་པས་༽བལྟ་བར་བྱ། །མཐེ་བོང་༼སེ་གོལ་གཏོགས་པ་༽ཙམ་གྱིས་༼སྔགས་ཀྱི་ཆེ་བ་༽སྐད་ཅིག་གིས། །ནད་རྣམས་སེལ་བར་ཐེ་ཚོམ་མེད། །ནད་ལས་རྣམ་པར་གྲོལ་གྱུར་ན། །སྟོན་ཀ་ཡི་ནི་ཟླ་འདྲ་བ༼ར་འགྱུར་རོ༽། །༼ལག་པ་ལ་༽ཟླ་བའི་དབུས་སུ་རྣམ་དགོད་ཅིང་། ༼ དུག་ལ་སོགས་པ་ཞི་བར་བྱ་བ་བསྟན་༽ ༼ལག་པར་ཙཀྲ་བྲི་བའམ་བསམས་ཏེ༽ །ལག་པ་གཡོན་པར་འཁོར་ལོ་བྱེད༼འཁོར་ལོ་འདི་གོང་མ་ཀུན་ལ་འདྲེ༽། །༼ཙཀྲ་ལ་༽ཡི་གེ་ཤེལ་གྱི་མདོག་ལྟར་སྣང་༼བ་དེ་ལ༽། །༼འོད་ཟེར་ཁ་དོག་༽གཟུགས་ལྔ་རུ་ནི་བལྟ་བར་བྱ་༼དགོད་ཟེར༽། །༼གཟུགས་ལྔ་རུ་ནི་ཟེར་༽ནད་རྣམས་ཀུན་ལ་དགོད་པར་བྱ། ༼ དེའི་འོད་ཀྱིས་དུག་ལ་སོགས་པ་ཞི་བར་བསམ༽ །རིམས་དང་གདོན་དང་བརྗེ་བྱེད་དང་། །གཟེར་སོགས་ཀུན་དང་མཛེ་ཅན་དང་། །དུག་གིས་ཟིན་པའི་ནད་རྣམས་དང་། །གང་གི་ནད་ཀྱི་སྡུག་བསྔལ་བ། །ཟླ་གཟུགས་ཡེ་གེ་༼ཐིག་ལེ་བསམས་ནས་ནི་དེའི་འོད་ཀྱིས་ཕོག་སྟེ་བསལ་བར་བསམ་ལ་༽བསམས་ནས་ནི། །ཕྱོགས་བཅུར་རྣམ་པར་༼ནད་པ་ལ་ནད་གུད་དུ་༽འབྱེར་བར་འགྱུར། །༼དུས་༽མཚན་མོ་༼འཁོར་ལོ་དང་ལྡན་པས་བྱས་ན་མྱུར་དུ་འགྲུབ།  ཧོ་མས་ནོར་བསྒྲུབ་པ་དང་༽གསང་བ་ལ་གནས་ཏེ། །༼བ་ལང་ཤ་༽གོ་མཾ་ས་ནི་མངར་གསུམ་༼ཀ་ར་བུ་རཾ་སྦྲང་༽བརྟག ༼ སྔོན་དུ་སྙེན་པ་འབྲུ་འབུམ་༡་བྱས་པས་སྦྱིན་བྱ་པས་རྒྱས་པ་ལ་སོགས་པའི་ལས་བསྒྲུབ་པ་བསྟན་ཏོ༽ །ཡིག་བདུན་གསང་སྔགས་ཤེས་པ་དང་། །༼སྐལ་བ་རབ་ཀྱི་བསྲེག་ལུགས་༽སྟོང་རྩ་བརྒྱད་དུ་སྦྱིན་བསྲེག་བྱས། །༼མཚན་གཅིག་གིས་༽སྔགས་པས་ནང་བར་དུས་སུ་ནི། །༼སྔགས་སྤེལ་ཚིག་དང་བཅས་པའི་སྦྱིན་སྲེག་༽གསེར་སྲང་སྟོང་ནི་རྙེད་པར་འགྱུར། །༼གཞན་ཡང་རྫས་སྔགས་སྔ་མ་༽སྦྱིན་བསྲེག་སྟོང་ཕྲག་བཅུ་ཡིས་ནི། །༼རྒྱལ་ཕྲན་༽ཡུལ་འཁོར་དམ་པ་རྙེད་པར་འགྱུར། །ཡང་ན་གསང་སྔགས་རྒྱལ་པོ་༼ཡི་གེ་བདུན་༽ནི། །གནས་ནི་གང་དུ་བསམས་པ་དག །དེ་དང་དེར་ནི་དེ་ཡི་ཚེ། །༼འཆི་བའི་དུས་ན་༽སྐྱེ་བར་འགྱུར་བར་ཐེ་ཚོམ་མེད། །༼སྤྱིར་བསྟན་ས་གཞི་༽དཀར་པོ་ཡིས་ནི་ཞི་བར་འགྱུར། །༼དུར་ཁྲོད་སོལ་བས་བྱུགས་ལ་༽ནག་པོས་སྐད་ཅིག་དག་གིས་༼ རྡ་དུ་ར་བསྲེག་༽གསོད། །༼དུར་ཁྲོད་ཀྱི་སོ་ཕག་གིས་༽དམར་པོས་དབང་དུ་འགྱུར་བ་སྟེ།༼མངར་༣་བསྲེག༽ །འཕྲལ་དུ་ངེས་པར་འགུགས་པར་འགྱུར། །༼ལྡོང་རོས་སམ་བ་བླས་༽སེར་པོ་ཐམས་ཅད་༼དཔུང་པ་ལ་སོགས་པ་རེངས་པ་༽གནོན་པ་སྟེ༼གཟུགས་བསྙན་བསྲེག༽། །༼རྒྱུད་འདིར་ངེས་པ་༽འདི་ནི་བསྟན་བཅོས་༼སུ་༽ངེས་པ་ཡིན། །༼ས་གཉིས་༽སེར་པོས་དཔུང་ནི་གནོན་པ་དང་། །གྲུ་དང་འཁྲུལ་འཁོར་༼ཐམས་ཅད་མི་འགུལ་༽གླང་པོ་གནོན། །དཀར་པོ་བསམས་པ་ཙམ་གྱིས་ནི། ༼དེར་མ་ཟད་གྲུ་བ་ལ་སོགས་པ་ཡང་འགྲོ་༽ །འཆི་བ་ངེས་པར་སློང་པར་འགྱུར། སྦྲུལ་ཆེན་བརྒྱ་ཡིས་ཟིན་ནས་ནི། །འཆི་བ་༼རང་འགྱུར་བ་དེ་ཡང་༽མྱུར་དུ་སློང་བར་འགྱུར་༼ལག་པས་རེག་པ་དང་འཁོར་ལོ་བཀྲུས་པའི་ཆུ་འཐུང་ན༽། །དུག་གིས་བརྒྱལ་བར་གྱུར་བ་དག །གསལ་བར་བྱས་ན་ཟད་པར་འགྱུར། །རིམས་༼རིམས་ཞི་བར་བྱ་བ་༽དང་གདོན་༼ལ་སོགས་པ་ཞི་བར་བྱ་བ་༽དང་བརྗེ་བྱེད་ནི། །༼འཁོར་ལོ་དང་ལྡན་པའི་༽ལག་པ་མཐོང་བ༼འམ་རེག་པ༽ས་འཇིགས་༼བདུད་དུ་འགྲོ་༽པར་འགྱུར། །༼རྒྱན་རྒྱལ་བར་བྱ་བ་༽རྒྱན་པོར་༼ནོར་ལ་རྒྱལ་པོ་དགེ་བ་༽ཁུ་ཚུར་བཅིངས་ནས་ནི། །༼ཡི་གེ་བདུན་༽ཡིད་ལ་རྟག་ཏུ་ཟློས་བྱེད་ན། །ཇི་སྲིད་ཁུ་ཚུར་མ་བཀྲོལ་བར། །༼བྱ་བ་ཟེར་ རྫས་༽རེངས་པ་ཐམས་ཅད་༼རྒྱན་རྒྱལ་བར་འགྱུར་༽འགྲུབ་པར་འགྱུར་༼བདག་དགྲ་ལས་རྒྱལ་བར་བྱ་ སྔགས་ཀྱི་བཟླས་པ་༢་ཀྱིས་༽། །༼རྒྱན་དང་དོ་བྲལ་ཐོབ་ ཡང་༽དགྲ་བོ་༼ལས་རྒྱལ་བར་བྱ་༽གལ་ཏེ་ལག་ན་ནི། །མཚོན་ཆ་སྣ་ཚོགས་འཕྱར་བ་ཡང་། །ཇི་སྲིད་༼ལག་པ་གཡོན་པ་ཙཀྲ་དང་ལྡན་པའི་ལག་པ་དེ་༽ཁུ་ཚུར་མ་བཀྲོལ་བར། །༼ཕ་རོལ་པོས་༽མཚོན་ཆ་གཏོང་བར་མི་ནུས་སོ། །༼མང་པོ་བརྗོད་མི་དགོས་ཏེ་མདོར་ན་༽ཡང་ན་༼ཅི་འདོད་པའི་༽བྱ་བ་ཐམས་ཅད་ནི། །༼ཡི་གེ་བདུན་པ་དང་དེའི་འཁོར་ལོས་༽ཇི་བཞིན་ཉིད་དུ་སྒྲུབ་པར་བྱེད། །༼ཤིང་གི་ཟས་སོགས་ཅི་བདེར་བསྒྲུབ་པ་༽འབྲས་བུ་༼དང་༽མེ་ག་༼དང་༽འདབ་མ་དང་། །སོ་རྩི་༼དང་༽དེ་བཞིན་ཟས་རྣམས་ལ། །༼འདོད་ན་ཐོད་པའི་སྣོད་དུ་དྷ་ཟས་གང་འདོད་པའི་བག་ཙམ་བཞག་སྟེ་དེ་ནས་ལྷའི་རྣལ་འབྱོར་དང་ལྡན་པས་དེ་དག་འོངས་པར་བསྒྲུབས་ན་འགྲུབ་༽ལུས་ཀྱི་སྦྱོར་བ་༼རབ་༽དང་པོ་སྟེ། །དེ་བཞིན་གཉིས་པ་༼འབྲིང་༽ནུས་པ་ཡིན། །གསུམ་པ་༼ཐ་མ་༽དག་ནི་ཕྱི་ཡི་ཉིད། །བཞི་བ་༼རབ་འབྲིང་ཐ་མ་༣་ ཐ་མ་འཁྲུལ་འཁོར་དང་༣་བཅས་སྟེ་སྤེལ་ཚིག་དང་བཅས་པ་བཀོད་པས་ ན་གཾ་༢་སམ་༣་གྱིས་ངེས་པ་མེད་པར་འགྲུབ་པ་༽ཡི་ནི་དམིགས་པ་མེད། །༼བདུན་པ་༽སྔགས་ཀྱི་རྒྱལ་པོ་འགྲུབ་པར་འགྱུར། །ས་གཞི་ཤིང་དང་བཅས་པ་དང་། །༼ཡང་སྔགས་བཟླས་ཤིང་སྔགས་ཀྱི་རྡུལ་ཕྲ་རབ་ཀྱིས་རྒྱ་མཚོ་ཁྱབ་པར་བསམས་ན་༽རྒྱ་མཚོ་༼ཅེས་ནི་རྒྱ་མཚོའི་སྟེང་་་་་་་་་་བར་མི་འབྱིང་བར་འགྲོ་བའོ་༽སྐྱེ་རགས་བཏགས་པ་ཡང་༼མི་འཕྱོང་པར་ལམ་་་་བྲོང་གིས་འོང༽། །དེ་ལ་ངེས་པར་༼ཇི་ལྟར་འདོད་པ་ལྟར་༽འགྲུབ་པ་ནི། །འགྱུར་བར་འདི་ནི་ཐེ་ཚོམ་མེད། །ཁམས་གསུམ་༼སེམས་ཅན་༽རྒྱུ་དང་༼ཤིང་ལ་སོགས་པ་༽མི་རྒྱུ་བ། །སྨོད་འདེབས་༼འཆི་བའམ་འཆག་པ་ལ་སོགས་པར་སླར་འཚོ་བ་དང་འབྲས་བུ་དང་ལྡན་པ་ལ་སོགས་པར་༽ཕན་འདོགས་ནུས་པ་ཡིན། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་ཉེ་བའི་སྙིང་པོའི་༼རྩ་སྔགས་དང་སུཾ་བྷ་ནིའི་སྔགས་ཀྱིས་བསྲུང་བ་སྔོན་དུ་སོང་བས་༽ལས་བསྒྲུབ་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་གསུམ་པའོ། །༼བསྲུང་བའི་བུའི་གསང་བ་དངོས་གོ་ཆ་དང་ཡི་གེ་བདུན་པ་གཉིས་ཀྱི་ལས་བསྒྲུབ་པ་བསྟན་༽དེ་ནས་ཕོ་ཉ་རྙེད་ན་ནི། །ཡི་གེ་༼གོང་དུ་བསྟན་པ་ལྟ་བུའི་རྐྱང་མ་སྙེན་པ་ཡི་གེ་བདུན་པ་་་་་་་་་་བྱས་པ་ སླར་བསོ་བ་རྗེས་སུ་བཟུང་བ་སྟེ་ལག་པ་ལ་ཙན་དན་དཀར་པོ་དང་གུར་གུཾ་དང་གི་ཝཾ་ལ་སོགས་པ་ལ་ཙཀྲ་བྲིས་སྟེ་སྔགས་བཟློས་ཤིང་དེའི་ལུས་ལ་རེག་ན་ སྔོན་དུ་སྙེན་པ་སོང་བས་ལག་པ་གཡོན་པར་ཙན་དན་ལ་སོགས་པས་ཙཀྲ་བྲིས་ཏེ་སྔགས་སྤེལ་ཚིག་དང་བཅས་པ་བྲིས་བཀོད་ནས་ཕར་བ་མ་ཕྱེ་བར་བྱ་༽བདུན་པར་ལྡན་༼དོན་དྲུག་ལས་དང་པོ་ཙཀྲ་༽བསྒྲུབ་པ། །གང་དུ་ལས་ནི་ཡང་དག་རྩོམ། །དེ་ཡི་ལས་ནི་༼རྟེན་འབྲེལ་གྱི་མཐུས་༽མྱུར་འགྲུབ་༼གཡོན་པ་༽བཤད། །༼འཁོར་ལོའི་ཕྱིའི་རྩིས་་་་་ལ་༽དེ་བཞིན་དུ་ནི་ཡི་གེ་བདུན། །༼བྲི་བའི་གཞི་ དགུ་རྩེགས་ཀྱི་དབུས་སུ་རྒྱ་སྐེག་ལ་སོགས་ཀྱིས་༽ལག་པའི་དབུས་སུ་༼སྣ་ཚོགས་་་་་་་་སོན་རྩི་༽རྣམ་པར་དགོད། །རྣལ་འབྱོར་མ་༼སྙེན་པ་ཡི་གེ་བདུན་པ་་་་་སོང་ནས་༽ནི་དྲུག་༼ནང་གི་འདབ་མ་ལྔ་ལྟེ་བ་དང་དྲུག་ལ་༽ཡང་དག་༼གི་སྔགས་༽ །༼ཕྱི་རོལ་དུ་༽རྩིབས་དྲུག་འཁོར་ལོར་ཡང་དག་གནས༼ཨོཾ་བཾ་ལ་བསྐོར་་་ཉེ་སྙིང༽། །གཡོན་པའི་འཁོར་ལོ་༼དབུས་སུ་བསྒྲུབ་བྱའི་མིང་བསྐུལ་ཚིག་དང་བཅས་པ་༽བསྐུལ་༼ཨོཾ་བཾ་གི་མཐའ་མ་ནས་ཆེ་གེ་མོ་ཨ་ཀར་ཥ་ཡ་ཛ་ཅེས་པ་བྲི་༽དང་གནས། །༼གཉིས་པ་ཙཀྲ་དགུག་པ་༽གང་གི་༼དགུག་རྒྱུ་༽གཟུགས་འཛིན་བསམ་ནས་ནི༼རྐང་རྗེས་ཀྱི་རྡུལ་ལ་སོགས་པ་ལས་ལང་ཀ་བྱས་ལ༽། །ཁ་ནས་༼ཡི་གེ་༧་ལ་སྙེན་པ་སོང་ནས་༽གསང་སྔགས་རྒྱལ་བོ་༼དཔའ་བོ་གོ་ཆའི་སྔགས་༽ཟློས། །འགུག་རྒྱུ་གང་ལ་ལག་པ་དེ་བསྟན་ན།༼ འཁོར་ལོའི་ཕྱིར་འདབ་མ་དྲུག་ལ་་་་་་་་གསུམ་ཕྲུགས་སུ་སྦྱར་བ་འགུགས་པ་འཁོར་ལོ་དང་ལྡན་པའི༽ །དེས་ནི་༼ཐེ་ཚོམ་མེད་པར་༽ངེས་པར་༼ལྷའི་བུ་མོ་ལ་སོགས་པ་༽འགུགས་པར་འགྱུར། །༼གཞན་ཡང་༣་པ་སྦྱིན་སྲེག་གིས་ས་བདག་ནོར་བཅས་འགུག་པ་༽ཙན་དན་དམར་པོའི་རྡུལ་དང་༼ཙཀྲ་དང་ལྡན་པའི་ལག་པས་༽ནི་༼བསྲེག་རྫས༽། །སྐྱེ་ཚེ་དེ་བཞིན་ལན་ཚྭ་དང་། །བསྒྲུབ་པར་བྱ་བའི་རྐང་རྗེས་ས། །༼རྫས་༤་བོ་༽གཅིག་ཏུ་བསྡུས་ནས་༼བསྲེག་རྫས་སུ་༽བཏག་པར་༼རྫས་ཚང་བར་་་པ་༽བྱ། །ལག་པ་གཉིས་ཀྱིས་༼ལག་པ་གཉིས་ལ་ཙཀྲ་གོང་མ་བཀོད་༽མཉེས་ནས་ནི། ༼དྲུག་གི་སྔགས་ཀྱིས་སྤེལ་ཚིག་དང་བཅས་པ་༽ །རྣལ་འབྱོར་མ་ཡི་སྦྱིན་བསྲེག་བྱ། །༼དུས་༽མཚན་མོ་༼ཐབ་ཟླ་གམ་མམ་ལྕགས་སྐྱུ་ལྟ་བུ་བྲིས་ལ་བསྲེགས་པའི་ཆོག་གསུང་༽སྨེ་ཤ་ཅན་༼ཤན་པའི་༽མེའམ། །དུར་ཁྲོད་༼སྔར་གྱི་༽མེ་ལ་ཕྱེ་མ་༼བསྲེག་རྫས་༽བསྲེག །༼དབང་དུ་བྱ་རྒྱུ་ཆོ་གའི་ཁྱད་པར་༽བསྒྲུབ་པར་བྱ་ལ་མངོན་བསྲེས་ཏེ། །༼ནང་ན་གནས་པའི་ཕྱོགས་སུ་ཁ་བལྟས་ཏེ་དགུག་པའི་ལས་༽སྦྱོར་བ་༼དབང་པོ་ཐ་ཤལ་གྱིས་བསམ་གཏན་ལ་སོགས་པ་བཞིའི་་ས་འགྲུབ་པའོ༽འདི་ནི་བརྩམ་པར་བྱ། །༼བསྲེག་ལུགས་ཀྱི་གྲངས་གོ་ཆའི་སྔགས་སྔོན་དུ་སྙེན་པ་སོང་བའི་དབང་དུ་བྱས་པ་༽ཇི་སྲིད་བརྒྱ་ཡི་བར་དུ་བཟླས་༼ཏེ་སྦྱིན་སྲེག་བྱས་ན༽། །དེ་ནི་ངེས་པར་འགུགས་པར་འགྱུར་༼ཏེ༽། །༼ར་ཛའི་༽ས་ཡི་བདག་པོ་བདག་ཉིད་དང་། །༼དེའི་༽ནོར་ཡང་དབང་དུ་འགྱུར་བ་ཡིན། །སྦྱོར་བ་འདི་ནི་འགྲུབ་པར་༼འགྱུར་ཏེ་ཟེར་༽བསྐྱེད། །གཞན་དག་ཏུ་༼མི་འགྲུབ་པར་༽ནི་ང་མི་སྨྲ། ༼བཞི་བ་མནན་པའི་ལས་ཀྱི་གསང་བའི་ལས་ཙན་དན་དམར་པོ་རྡུལ་ལ་སོགས་པ་བཞི་༽ །རྡུལ་༼ལས་གཞན་སྡ་པའི་ལས་བསྟན་༽དེ་ཉིད་ནི་བླང་ནས་སུ། །ལྕགས་ཕྱེ་དང་ནི་རྣམ་པར་བསྲེ་༼དེ༽། །༼བསྒྲུབ་པ་པོས་དབུགས་ཕྱིར་མ་ཤོར་བར་༽དུར་ཁྲོད་རས་ལ་༼འཁོར་དང་ལྡན་པས་༽བཏུམས་ནས་ནི། །༼གོ་ཆའི་སྔགས་མ་ར་ཡ་དང་བཅས་པ་༽ལན་བདུན་བཟླས་ནས་༼ལམ་གྱི་༽བཞི་མདོ་རུ། །སོར་བརྒྱད་ཙམ་དུ་བརྐོས་ནས་ནི། །༼ལིང་ཀ་བྲིས་པ་དེ་ཡང་འདིར་བཅུག་ལ་༽དགྲ་ཡི་མིང་དང་བཅས་པ་ནི༼སྟཾ་པ་ཡ༽། །གང་གི་མིང་སྨོས་༼གཞན་པའི་ལས་༽སྦས་འགྱུར་བ། །༼དངོས་ལུས་རེངས་བུས་ ༽དེ་ནི་མྱུར་དུ་༼འདི་འཆི་བར་འགྱུར་གསུང་༽གནོན་པར་འགྱུར་༼རྗེས་བཟུང་གི་ལས་ལྔ་བའམ༽། །ཕྱེ་མ་ཉིད་ནི་བདས་ནས་ནི། །༼དག་པའམ་གཙང་བ་བྱ་བའམ་མི་གཙང་བ་མི་ཟ་བ་༽འབད་དེ་བ་ཡི་འོ་མ་༼གཙང་ཟེར༽་དང་། ༼ཙན་དན་དམར་པོ་ལ་སོགས་པ་སྔར་གྱི་བཞི་བོ་ལྤགས་ཕྱེ་དང་བཅས་བཏུམས་པའི་ས་གཏོར་ཞིང་སྔགས་བཟླས་པས༽ །དེར་ནི་སླར་ཡང་༼མནན་པ་དེ་སྟོན་ཏེ་༽གསོས་གྱུར་ན་༼པའི་བསམ་པས༽། །འགྲུབ་པ་ཉིད་དུ་ཐེ་ཚོམ་མེད། ༼དྲུག་པ་སྨྱོ་བ་རྗེས་བཟུང་དང་བཅས་པ་༽ །༼རྫས་བཞི་པོ་༽ཕྱེ་མ་དེ་ནི་བླངས་ནས་ནི༼གཞན་སྨྱོ་བའི་ལས་༽། །མྱོས་བྱེད་ལྔ་དང་༼དབྱུག་ ་་ཡང་ན་་་་་རྩ་བ་་འདབ་མ་ཤུན་པ་མེ་ཏོག་འབྲས་བུ་ལྔ་༽ལྡན་པས་སུ༼བསྲེས་སྟེ༽ ། ༼དབུགས་ཕྱིར་མ་ཤོར་བར་༽ །དེ་ནི་དུར་ཁྲོད་རས་ཀྱིས་བཅིངས། ༼ བྱང་ད་ལིང་ཀ་ཡང་བྱས་ལ་གསུང༽ །༼ཙཀྲ་དང་ལྡན་པའི་དགྲ་ལག་པས་༽དགྲ་ཡི་མིང་ཡང་༼ཆེ་གེ་མོ་སྨྱོ་བར་གྱུར་ཅིག༽་བཅིང་བར་བྱ། །༼སྙེན་པ་སོང་བས་གོ་ཆའི་སྔགས་སྤེལ་ཚིག་དང་བཅས་པས་༽བཟླས་བརྗོད་ལན་བརྒྱ་བྱས་ནས་ནི། །དུར་ཁྲོད་དུ་ནི་མྱུར་སྦས་ན། །འཕྲལ་དུ་སྨྱོ་བ་ཉིད་དུ་འགྱུར། །༼རྗེས་བཟུང་༽བཏོན་པ་ཉིད་ཀྱིས་༼མནན་པ་ལས་༽ཐར་བར་འགྱུར་༼ཏེ༽། །༼དུར་ཁྲོ་རས་ལ་བཏུམས་པ་དེ་གཏོར་ན་༽བཏོན་ནས་གོས་དང་ཕྲལ་ནས་ནི། །འབད་དེ་བ་ཡི་འོ་མ་དང་། ༼ ས་གཏོར་ཞིང་སྔགས་བཟླས་ན༽ །སླར་ཡང་གསོ་བར་བྱེད་པ་དང་། །འགྲུབ་པར་འདི་ལ་ཐེ་ཚོམ་མེད། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼ལས་སྦྱོར་གྱི་དུས་སུ་མེ་ཏོག་མང་བ་ཡོད་ཀྱང་༽རྣལ་འབྱོར་མ་དྲུག་དང་ཡིག་བདུན་གྱི་ལས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་བཞི་པའོ། །༼འདི་ཡང་གོ་ཆ་མའི་རྣལ་འབྱོར་མའི་ལས་དང་པོ་བསྒྲུབ་པའོ༽་དེ་ནས་ལས་ཀྱི་རབ་མཆོག་ནི། །༼ཚིག་བཅད་རྩོམ་པའི་༽ངག་གི་དངོས་གྲུབ་༼ སྤྱིར་ངག་གི་དབང་ཕྱུག་ཆེ་འབྲིང་གསུམ་ལས་ཆེན་པོ་ནི་ལོ་ཀ་འདི་ སྟོང་ཤིག་བྱས་ན་སྟོངས། ཆགས་ཤིག་བྱས་ན་ཆགས་པའོ། འབྲིང་པོ་ནི་བདག་ཉིད་ཀྱི་འདོད་པའི་དོན་གང་ཡིན་པ་ངག་ཏུ་བརྗོད་པ་ཙམ་གྱིས་འགྲུབ་པའོ། ཆུང་ངུ་ནི་ཤེས་རབ་ཆེན་པོར་འགྱུར་བའོ་གསུང་༽སྒྲུབ་བྱེད་པའོ། །ཀ་ར་བི་རའི་མེ་ཏོག་དམར་༼དམར་པོའོ༽། །བརྒྱ་རྩ་བརྒྱད་༼ལ་སོགས་པ་༽ནི་བླངས་ནས་སུ། །༼བརྒྱ་རྩ་བརྒྱད་བཟླས་ཏེ་༽འབད་དེ་༼དེ་ནས་་་་་་དེ་༽བ་ཡི་འོ་མས་བཀྲུ༼་ཞིང་བའི་འོ་མའི་ནང་ནས་གདོན༽། །༼གོ་ཆའི་སྔགས་བཟླས་ཟིན་པའི་གཏིང་ལ་ཡང་༽བཟླས་བརྗོད་༼འོ་མས་ཁྲུད་པའི་བར་ལ་སྔགས་བརྒྱ་རྩ་བརྒྱད་བཟློས་པར་སེམ་༽བརྒྱ་དང་བྱ་བ་ཡིན། །༼དེ་ནས་ཞག་བདུན་ཐུན་དུ་གཅོད་བཟླས་པ་ཡང་ན་ཞག་གཅིག་༽ལན་བདུན་༼ཞག་བདུན་དུ་༽བཟླས་པའི་མེ་ཏོག་གིས། །ལིང་ཀའི་སྤྱི་བོར་༼དབང་ཕྱུག་ཆེན་པོའི་ལྷ་བརྟེན་དབང་ཕྱུག་ཆེན་པོའི་ཕོ་མཚན་གྱིས་༽བསྣུན་པར་༼རྟེན་འབྲེལ་གྱི་སྨན་མར་གཏོང་པ་༽བྱ། །དེ་ལྟར་ཤིན་ཏུ་༼ལྷའི་རྣལ་འབྱོར་ལ་༽མཉམ་བཞག་པས། །ཉི་མ་བདུན་དུ་བྱ་བ་ཡིན་༼དེ་ནས་མེ་ཏོག་དེ་དག་བ་གཙང་མའི་འོ་མས་བཀྲུས་ཏེ་ཞག་གསུམ་དུ་ཚོགས་ཀྱི་འཁོར་ལོ་བྱ་དེ་ལྟར་ཞག་བཅུ༽། །དེ་ལྟར་ཉིན་ཞག་བཅུ་གཅིག་༼གི་ཚེ་ལས་སྦྱོར་བ་བྱ་སྟེ་༽ལ། །མེ་ཏོག་དག་ནི་བླངས་ནས་སུ། །༼དལ་བར་འབབ་པ་ན་༽ཆུ་བོ་ཆེན་པོར་སོང་ནས་ནི། །༼མེ་ཏོག་༽རེ་རེ་ནས་༼ཨོཾ་བཾ་སོགས་བཟླས་ཀྱིན་༽ནི་ཆུ་ལ་དོར། །དེ་ནས་ཐམས་ཅད་རིམ་བཞིན་དུ། །༼དེའི་དུས་སུ་བསྒྲུབ་གཡོག་གིས་རལ་གྲི་ཐོགས་སུཾ་བྷ་ནི་བཟློས་ཤིང་བར་ཆད་བསྲུང་ངོ་༽ལན་རེ་༼ཨོཾ་བཾ་ལ་སོགས་པ་༽བཟླས་ནས་༼དོར་༽རབ་ཏུ་སྦྱར། །ཆུ་བོར་མེ་ཏོག་༼དོར་བ་དང་༽མཐའ་མར་༼འདི་དུས་སུ་ནི་༽ནི། །རྒྱུན་ལས་༼ཡར་གྱེན་ལ་༽བཟློག་ཏེ་རབ་འབབ་ན། །ཆུ་དང་བཅས་པར་༼ལན་༣་པ་གཉིས་ལོ་ཀ་ན་སྔོན་མ་ལ་ངག་གི་སི་ཏི་ཆེན་པོ་བར་མ་ལ་འབྲིང་ཐ་མ་ལ་ཆུང་ངུའོ་གསུང་གྱེན་ལ་ལག་པའི་རྩེ་སྙིམ་པས་མེ་ཏོག་༽བླངས་ནས་ནི། །སོས་༼མེ་ཏོག་ལ་༽མ་རེག་པར་༼ཆུ་ཉིན་མཚན་གཉིས་ཀ་ལ་༽དེ་འཐུངས་ན། །༼ནམ་མཁའ་དང་མཉམ་པའི་༽གསང་བའི་རྒྱུད་ལས་འབྱུང་བ་ཡི༼་དེ་དག་གིས་ཀྱང་༽། །བསྒྲུབ་པོའི་ཚིག་༼ངག་གི་སི་ཏི་༽ནི་འགྲུབ་པར་འགྱུར། །དེ་ནས་༼གཞན་གཉིས་པ་ཡང་འགུགས་པ་འདིར་ཡང་སྙེན་པ་སྔོན་དུ་སོང་བས་བྱ་༽སྐྱེ་གནས་༼གྲོ་ག་ལ་སོགས་པ་ལ་དུར་ཁྲོད་ཀྱི་་་་ན་ཙི་ལ་སོགས་པས་རྣལ་འབྱོར་མ་དྲུག་འབའ་ཞིག་པའི་འཁོར་ལོར་བྲིས་ཏེ་རབ་གནས་ཀྱང་བྱས་ལ་དེ་ནས་བསྒྲུབ་བྱའི་རྐང་རྗེས་ཀྱི་ས་ལས་ལིང་ཀ་བྱས་ལ་འཁོར་ལོར་སྙིང་ཁར་བཅུག་སྟེ་དེ་ནས་དེའི་སྐྱེ་གནས་ནས་སྐུད་པ་དམར་པོ་གཅིག་གཏོན་ལ་དེ་རང་གིས་མཐེ་ཆུང་ལ་དཀྲིས་སྟེ་བསྐུལ་ཞིང་སྔགས་བཟླས་༽བརྒྱ་༼བསྒྲུབ་བྱ་དུ་མ་༽བཅིངས་ལ་༼ལིང་ཀའི་སྐྱེ་གནས་སྐུད་པས་བཅིངས་ལ༽། །སྔགས་པས་༼བསྒྲུབ་པའི་ལིང་ཀ་ལ་༽བསྒྲུབ་བྱར་མངོན་ཕྱོགས་ན། །༼དཔའ་བོའི་གོ་ཆ་སྤེལ་ཚིག་དང་བཅས་པ་བསྐུལ་ཞིང་སྔགས་བཟླས་༽བརྒྱ་རྩ་བརྒྱད་དུ་བཟླས་ནས་ནི། །བསྒྲུབ་པར་བྱ་བའི་ལྟོ་བར་གནས་༼འཁོར་ལོ་གནས་སོ༽། །དེ་ནས་ཡིད་ནི་གནས་བཞིན་དུ་༼མཉམ་པར་བཞག་པ༽། །བློ་ལྡན་ཐུན་གསུམ་མཐེ་ཆུང་༼ལ་སྐུད་པའི་སྣེ་དཀྲིས་སྟེ་༽བསྐྱོད། །༼སྔར་༽བྲམ་ཟེ་གསོད་པའང་ཞག་བདུན་གྱིས། ༼ ཆོས་དང་ལྡན་པ་སྨོས་ཅི་དགོས་༽ །བརྒྱ་བྱིན་ཡང་ནི་ངེས་པར་འགུགས། །༼ཡང་ཡང་འགུགས་པ་༣་པ་༽ཙན་དན་དམར་པོ༼་དང་བསྒྲུབ་བྱའི་རྐང་རྗེས་ལ་༽འི་རྡུལ་ལས་ནི། །༼འགུགས་པར་བྱ་རྒྱུ་དེ་༽བསྒྲུབ་པར་བྱ་བའི་གཟུགས་བྱས་ལ། །༼སྒ་པི་པི་ལིཾ་ཕོ་བ་རིས་༽ཚ་བ་གསུམ་གྱིས་ལུས་ལ་བསྐུ། །༼དེའི་སྟེང་དུ་༽སྤྲ་ཚིལ་གྱིས་ནི་རབ་ཏུ་བྱུག་༼གཡོག༽ །བསྒྲུབ་པ་པོ་ཡི་༼ཡང་ན་མཚན་མ་དང་ལིང་ཀའི་དེའི་སྙིང་ཁར་གསུང་༽གསང་གནས་སུ། །༼འཁོར་ལོ་སྙིང་ཀར་གཞུག་༽ཟངས་མའི་ཁབ་ཀྱིས་ཕུག་ནས་སུ། །སེང་ལྡེང་མདག་མ་དུ་མེད་ལ། །ལན་བརྒྱ་བཟླས་ཏེ་༼དཔའ་བོའི་གོ་ཆ་སྤེལ་ཚིག་དང་བཅས་པ་ཤ་ཚིལ་ཞུ་ཞུ་རུ་༽སྲོས་ནས་སུ། །རྒྱ་པོ་བློན་པོ་༼རྒྱལ་པོའི་༽མདུན་ན་འདོན་༼དང་བྲཾ་ཟེ་ཤིས་པ་འདོན་པ༽། །༼གཞན་ཡང་༽ཆུང་མ་འཁོར་དང་བཅས་པ་རྣམས། །མྱུར་དུ་འགུགས་༼ནས་ལ་བྱེད་དུ་འཇུག་༽པར་བྱེད་པ་ཡིན། ༼རྒྱལ་པོ་་གཞན་ཡང་དགུག་པ་བཞི་བ་༽ །མི་ཡི་བདག་པོ་འཁོར་༼དང་༽བཅས་༼པ་༽ནི། །གྲོ་གའི་འདབ་མར་༼དཔའ་མོའི་གོ་ཆའི་འཁོར་ལོའི་ལྟེ་བར་སྤེལ་ཚིག་དང་བཅས་པ་བྲིས་སྟེ་༽བྲིས་པའམ། །༼སྣག་ཚ་༽དུར་ཁྲོད་རས་ལ་སེན་རྩི་༼རྒྱ་སྐེག་དང༽་དང་། གྷི་ཧཾ་དག་གིས་བྲིས་ནས་ནི། ༼རྐང་རྗེས་རྡུལ་ལ་ལིང་ཀ་བྱས་ལ་དེའི་སྙིང་ཁར་ཙཀྲ་བཅུག་ལ་ལིང་ཀ་དེ་ཡང་་སྲ་ཚིལ་གྱིས་གཡོག༽ །མིང་དང་སྤེལ་ནས་གང་ལ་ནི། ༼བསྒྲུབ་བྱ་གང་ན་གནས་པར༽ །མངོན་པར་ཕྱོགས་ཏེ་༼དཔའ་མོའི་གོ་ཆ་༽བརྒྱ་བཟླས་ནས། །དུར་ཁྲོད་མེ་ལ་༼སྲ་ཚིལ་ཞུ་ཞུ་ཙམ་༽དེ་གདུངས་ན། །༼དགུག་པ་༽དུར་ཁྲོད་མེ་དེ་འགྲུབ་ཕྱིར་༼དེ་ལ་གདུང་པར་༽བཤད། །ཇི་སྲིད་སྤྲ་ཚིལ་མ་༼མ་ཐིགས་པར་༽ཞུ་བར། །བསྲོས་པར་གྱུར་ན་རྒྱལ་བོ་ནི། །འཁོར་ལོ་བསྒྱུར་དང་བཅས་པ་ཡང་། །ངེས་པར་འགུགས་པར་འགྱུར་བ་ཡིན། །༼གཞན་ཡང་༽བསྒྲུབ་པར་བྱ་བའི་༼ལྔ་བ་སྦྱིན་སྲེག་གི་ལས་བསྒྲུབ་པ་༽རྐང་རྗེས་ས། །ཙན་དན་དམར་པོ་ཉིད་དང་ནི། །དུར་ཁྲོད་ཐལ་བར་བསྲེས་པ་རྣམས། །བསྒྲུབ་པ་པོ་ཡིས་གཅིག་བསྡུས་༼པ་ཙམ་ལས་ལིང་ཀ་བྱ་མི་དགོས་༽ལ། །སེང་ལྡེང་མེ་ནི་དུ་མེད་ལ། །རྡུལ་དེ་༼ཙཀྲ་དང་ལྡན་པའི་ལག་པ་༢་༽ལག་པ་གཉིས་ཀྱིས་ནི། །མཉེས་ལ་སྦྱིན་བསྲེག་བྱས་ནས་ནི། །ཇི་སྲིད་༼ཕྱེ་མ་༽ཐམས་ཅད་བསྲེགས་པས་འགྲུབ། ༼ ཐབ་དང་མེ་ལྷ་ལ་སོགས་པ་ཐམས་ཅད་སྦྱིན་སྲེག་གི་ཆོ་ག་ལས་ཤེས་པར་བྱ་༽ །༼ཕྱེ་མ་དེ་རྣམས་བླང་ལ། ཞི་བ་ལ་སོགས་པའི་ལས་ཐམས་ཅད་གོ་ཆའི་སྔགས་བརྗོད་ཅིང་བསྲེག་པ་ཉིད་ཀྱིས༽༼ལ་ལ་མེ་གསུང་༽རྡུལ་དེ་བླངས་ནས་མ་ཡེངས་པར། །དབུགས་མ་འབྱིན་པར་སྦས་ནས་ནི། །བརྒྱལ་ཞིང་སེམས་ནི་བྲལ་འདྲ་ལ། །རྨོངས་ཤིང་སེམས་ནི་ཉོན་མོངས་ལ། །རླུང་གི་ཤུགས་ཀྱིས་འོངས་ནས་ནི། །བསྒྲུབ་པ་པོ་ཡི་སྟེང་དུ་ལྷུང་༼སྟེ་སྟེང་ངམ་གམ་དུ་འདི་ཡང་ལྷ་ཡབ་ཡུམ་གྱི་ང་རྒྱལ་དང་ལྡན་པས་སྔོན་དུ་སྙེན་པ་སོང་བ་༡་གིས༽། །༼སྐྱེས་པ་༽ཕྱུགས་སམ་ཡང་ན་ཕོ་ཉ་མོ༼རྐྱང་མ༽། །དེ་ནས་ལས་ཀྱི་ཕོ་ཉ་མོར་༼དབང་དུ་བྱ་བ༽། །བྱ་བ་འདི་ནི་འཛིན་པར་འགྱུར། །༼དྲུག་པ་མནན་པའི་ལས་ཀྱིས་དབང་དུ་བྱ་བའམ་དགུག་པ་༽ཀ་ར་བི་རའི་ལྕུག་མ་ནི། །རླན་བཅས་༼སྦོམ་ཕྲའི་ཚད་༽དཔུང་བའི་ཚད་མཉམ་བླངས། ༼དེ་ལ་དཔའ་མོའི་གོ་ཆའི་སྔགས་ཚར་༣་བྲིས་ལ་དེ་དག་བཟའ་མི་དུས་༡་ཤི་བའི་རོ་བསྲེགས་པའི་མེ་ལ་བསྲོ། དེ་ནས་༽ །འབར་གྱུར་རོ་བསྲེག་མེ་ལ་དོར། །ཇི་སྲིད་དེ་ནི་མ་ཚིག་པར། །མྱུར་དུ་སོང་ཏེ་དེ་བླངས་ནས། །༼དཔའ་མོའི་གོ་ཆ་༽རིག་པ་ལན་བདུན་༼སྔགས་སྤེལ་ཚིག་དང་བཅས་པ་༽བཟླས་ནས་ནི། །གང་ཞིག་བཟླས་ཏེ་༼ལག་པ་༽བསྐོར་ན་ནི། །དེ་ནི་དེ་ཡི་སྐད་ཅིག་ལ། །བུད་མེད་དང་ནི་སྐྱེས་པ་དག ༼བདུན་པ་དབང་དུ་བྱ་བའི་སྦྱོར་བ་གཞན་༽ །རླུང་གི་ཤུགས་ཀྱིས་༼ལག་པས་སྐོར་བ་ཙམ་གྱིས་༽འོངས་པར་འགྱུར།༼སྦྱོར་བ་གཞན་གདབ་དབང་་་་པ་ལས་བརྒྱད་སྙེན་པ་སྔོན་དུ་སོང་བ་ལ་སོགས་པ་ཐམས་ཅད་ལ་འདྲའོ༽ །ཀ་ར་བི་རའི་མེ་ཏོག་དམར་༼བ་ལ༽ །༼གནག་གི་དབང་ཕྱུག་ཆེན་པོ་སྟེ་བརྗོད་པ་ཙམ་གྱིས་འགྲུབ་པར་གསུང་༽ །༼དཔའ་མོའི་གོ་ཆ་༽བརྒྱ་བཟླས་༼སྐར་མ་༽རྒྱལ་གྱི་སྦྱོར་བ་ལས། །བསྒྲུབ་པོས་གྷིཧཾ་༼གིས་༽གོས་བྱུགས་ལ། །༼ བུ་ཞིག་ཞེས་བྱ་བ་ལ་སོགས་པ་༽མེ་ཏོག་༼ཀ་ར་བི་རའི་མེ་ཏོག་གཏོར་ཏེ་༽ཆུ་ལ་གནས་པ་དག།༼ཀ་ར་བི་རའི་མེ་ཏོག་གཏོར་བའི་༽ཆུ་བོ་ཆེན་པོ༼འི་ནང་དུ་༽ར་ཞུགས་ནས་ནི། །ལྟེ་བ་ནུབ་༼ཙམ་དུ་འདུག་༽པའི་བར་དུ་༼འདུག་ལ་༽ནི། །༼ཀ་ར་བི་རའི་མེ་ཏོག་ཆུ་ལ་བཞག་པ་དེ་༽ལག་པའི་སྦྱོར་བས་དབུས་༼སུ་བཞག་ལ་༽གནས་ལ། །༼དཔའ་མོའི་གོ་ཆ་སྤེལ་ཚིག་དང་བཅས་པ་༽རིག་པ་སྟོང་དུ་བཟླས་ནས་ནི། །ལག་པ་༼འཁོར་ལོ་དཔལ་ལྡན་པ་༽གཉིས་ཀྱིས་༼མེ་ཏོག་དེ་༽ཕྱེར་༤༤་་་་༧་་ སྤགས་ཏེ། །ཆུ་དང་བཅས་པ་བཏུང་བར་བྱ། །དེ་༼དེ་ཕྱིན་ཆད་༽ནས་བསྒྲུབ་པ་པོ་དེ་ཡིས། །ཚིག་༼ངག་གི་དབང་ཕྱུག་༽གི་དངོས་གྲུབ་ཐོབ་པར་འགྱུར། །༼ཇི་ལྟ་བུའི་ངག་འགྲུབ་ན༽རྒྱལ་པོའམ་རྒྱལ་པོའི་ཆུང་མ་ནི། །ཡིད་ཀྱིས་ངེས་པར་༼ཁུག་པ་ཞེས་བརྗོད་པས་དྲན་བས་༽འགུགས་པར་འགྱུར། །ལྷར་བཅས་ལྷ་མིན་མི་རྣམས་ནི། །མྱུར་དུ་༼སེམས་ལ་དབང་དུ་བྱེད་པར་འགྱུར་༽དབང་དུ་བྱེད་པར་འགྱུར། །༼སེམས་༽ཁྲོས་པས་ཚིག་གིས་༼སོང་ཞེས་པ་ཙམ་གྱིས་༽གསོད་པར་འགྱུར། །དབྱེ་དང་བསྐྲད་པ་ཉིད་ཀྱང་བྱེད། །བསྒྲུབ་པ་པོ་ཡི་༼སེམས་ལ་འདོད་ཅིང་༽ཚིག་ཉིད་ཀྱིས། །ཚར་གཅོད་པ་ཉིད་བྱེད་པར་འགྱུར། །༼གྱེན་ལ་བཟློག་ན་ཅེས་པ་༽ཚིག་ཙམ་གྱིས་ནི་ཆུ་བོ་དང་། །ཤིང་རྟ་༼འཆག་༽འཁྲུལ་འཁོར་༼འཆག་༽རྒྱ་མཚོ་༼སྐྱེམས་༽དང་། །གླང་པོ་རྟ་༼འཆི་༽དང་དེ་བཞིན་སྤྲིན་༼ཡང་འཐོར་༽། །སྐྱེས་བུ༼་རེངས་ནས་འགྲོ་བུད་མེད་ཀྱང་རེངས་ནས་འགྱུར་གསུང་༽འམ་ཡང་ན་བྱ་བ་གནོན་༼གཞན་གྱིས་གནོད་པར་སེམས༽། །ཡིད་ལ་གང་དང་གང་འདོད་པ་༼དང༽། །༼བརྗོད་པ་ཙམ་གྱིས་༽ཚིག་གིས་ཐམས་ཅད་༼འགྲུབ་༽བྱེད་པར་འགྱུར། །༼གཞན་ཡང་༽དེ་ནས་གཞན་གྱི་ལས་བཤད་པ། །དཔའ་བོ་ཆེན་པོ་༼ཞེས་བསྡུད་པ་པོས་གསུངས་པ་༽རང་ཉིད་གསུངས། །དགུག་པ་ཡི་ནི་སྦྱོར་བ་དག།༼ཤེས་པ་ཆགས་པའི་སྟོབས་ཀྱིས་༽བུད་མེད་ཐམས་ཅད་རྨོངས་བྱེད་པ། །༼ཉི་ཟླ་གཟས་ཟིན་པའི་དུས་སུ་བྱ་་་་ ཙན་ཏིའི་རྒྱུ་ཕྱག་༤་བ་བྱས་ལ་༽ཀ་ར་༼རྫས་༽བི་རའི་མེ་ཏོག་ནི། །དམར་པོ་ཡང་དག་བླངས་ནས་སུ། །རིག་པ་༼དཔའ་མོའི་གོ་ཆ་༽ལན་བདུན་བཟླས་པ་༼འི་ཀ་ར་བི་རའི་མེ་ཏོག་༽་དག །སྐྱེ་གནས་དབུས་སུ་༼ཙན་ཏི་ཀའི་རུ་པ་བྱས་པའི་མེ་ཏོག་གཉིས་ཀ་ར་བི་རའི་མེ་ཏོག་གཉིས་༽གཞུག་༼བཞག་༽པར་བྱ། །མེ་ཏོག་༼༢་པོ་༽དེ་ནི་༼༢་༽ཁ་སྦྱར་བྱས། །༼ཙན་ཏི་ཀའི་༽གསང་བའི་གནས་སུ་ངེས་པར་སྦྱར། །གཉིས་མེད་ཡེ་ཤེས་༼ལྷའི་རྣལ་འབྱོར་ལ་གནས་པའི་༽རྣལ་འབྱོར་ལྡན། །སྔགས་པས་བརྒྱ་ཕྲག་གཅིག་ཏུ་༼གོ་ཆའི་སྔགས་༽བཟླས། །སྐྱེ་གནས་དབུས་ནས་མེ་ཏོག་དེ་༼བཏོན་ཏེ༽། །བསྒྲུབ་པ་པོ་ཡིས་གཅིག་བླངས་ནས། །༼སྤེལ་ཚིག་དང་བཅས་པས་ཙན་ཏིའི་སྤྱི་བོར་བསྣུན་༽མེ་ཏོག་གིས་ནི་༼༡་བཅངས་པ་༽གང་བསྣུན་༼ཀྱང་༡་གིས་༽པ། །དེ་ཡི་མོད་ལ་དབང་དུ་འགྱུར། །༼ཆགས་པའི་དབང་གིས་༽བརྒྱལ་ཞིང་སེམས་དང་བྲལ་བ་དང་། །ཡན་ལག་ཚིགས་ཀུན་༼བསྒྲུབ་པ་པོ་༽གཞན་དབང་སྟེ། །༼བསྒྲུབ་པ་པོ་ལ་འཕྲལ་དུ་༽ཡིད་ཆེས་སེམས་ནི་འཇུག་པ་རུ་༼གྲུབ་པ་ཉེ་བ་ལ་དགོངས་པ༽། །སྐད་ཅིག་གིས་ནི་དབང་དུ་བྱེད། །འདི་ནི་༼ངེས་པར་༽མངོན་དུ་འགྲུབ་པ་སྟེ། །དོན་ཡོད་དབང་དུ་བྱེད་པ་ཡིན། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་རྣལ་འབྱོར་མ་དྲུག་གི་ཚིག་གི་དངོས་གྲུབ་དང་དགུག་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་ལྔ་པའོ། ། ༼འདི་ཡང་ལྷ་ཡབ་ཡུམ་གྱི་རྣལ་འབྱོར་ལ་གནས་ནས་བསྒྲུབ༽ །དེ་ནས་ཡི་གེ་༼ལས་སྦྱོར་དུས་སུ་འདི་བཟླས་༽ཧ་ལྔ་ནི་༼འདི་ཡང་་ བཞི་གང་རུང་ལ་བསྙེན་པ་བསྐྱལ། ཁྱད་པར་གྱི་བསྙེན་པ་ཧ་ལྔ་བཟླས་པ་བྱ་བ༽། །ལས་རྣམས་ཐམས་ཅད་འགྲུབ་༼ཁྲག་འགུག་པ་ལས་སོ༽་བྱེད་པ། །གང་ཞིག་༼སྔགས་ཀྱི་ཆེ་བ་༽ཤེས་པ་ཙམ་གྱིས་ནི། །མྱུར་དུ་དངོས་གྲུབ་༼ཐ་མ་༽ཐོབ་པར་བཤད། །༼མདུན་མ་༽ཧཱེ་༼བྱང་ནུབ་ལྷོ་༽ཧཱོ་ཧཱུཾ་ཧཾ་ཧ༔༼དབུས་༽ཡི་གེ་ལྔ་བོ་དང་། ༼གཞི་༽ །ལག་པ་༼ལག་གཉིས་ཕན་ཚུན་༽མཉེས་པས་བསྐུལ་ཚིག་༼སྔགས་༽བཅས་༼པ་བཟླས་་ཁྲག་སྐྱུག་གི་པར་༡་པ༽། །ཁ་ནས་ཀྱང་ནི་ཁྲག་འཛག་ཅིང་། །དགྲ་བོ་དེ་ཡི་མོད་ལ་འཆི་༼བསད་པའོ༽ ། ༼གཞན་ཡང་༽ །ཤིན་ཏུ་མཛེས་པའི་ཐོད་༼པ་ལ་འཁོར་ལོ་བྲིས་ལ་་་་ཡང་་་པ་ཅང་ལོ་ཅན་ལ་བྲིའོ༽གནས་པ། །༼རང་གི་༽སྲིན་ལག་༼གི་༽ཁྲག་གིས་༼ཙཀྲ་དེ་༽བསྙེ་བར་བྱ། །ཇི་སྲིད་༼ཁྲག་བདག་གི་ཐོད་པར་དངོས་སུ་འབྱུང་༽སྐམས་ཀྱི་བར་དུ་སྟེ། །༼བསྒྲུབ་བྱའི་ཁྲག་ཟད་པས་༽དེས་ནི་བསྒྲུབ་བྱ་རྣམ་པར་འཇིག་༼འཆི༽ ། ༼གཞན་ཡང་༽ །གལ་ཏེ་༼བསམ་རྒྱུད་༽ཁྲོ་བ་འབར་བ་དང་། ༼ལག་ལ་ཙཀྲ་བྲིས་ལ་རབ་གནས་ཇི་ལྟ་བ་༤ན་བྱས་ལ་༽ །༼དུག་མ་་་པས་ལག་པ་༢་འཁོར་ལོར་བྲིས་ལ་༽མིག་དམར་གྱུར་བས་༼ཧ་ལྔ་ལ་སྤེལ་ཚིག་དང་བཅས་པ་༽བཟླས་ན་ནི། ༼ཙཀྲ་དང་ལྡན་པའི་ལག་པ་དེ་བསྟན་ན་༽ །དཔུང་ཚོགས་བཞོན་པར་བྱས་པ་ཡི། །རྒྱལ་པོ་མྱུར་དུ་བརླག་༼རེངས་ཞིང་འཆི་༽པར་བྱེད། ༼དམ་ཚིག་ཅན་ལ་གཏོར་མ་སྦྱིན་པའི་ཕྱིར་༽ །བྱི་ལ་དང་ནི་ནེའུ་ལེ་དང་། ༼འདི་རྣམས་ཀྱི་ཤ་༽ །ཁྱི་ཁྭ་ཝ་དང་ཆུ་སྐྱལ་༼རྣམས་ཀྱིས་༽དང་༼ ནི ༽ ། ༼ ལས་དེ་དག་བསྒྲུབ་པའི་དུས་སུ་གཏོར་མ་དང་སྦྱིན་སྲེག་བྱ་བའི་ཤ་བསྟན་༽ །མཁའ་འགྲོ་མ་ལ་གཏོར་༼མ་དང་སྦྱིན་༽བསྲེག་བྱ། །༼སྔར་གྱི་ལས་རྣམས་༽འདི་དག་མྱུར་དུ་འགྲུབ་ཡིན་པ། །རྒྱུད་འདི་ལ་ནི་ཐེ་ཚོམ་མེད། །རི་བོང་ལ་སོགས་སྤུ་ལས་ནི། །སྲད་བུ་བྱས་ཏེ་ལན་སྟོང་བཟླས། ༼སྲད་བུ་དེ་༽ །གང་གི་༼བསྒྲུབ་བྱ་་་མེ་ཏོག་དང་ཙཀྲ་ལྡན་པའི་ལག་པ་དེས་༽མགུལ་དུ་བཅིངས་གྱུར་བ། །དེ་ནི་དེ་དང་འདྲ་བར་༼གང་བཏགས་པ་དེའི་གཟུགས་སུ་༽འགྱུར། ༼གཞན་ཡང་ལག་པ་ལ་ཙཀྲ་སྤེལ་ཚིག་དང་བཅས་པ་བྲིས་པ་དེ་༽ །ལག་པ་བཟླས་བརྗོད་སྟོང་བྱ་སྟེ། །ཀ་ར་བི་རའི་མེ་ཏོག་དང་། །༼མེ་ཏོག་རེ་རེ་ལ་༽ཡི་གེ་༼ཧ་ལྔ་༽རེ་རེས་མངོན་བཟླས་ཏེ། །སྦྲུམ་མ་ལ་ནི་རེག་གྱུར་ན། ༼བུ་ལས་བུ་མོའམ་བུ་མོ་བུའམ་མི་ལས་དུད་འགྲོ་ལ་སོགས་པ་༽ །མངལ་ནི་རྣམ་པར་འཕོ་འགྱུར་ཏེ། ༼ཤ་བ་དང་རྣ་བ་ལ་སོགས་པ་གཞན་ཡང་གཟུགས་བསྒྱུར་བའི་ལས་ཀྱི་ཚོགས་མངལ་སླར་སོས་པར་གྱུར་༡་པའི་སྤེལ་ཚིག་དང་བཅས་པ་བཟླས་ན་སླར་འཚོ་བར་འགྱུར་རོ༽ །བཏང་ན་ཐར་བར་འགྱུར་བ་ཡིན། །གང་ལ་༼འཁོར་ལོ་ལྡན་པའི་ལག་པས་༽སྡིགས་མཛུབ་བྱས་ཏེ་འཆི། །སླར་ཡང་༼ལག་པའི་ཙཀྲ་བཀྲུས་ཏེ་ཆུས་གཏོར་ཞིང་སྔགས་བཟླས་ན་༽འཚོ་བར་བྱེད་པ་ཡིན། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་༼བྷ་ག་ཅན་བསྐྱེད་པའི་ས་བོན་༽ཡི་གེ་ཧ་ལྔའི་ལས་ཀྱི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་དྲུག་པའོ། །༼ལེའུ་བཞི་བཅུ་རྩ་བདུན་པ་ནས་རྩ་དགུ་པའི་བར་གྱིས་ཡུམ་གྱི་ཉེ་སྙིང་ཉི་ཤུ་རྩ་༡་པས་འཁྲུལ་འཁོར་ལ་སོགས་པའི་ལས་དང་སྐྱེ་བ་བདུན་པ་བརྟག་པ་བསྟན་ཏེ་དེའང་ལེའུ་༤་བཅུ་བདུན་པ་དང་བརྒྱད་པས་ཙཀྲ་ལ་སོགས་པ་ལ་བརྟེན་པའི་ལས་བསྟན་ལ་རྩ་དགུ་པས་སྐྱེ་བ་བདུན་པ་བསྒྲུབ་པ་བསྟན་ཏོ༽ །༼རྗེ་བཙུན་མའི་ཉེ་བའི་སྙིང་པོ་ནས་བསྟོན།ཉེ་སྙིང་འབུམ་ཕྲག་བཞི་སྔོན་དུ་སོང་པས་ལེའུ་༣་པོ་འདིའི་ལས་བསྒྲུབ་པ་ནི་ལས་སྦྱོར་དུས་སུ་སྦྱར་ནས་༽དེ་ནས་༼ཡང་དག་ཡིན་ཟེར་༽གཞན་ཡང་བཤད་བྱ་བ་༼བཅུ་༢་པར་ཁ་སྐོང་༽། །མཁའ་འགྲོ་ཀུན་གྱི་སྙིང་པོ་སྟེ།༼ སརྦ་བྷུ་ཏ་ཌ་ཀི་ནི་ལ་སོགས་པའི་བཟླས་པའི་ཕན་ཡོན་དང་དབང་པོ་རབ་ཀྱི་ལས་བསྟན་༽ །འདི་ནི་བརྗོད་པ་ཙམ་གྱིས་ཀྱང་༼དབང་པོ་རབ་ལ་བཟླས་པ་དང་དྲན་པ་ཙམ་གྱིས་འགྲུབ་པར་བསྟན༽། །དངོས་གྲུབ་༼གང་འདོད་༽ཐམས་ཅད་བསྐྱེད་བྱེད་ཡིན། དེ་ལ་མཁའ་འགྲོ་མའི་༼ཉེ་སྙིང་སྤེལ་ཚིག་དང་བཅས་པས་༽རིག་པ་ཆེན་པོ་བཟླས་ན་༼རྒྱལ་རིགས་ལ་སོགས་པ་༽རིགས་ཐམས་ཅད་དབང་དུ་བྱེད་པར་འགྱུར་རོ། ༼དུས་༽རྟག་ཏུ་༼ཉེ་སྙིང་ལ་འདི་འབའ་ཞིག་ལ་རྩེ་༡་ཏུ་༽བཟླས་བརྗོད་བྱས་པས་ནི་༼བསོད་ནམས་ཁྱད་པར་གྱི་ལས་༽དཔལ་ཆེན་པོ་བསྐྱེད་པར་འགྱུར་རོ༼སྔོན་དུ་བསྙེན་པ་འབུམ་ལ་སོགས་པ་སྔོན་དུ་སོང་པས་ལས་ཀྱི་སྦྱོར་བ་གསང་པ་བསྒྲུབ་པ༽ ། ༼དྲག་པོའི་ལས་༽མི་རུས་ཀྱི་༼རྗེ་ངར་ལས་༽རྒྱུ་ལས་ཕུར་བུ་སོར་དྲུག་པ་༼སྟོད་རྡོ་རྗེ་རྩེ་ལྔ་པ་ལ་སོགས་པ་སྨད་ཟུར་༣་པར་བྱས་ལ་སརྦ་བུད་དྷ་ཌ་ཀི་ནི་ལ་སོགས་པའི་སྔགས་རྫོགས་པ་བྲིའོ༽བྱས་ལ་བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བཟླས་ནས་གང་གི་སྒོར་སྦས་པ་དེའི་རིགས་རྒྱུད་རྣམས་༼རྩ་བ་ནས་༽གཅོད་པར་འགྱུར་རོ། ༼མི་སྐྱེ་བར་འདོད་ན་ཞིང་སྐྱིལ་དུ་སྦ་༽ཞིང་དང་ར་བ༼ར་སྦས་ན་ཕྱུགས་རྣམས་འཆི་༽དང་མ་ཧེ༼འི་ར་བ་༽དང་གླང་བོ་ཆེ༼འི་ར་བ་༽དང་། རྟའི་གནས་སུ་༼ར་བ་༽བརྐོས་ཏེ་༼ཕུར་བ་༽སྦས་ན། ༼ཞིང་དང་ཕྱུགས་ལ་སོགས་པ་༽ཐམས་ཅད་བརླག་པར་འགྱུར་རོ། ༼གཞན་ཡང་༽དེ་ནས་རྒྱལ་བོའམ་རྒྱལ་བོའི་བློན་པོ་དབང་དུ་བྱ་བར་འདོད་ན། ༼ཕག་མོའི་ཉེ་སྙིང་ཕ་དང་ཊ་ཕྱེ་བས་ཡི་གེ་ཉི་ཤུ་རྩ་༡་པའི་ཙཀྲ་བྲིས་ལ་རབ་གནས་ལ་སོགས་པ་བྱས་ཏེ་ལིང་ཀའི་སྙིང་ཀར་བཅུག་ལ་༽རྒྱལ་པོའི་སྒོར་ས་ལས་བྱས་པའི་༼རྫ་མཁན་གྱི་ལག་པ་ཕྱིས་པའི་ས་ལ་༽གཟུགས་བརྙེན་སོར་བརྒྱད་པར་བྱས་ལ། ༼དབང་དུ་བྱ་བ་ལ་༽མཁས་པས་༼རང་གི་མདུན་དུ་ལིང་ཀ་༽བཞག་ནས་༼མར་གྱི་ཉི་ཤུ་ལྔ་ལ་༽ཉིན་དང་པོ་ལ་༼ཤིང་༽མ་དུ་ལུང་ཀའི་འབྲས་བུ་དང་མེ་ཏོག་༼ལོ་མ་དང་༽བསྲེས་ཏེ། ༼སྤེལ་ཚིག་དང་བཅས་པ་༽སྦྱིན་བསྲེག་༼ལམ་གྱི་གཞི་མདོ་ལ་སོགས་པར་༽བརྒྱ་སྟོང་བྱས་༼ལིང་ཀ་དེ་མནན་པ་བྱས་ན་༽ན་དེ་དབང་དུ་འགྱུར་རོ།༼གཞན་ཡང་ སརྦ་བུ་དའི་༽སྔགས་༼སྔར་༤ན་དུ་ཙཀྲ་བྲིས་ཏེ་སྣག་ཚ་སྐྱེད་པས་བྱ་ཁྲག་དགུག་པ་ལ་སོགས་པར་གང་འདོད་པ་དེའི་རྐང་རྗེས་དང་རྫ་མཁན་གྱི་ལག་པ་ཕྱིས་པའི་ས་ལ་ལིང་ཀ་བྱས་ལ་ཁོག་པར་འཁོར་ལོར་བཅུག་ལ་རྫས་་་་་་མས་་་་་་་བྱས་ལ་མནན་ན་༽འདི་ཉིད་ཀྱིས་དགུག་པ་༼སྤེལ་ཚིག་སྤོས་ ༽དང་། གནོན་པ་༼རེངས་པ་༽དང་། རྨོངས་༼དྲན་པ་ཤན་༽པ་དང་། ༼ཁྲག་༽སྐེམས་པ་དང་། ༼སེམས་༽རྨུགས་༼འདི་དག་གི་ཉམས་བླང་ཞིབ་མོར་སྔར་དང་འདྲ་༽པ་དང་༼ཅུང་ཟད་དྲན་པ་དང་བྲལ་བ༽ ། ཚིག་༼སྨྲ་མི་ཤེས་པ་༽འཕྲོག་པ་དང་། ལོང་པར་བྱེད་པ་དང་། ༼སླར་ཡང་སོས་པར་གྱུར་ཅིག་པའི་སྤེལ་ཚིག་དང་། ལིང་ཀའི་སྙིང་ཁ་ནས་འཁོར་ལོ་བཏབ་ནས་ཙན་དན་དཀར་པོའི་ཆུས་བཀྲུས་ནས་༽སླར་གཏོང་བར་བྱེད་དོ། དེ་ནས་༼གཞན་ཡང་༽སྐྱེས་པ་བུད་མེད་དུ་བྱ་བར་འདོད་ན། ༼རོ་དང་དུས་༡བསྐྱལ་བའི་༽རོའི་མེ་ཏོག་དང་། ཀ་ཀ་ཨན་ཏྲི་ཀའི་འབྲས་བུ་༼ནག་པོ་ཆེན་པོ་བྱ་ཁྭའི་མཆུ་འདྲ་བསྐྱུལ་བ་༽དང་། བཀྲེས་པའི་༼བྱ་རོག་༽སེན་མོ་དང་། ༼དེའི་༽རྐང་བའི་འོག་གི་སྤགས་པ་ཆ་མཉམ་པར་བྱས་ལ། རི་བོང་གི་ཁྲག་དང་བཏགས་ཏེ། རི་ལུ་བཅུ་གཅིག་བྱས་ལ་གྲིམ་མ་ལ་བསམ་མོ། དེ་བཞིན་དུ་༼བསྒྲུབ་བྱའི་སྐྱེས་པའི་ཉིན་ཞག་དྲིས་ལ་དེ་ཤེས་ན་ཉིན་ཞག་གང་ཡང་སྐྱེས་པ་དེའི་ཉི་མ་དང་ཚེས་གང་ལ་བཟླས་པའི་རི་ལུ་མ་ནོར་བས་བསྒྲུབ་་་་་་དངོས་སམ་རྒྱུ་བ་ལ་བསྟུན་གསུང་༽ཞག་བཟང་པོ་ལ་ལག་པ་ལ་བཅིངས་ཏེ། ༼རི་ལུ་ ཚེས་བཅུ་གཅིག་པ་ལ་་་་་་་་་་པ་ཡིན་ན་བཅུ་གཅིག་པའི་བར་གྱི་སྔགས་བཟླས་པ་རྫོགས་ནས་བཅུ་གཉིས་པ་སྐྱེས་པའི་ཉིན་ཞག་ཤེས་པར་བྱས་ལ་༽ཉི་མ་གཅུ་གཉིས་༼བསྒྲུབ་བྱ་ཚེས་བཅུ་གཉིས་ལ་སྐྱེས་པ་དེའི་ཉི་མ་དང་ཚེས་༢་པའི་རི་ལུས་བཅུ་༣་པ་ཡིས་དེའི་འདྲེས་ཀྱིས་ཡར་ངོ་མར་ངོ་༢་ཀ་སྦྱར་གསུང་༽པ་ལ་༼རི་ལུ་༽གང་གི་ཕྱེ་མ་༼དངོས་སུ་༽མགོ་ལ་བཞག་པ་དེ་བུད་མེད་དུ་འགྱུར་རོ། ༼གཞན་ཡང་༽དེ་ནས་སྐྱེས་པ་ཁྱིར་བྱ་བར་འདོད་ན།༼ལྕགས་རྡོའི་བྱེ་བྲག་༡་ཡོད་གསུང་དེའི་ཕྱེ་མ་༽རྒྱ་ལྕགས་༼ཟད་པ་༽ནེའུ་ལེའི་༼དྲེ་མོ་༽སྤྱི་བོར་བཞག་ལ། མཚན་མོ་བདུན་གྱི་བར་དུ་༼ཐུན་རེ་རེ་ལ་ཉེ་སྙིང་༽བརྒྱ་སྟོང་བཟླས་ལ། ཉིན་ཞག་བརྒྱད་པ་ལ་༼དེ་༽གུར་གུམ་༼ལྕགས་ཕྱེ་དང་༽དང་མཉམ་པོར་བྱས་ཏེ། ལན་བརྒྱ་རྩ་བརྒྱད་བཟླས་ལ་༼ལྕགས་༽ཕྱེ་མའི་སྦྱིན་བསྲེག་༼བརྒྱ་རྩ་བརྒྱད་༽བྱས་ན། ༼དེའི་ཐལ་བ་༽གང་གི་སྤྱི་བོར་བཞག་པ་དེ་ཁྱིར་འགྱུར་རོ། ༼རྗེས་བཟུང་༽སླར་གསོ་བ་མི་མཚན་མོའི་དུས་སུ་མཁའ་འགྲོ་མ་རྣམས་ལ་༼ཤ་དང་ཆང་གི་༽མཆོད་པ་ཆེན་པོ་བྱས་ཏེ། གཏོར་མ་བྱིན་ན་༼སྤྱི་བོའི་རྫས་ཀྱིས་ཕྱིས་ཏེ་སླར་སོས་པར་གྱུར་༡་པའི་སྤེལ་ཚིག་དང་བཅས་པའི་སྔགས་བཟླས་ན་༽དེའི་འོག་ཏུ་རྣལ་མར་འགྱུར་རོ། རྫས་རྫས་མ་ཡིན་པར་འདོད་ན།༼གསེར་གསེར་མ་ཡིན་པར་འགྲོ༽ གསེར་ཤིང་གི་༼ལང་ཏང་པས་༽འབྲས་བུས་སྦྱིན་བསྲེག་༼སྤེལ་ཚིག་དང་བཅས་པའི་སྔགས་ཀྱིས་ཚོགས་འཁོར་༽བརྒྱ་༼ཐབ་དུ་༽བྱས་༼ལས་ཐམས་ཅད་པའི་ཐབ་ཁུང་བྱས་ཏེ་བྱ་༽ན། རྫས་རྫས་མ་ཡིན་པར་༼གསེར་ར་གཞན་ལ་སོགས་པ་༽འགྱུར་རོ། ༼གྲངས་བརྒྱ་འདྲ་༽ཨ་རུ་རའི་སྦྱི་བསྲེག་བྱས་ན་རྣལ་མར་འགྱུར་རོ། ༼གཞན་ཡང་༽དེ་ནས་གློ་བུར་བ་རྣམས་༼སེར་བ་དང་ཐོག་ལ་སོགས་པ་༽བསྐྱེད་པར་འདོད་ན། བྱ་ཆེན་པོའི་གནས་ཀྱི་༼འུག་པའི་ཚང་གི་ཤིང་ལ་ཤན་པའི་བུ་མོའི་སྐྲས་་་་་་་་་་་་་་་་༽སྦྱིན་བསྲེག་༼བསྲེག་ལུགས་བརྒྱ་༽བྱས་ན། ༼ཐུན་རེ་ལ་བརྒྱ་རྩ་རེ་༽ཞག་བདུན་གྱིས་གློ་བུར་བ་༼གཟེར་དང་ཐོག་ལ་སོགས་པ་༽འབྱུང་བར་འགྱུར་རོ། སླར་བཟློག་པ་ནི་༼ཀུ་ཤའི་༽འབྲས་ཕུབ་ཀྱི་སྦྱིན་བསྲེག་༼སྲེག་བླུགས་བརྒྱ་རྩ་༽བྱས་ན་ཞི་བར་འགྱུར་རོ། །བྱི་ལའི་སྤུ་ཟླ་བ་གཟས་ཟིན་པའི་ཚེ་བསྡུས་ནས་གང་གི་མིང་ནས་༼ཉེ་སྙིང་མཐར་ཆེ་གེ་མོ་བྱི་ལར་གྱུར་༡་པ་དང་བཟླས་ཏེ་བཟླས་བ་་་་༽བརྗོད་ནས་སྦྱིན་བསྲེག་བྱས་པ་དེའི་ཐལ་བ་བླངས་ཏེ། ༼གང་གི་༽མགོ་བོར་བྱིན་ན་བྱི་ལར་འགྱུར་རོ། སླར་བཟློག་ན་༼སྤྱི་བོའི་ཐལ་བ་ཕྱིས་ཏེ་སྤེལ་ཚིག་སླར་སོས་པར་གྱུར་ཅིག་པ་དང་བཅས་ཏེ་བཟླས་ན་༽རྣལ་མར་འགྱུར་རོ། ༼གཞན་ཡང་༽བྱ་རོག་གི་རྒྱུས་པ་ལ་སྲད་བུ་བྱས་ལ། ༼ཉེ་སྙིང་༽བརྒྱ་རྩ་བརྒྱད་མངོན་པར་བཟླས་ཏེ། ༼རང་གཞན་༽གང་གི་མགུལ་དུ་བཅིངས་པ་དེ་ཁྭར་འགྱུར་རོ། ༼གཞན་ཡང་༽སེམས་ཅན་གང་ལ་གང་གི་རྒྱུས་པ་སྲད་བུ་བླངས་ལ་༼སྤེལ་ཚིག་དང་བཅས་པས་༽མངོན་པར་བཟླས་ཏེ། ༼སྲད་བུ་དེ་མགུལ་དུ་༽བཅིངས་པ་དེ་དང་དེ་འདྲ་བར་འགྱུར་རོ། དེ་བཞིན་དུ་ཁྭ་དང་། ཐ་བ་དང་། རྨ་བྱ་དང་། ཆུ་སྐྱར་དང་། འུག་པ་དང་། ཁྲ་དང་། བྱ་རྒོད་ཀྱི་གཟུགས་༼སྐྱེར་བཅིངས་ན་༽འཛིན་པར་འགྱུར་རོ།༼འདི་དག་ཐམས་ཅད་སྔོན་དུ་བསྙེན་པ་སོང་པའི་ལས༽ ༼གཞན་ཡང་༽བ་གླང་གི་སྤུ་ལས་སྲད་བུ་བྱས་ལ། ༼ལས་སྦྱོར་དུས་སུ་༽ལན་བརྒྱད་བརྒྱ་བཟླས་བརྗོད་བྱས་ཏེ་མགུལ་དུ་བཅིངས་ན་བ་གླང་དུ་འགྱུར་རོ། གང་དང་གང་རྐང་བ་བཞི་བ་དེའི་༼སྤུ་ལས་༽སྲད་བུ་བྱས་ལ། ༼ཙཀྲ་དང་ལྡན་པས་་་སྤེལ་ཚིག་དང་བཅས་པས་འདི་དག་གི་རྒྱུས་པ་ལ་སྔགས་བཟླས་ཏེ་མགུལ་དུ་བཏགས་པའི་སྦྱོར་བས་༽མངོན་པར་བསྔགས་པས་མགུལ་དུ་བཏགས་ན་དེ་དང་དེའི་༼དུད་འགྲོ་རྐང་༤་བའི་༽གཟུགས་སུ་འགྱུར་རོ། ༼སྤེལ་ཚིག་དང་བཅས་པས་སྲད་བུ་བཀྲོལ་ན་༽བཀྲོལ་ན་ཐར་བར་༼རྗེས་བཟུང་༽འགྱུར་རོ། ༼༡་བུར་གང་ལ་སརྦ་བུ་ཊ་ལ་སོགས་པ་སྤེལ་ཚིག་དང་བཅས་པ་༽འབྲུ་ལ་བཟླས་ནས་ནོར་གྱི་བདག་པོའི་ཁྱིམ་དུ་བཅུག་ན། ༼བཟླས་པའི་འབྲུ་ཡང་ན་འབྲུ་དེ་ཕྱེད་བསྒྲུབ་བྱའི་སྣོད་དུ་བླུགས་ཕྱེད་རང་གི་སྣོད་དུ་བླུགས་༽ལྷག་མས་བདག་ཉིད་༼སྤྱི་བོར་བླུགས་ན་༽དབང་བསྐུར་ན། ༼དེ་ནས་ཡང་༽མཚན་མོ་བདུན་གྱིས་འབྲུ་ཐམས་ཅད་༼རང་གི་ཁྱིམ་དུ་༽འགུགས་པར་འགྱུར་རོ། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་མཁའ་འགྲོ་མའི་སྔགས་ཀྱི་ལས་ཐམས་ཅད་པའི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་བདུན་བའོ། །༼འཚམས་སྦྱར་བའི་སྒོ་ནས་སྔར་བཤད་པའི་ལས་ཀྱི་ཚོགས་ཀྱི་སྔགས་དངོས་བཤད་དངོས་འདི་ཡང་ཉེ་སྙིང་གི་ལས་ཡིན་༽།དེ་ནས་གཞན་ཡང་བཤད་བྱ་བ། །མཁའ་འགྲོ་ཀུན་༼སུམ་ཅུ་བདུན་༽གྱི་བདེ་བའི་མཆོག་༼གི༽ །༼ཉེ་སྙིང་༽སྙིང་པོ་རྣལ་འབྱོར་མ་ཀུན་གྱི། །འདོད་པའི་ལས་ཀུན་༼ལེའུ་༤་བཅུ་བདུན་པར་བསྟན་པ་རྣམས་༽བསྒྲུབ་པ་པོ། །༼སྔགས་ཀྱི་ཆེ་བ་༽གང་ཞིག་༼དབང་པོ་རབ་ཀྱིས་སྦྱི་བསྲེག་ལ་སོགས་པ་རྫས་ཀྱི་སྦྱོར་བ་ཅུང་ཟད་ལ་བརྟེན་དེ་༽དྲན་པ་ཙམ་གྱིས་ནི། །འཇིག་རྟེན་གསུམ་པོ་གཡོ་བྱེད་ཅིང་། །རྗེས་སུ་དྲན་པ་ཙམ་གྱིས་ཀྱང་། །༼མི་བསླུ་བས་༽ཡང་དག་དངོས་གྲུབ་༼རྣམས་༽རིམ་གྱིས་གོེར། །༼ཨོཾ་ནས་རིམ་པས་གློག་༽ཧཱ་སྭཱ་ཊཕ་ཧཱུཾ་ཧཱུཾ་ཡེ་ནི་རྞ་ཝ་ཛྲབ་ཡེ་ནི་ཀི་ཊཱ་དྷབུ་རྦས་ཨོཾ། །སྔགས་༼ཀྱི་ཆེ་བ་བསྟན་པ་དང་པོ་༽འདི་བཟླས་པས་འགྲུབ་པ་སྟེ། །ལས་༼དངོས་གྲུབ་༣་༽རྣམས་ཀུན་བྱེད་དགེ་བ་ཡིན། ༼བསྟན་པ༽ །མཁའ་འགྲོ་རྣལ་འབྱོར་མ་༼བཤད་པ་༽རྣམས་དང་། ༼སོ་སོར་བཤད་པ་༽ །ཁཎྜ་རོ་ཧ་ལཱ་མ་༼བསྡུས་པ་༽སོགས། ༼སུམ་བཅུ་རྩ་བདུན་༽ །མཁའ་འགྲོ་མ་ནི་ཐམས་ཅད་ཀྱི། །༼འདི་བཟླས་པས་ཐམས་ཅད་བཟླས་པར་༏གྱུར་བས་༽སྔགས་ནི་འདི་ཉིད་ཡིན་པར་བཤད། །༼འཇིག་རྟེན་གྱི་ཁམས་༽ས་འོག་ཡང་ན་མཐོ་རིས་སམ། །དེ་བཞིན་མི་ཡུལ་དག་ཏུ་ཡང་། །ལས་ནི་གང་དག་ཡོད་པ་༼༢་གྲགས་པ་༽རྣམས། །ཀླགས་པས་དེ་དག་ཐམས་ཅད་༼ཆེ་བ་འགྲུབ་ངེས་པ་ལ་དགོངས་༽འགྲུབ། །༼ཉེ་སྙིང་༽འདི་ལས་ཤིན་ཏུ་མཆོག་གྱུར་གང་། །འཇིག་རྟེན་གསུམ་ན་༼སྔགས་༽ཅིའང་མེད། །གང་ཕྱིར་༼འགྲུབ་པ་ཉེ་བའི་༽འདི་ནི་༼༢་༢་པ་༽བླ་མེད་པ། །ལས་རྣམས་ཐམས་ཅད་སྒྲུབ་བྱེད་ཡིན། །མཁའ་འགྲོ་མ་ནི་ཀུན་གྱི་གནས་༼ཀྱང་ཡིན་པས་༽། །མདོ༼ར་བསྡུ་ན༽་བཤད་༼འདི་དངོས་གྲུབ་ཐམས་ཅད་འགྲུབ་པ་༽རྒྱས་པར་མ་ཡིན་ནོ།༼འདིས་དང་པོ་གནས་བསྟན་༽ །མེ་ཏོག་འབྲས་བུ་སྣ་ཚོགས་ཀྱི༼ས་བརྒྱན་པ་༽། །རི་བོ་བཟང་པོ་བི་བར་བ་༼ནག་པོ་མངོན་རྟོགས་ལྟར་རམ་ལུའི་པའི་འགྲེལ་བ་ལྟར་རམ་ཀླུའི་པའི་རྩ་རྐྱང་ལྟར་བསྒོམ་སྟེ་ཀླུའི་པ་རྩ་རྐྱང་ལྟར་བསྒོམ་ན་ཚངས་པའི་གནས་༤་ནས་འབྱུང་པ་རིམ་བརྩེག་གི་བར་བསྒོམས་ལ་དེ་ནས་རྩ་་་་་པར་ལས་བསྟན་འདིར་སྔགས་ལ་སོགས་པ་བསྟན༽ །༼  ༢་པ་དངོས་གྲུབ་དེ་དག་ཀྱང་བསྐྱེད་པའི་རིམ་པ་ལ་གནས་པས་་་འགྲུབ་པས་བསྐྱེད་པའི་རིམ་པ་བསྟན་ ་ཞལ་༤་དང་འབྲེལ་བའི་ཐོད་པ་བཞི་༽༼བསྒྲུབ་པ་པོ་ལ་གནས་པ་༽ །དེ་ཡི་སྟེང་དུ་རྟག་བསྒོམ་པ། ༼བསྒོམ་བྱའི་ལྷ་བསྟན་ཏེ་ཕྱིའི་དལ་དང་ལུས་ཀྱི་༢་ཀ་ཐུན་མོང་དུ་བསྟན་༽ །མཁའ་འགྲོ་༼གཙོ་བོས་་་་་དང་སྒོ་འཚ་་་་་་་མ་གོང་དུ་་་་་ཟིན་ནས་༽དེ་བཞིན་ལཱ་མ་དང་། །ཁཎྜ་རོ་ཧ་རྣལ་འབྱོར་མ་༼གཟུགས་ཅན་མ༽། །༼གཙོ་བོ་ཧེ་རུ་ཀ་༽དཔའ་བོ་རྣམས་ཀྱི་དཔའ་བོ་མཆོག ༼འདི་འཚམས་ཀྱི་ཐོད་པ་༽ །ཧ་ཧ་ཧོ་ཧོ་ཞེས་བྱ་བ་༼དེ་ཚོས་བདེ་ཆེན༽། །དཔའ་བོ་ཉི་ཤུ་རྩ་བཞི་ཡི། །མཁའ་འགྲོའི་དྲ་བ་བདེ་མཆོག་ཡིན། །༼ལྷ་རྣམས་བཟློག་ཏེ་དགོད་པ་བསྟན་གནས་རྣམས་ཀྱང་བཟློག་པར་འདོད་༽རྡོ་རྗེ་སེམས་དཔའ་རྣམ་སྣང་མཛད། །དེ་བཞིན་པད་མ་གར་དབང་དང་། །ཤྲཱི་ཧེ་རུ་ཀ་ཉིད་དང་ནི། །ནམ་མཁའི་མཁའ་སྙིང་དང་ནི་རྟ་མགྲིན་ཉིད། །རིན་ཆེན་རྡོ་རྗེ་སྟོབས་པོ་ཆེ༼དེ་མན་ཆད་སྐུའི་བརྒྱད་དོ༽། །མིག་མི་བཟང་དང་འཇིགས་བྱེད་༼ཆེན་པོ་༽དང་། །རྡོ་རྗེ་བཟང་༼པོ་༽དང་རབ་༼ཏུ་༽བཟང་༼པོ་༽དང་། །རྡོ་རྗེ་ཧཱུཾ་མཛད་དཔའ་ཆེན་པོ། །དེ་བཞིན་རྡོ་རྗེ་རལ་བ་ཅན། །༼དེ་ཡན་ཆད་གསུང་གི་བརྒྱད་དོ་༽མྱུ་གུ་ཅན་དང་རྡོ་རྗེའི་ལུས། །རྡོ་རྗེའི་འདི་ནི་ཉིད་དག་དང་། །འོད་དཔག་མེད་༼པ་༽དང་ལྷ་ཡི་སྒྲ། །དེ་བཞིན་མཆེ་བ་རྣམ་གཙིགས་དང་། །ཀེང་རུས་ཀེང་རུས་ཆེན་པོ་དང་། །ཐོད་པའི་དུམ་བུ་༼དེ་ཡན་ཆད་ཐུགས་ཀྱི་བརྒྱད་༽ལ་སོགས་པ་༼ཡུལ་ཨུ་པ་སི་ལ་པ་ལ་སོགས་པ་དང་སྒོ་འཚམས་མ་བརྒྱད་བསྡུའོ༽། །དཔའ་བོ་ཉི་ཤུ་རྩ་བཞི་ཡིས། །འགྲོ་བ་འདི་དག་ཐམས་ཅད་ཁྱབ། །དཔའ་བོ་རྣམས་དང་མཁའ་འགྲོ་ཉིད། ༼ཤུགས་ཀྱིས་བསྟན་པ་སྟེ་གོ་རིམ་མ་བཟློག་པར་བསྟན༽ །རྣམ་འབྱོར་མ་ནི་རབ་༼ཏུ་༽གཏུམ་༼མོ་ལ་༽སོགས་༼པ་༣་ཀ༽ །༼བྱ་བ་ཟེར་༽ །ལུས་༼ཀྱི་དཀྱིལ་འཁོར་བསྟན་༽རྣམས་ཀུན་ལ་བསྒྲུབ་པ་པོས། ༼ལུས་ལ་གནས་པ་ལྟར་བསྒོམ་དགོས་པས་༽ །འཁོར་ལོར་ཞུགས་པར་བལྟ་བར་བྱ། ༼རྩེ་༡་པའི་ཡིད་ཀྱིས་ཉམས་རྗེས་མེད་ཐུན་དཔྱད་པ་མེད་པ་༽ །གྲུབ་དོན་ཤིན་ཏུ་མཉམ་བཞག་པས། ༼ཧེ་བཛྲའོ་ལྷ་སུམ་ཅུ་རྩ་བདུན་རྫོགས་པ་༽ །འཁོར་ལོའི་བདག་ཉིད་རྟག་ཏུ་བསྒོམ། །སྔར་བཤད་པ་ཡི་ཆོ་ག་ཡིས་༼ལྷར་བསྐྱེད་པ་ནས་ལེའུ་དང་པོར་སྒྲ་ཚུལ་ལས་བྱུང་གིས་༽། །མཁའ་འགྲོ་དྲ་བ་བདེ་མཆོག་མཆོད་མངལ་སྐྱེས་དང་བསྟན་སྔགས་ཀྱི་མཆོད་པ་འཕྲོ་བ་སྔར་བཤད་པས་ཀྱང་གསུངས།༼དཀྱིལ་འཁོར་ཆེན་པོ་ཅིའི་ཕྱིར་མཆོད་ཞེ་ན་༽ །འཁོར་ལོ་༼ལྷ་རྫོགས་པ་ལ་དངོས་གྲུབ་༽ཆེན་པོ་གྲུབ་ཀུན་གནས་༼སྔགས་སྐྱེས་ཞིང་སྐྱེས་ལྷན་༡་ཏུ་གནས་ ལ་ལྷ་རྐྱང་པ་ལ་ལས་༡་ཚར་བ་རེ་རེ་ཙམ་ལས་མི་གནས་པས་དལ་ཆེན་པོ་བསྒོམ་ཞིང་མཆོད་པའོ༽། །༼རྒྱས་པ་༽འདི་ནི་སངས་རྒྱས་བྱེ་བ་དང་། །དཔའ་བོ་བྱེ་བས་རབ་ཏུ་གསུངས། ༼ལྷ་ཚངས་པས་ལས་གྲུབ་པར་བསྟན་པའོ་༡་པས་ལས་མ་གྲུབ་པར་བསྟན་སུམ་བཅུ་རྩ་བདུན་ཚང་བར་བསྒོམ་ན་་ལྷ་སུམ་བཅུ་བདུན་གྱིས་བྱིན་གྱིས་བརླབས་པར་མ་ཟད་༽ །མཁའ་འགྲོ་མ་ནི་རེ་རེ་ཡི། །འཁོར་ནི་བྱེ་བ་དག་ཏུ་འགྱུར༼བས་ཀྱང་བྱིན་གྱིས་བརློབ༽ ། ༼མཁའ་འགྲོ་མ་རང་ནང་དག་ཡིན་ཞེ་ན་༽ །རྣལ་འབྱོར་མ་ནི་མཁའ་འགྲོ་ཉིད། །གཟུགས་ཅན་མ་དང་དུམ་སྐྱེས་མ། །དེ་བཞིན་ལཱ་མ་ལ་སོགས་ནི། ༼དེ་དག་གིས་བྱིན་གྱིས་བརླབ་པོ་༽ །དངོས་གྲུབ་ཀུན་བྱེད་༼ཐམས་ཅད་ཙང་པས་༽དགེ་བ་ཡིན། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་དཔའ་བོ་དང་མཁའ་འགྲོ་མའི་གནས་ཀྱི་གསང་བའི་༼ལུས་ཀྱི་དལ་གཙོ་༽དཀྱིལ་འཁོར་༼ཆེན་པོའི་༽གྱི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་བརྒྱད་པའོ།། །དེ་ནས་༼ལེའུ་བཅུ་༡་པས་སྐྱེ་བ་བདུན་པའི་མཚན་ཉིད་ལ་སོགས་པ་མདོར་བསྟན་བཅུ་༤་པས་རྒྱས་པར་བཤད་འདིར་མིའམ་ཕྱུགས་ཀྱི་སྐྱེ་བ་བདུན་པ་བསྒྲུབ་པ་སོ་སོར་བཤད་༽གཞན་ཡང་བཤད་བྱ་བ། ༼འོག་ནས་འབྱུང་བ་༽ །ཕྱུགས་ལས་དེ་བཞིན་ཆོ་ག་སྟེ། ༼སྐྱེ་བ་བདུན་པ་༽ །གང་ཞིག་༼མེ་ལོང་ལས་སྐྱེ་བ་གང་ཡིན་པའི་རྣམ་པ་འཆར་ དེ་ཉིད་ལ་བརྟེན་ནས་སྐྱེ་བ་བདུན་པ་བསྒྲུབ་པ་བསྟན་སྐྱེ་བ་བདུན་པའི་བར་གསུང་༽ཤེས་པ་ཙམ་གྱིས་ནི།༼ མིའི་གཙོ་བོ་ཕྱུགས་ཀྱི་་་་་་་ ད་བྱས་ལ་དེ་ལ་བསྙེན་བསྐུར་བྱ་བས་ལུས་དོར་བཟོས་པ་ལ་སོགས་པའོ༽ །མྱུར་དུ་དངོས་གྲུབ་ཐོབ་འགྱུར་བའི༼་ལྷའི་ལུས་སུ་འགྱུར་བ་ལ་སོགས་པའི་་་་དེ་དག་གིས་སྤྱིར་མདོར་བསྟན༽ ། ༼དེ་ནས་དཔྲལ་བར་༽ །ས་ལུ་༼བསྒྲུབ་པའི་ཚུལ་རྒྱས་པར་བཤད༽བཏགས་པ་སྔགས་པ་ཡིས། ༼བོང་བུ་༽ །ཕྱུགས་ཀྱི་གཟུགས་བྱས་༼པས་༽རིམ་༼པ་༽ཇི་བཞིན། ༼འདི་དག་གིས་སྐྱེ་བ་བདུན་པ་མཐོང་ངོ་༽ །རུས་སྦལ་རྔ་མོ་ཕག་དང་ཝ། །ཁྭ་དང་འུག་པ་བྱ་རྒོད་དང་། །ཁྲུང་ཁྲུང་ཁྭ་དང་ས་ར་ས་༼བཞད་ཆེན་པོ་༽། །དེ་རྣམས་ལས་༼སྐྱེ་བ་བདུན་པ་གང་ཡིན་པ་བརྟག་པ་༽ནི་བཤད་བྱ་སྟེ། །དེ་ཡི་མཚན་ཉིད་བསྟན་པར་བྱ༼   ༽ ། ༼སྐྱེ་བ་གཅིག་ལས་མེ་ལོང་གི་ནང་དུ་་་རུས་པ་༡་འབྱུང་༢་པ་ལ་སོགས་པ་འགྲོ་༽ །སྐྱེ་བ་གཅིག་དང་སྐྱེ་བ་གཉིས། །གསུམ་དང་བཞི་དང་ལྔ་ཉིད་སྟེ། ༼དེ་ཡན་ཆད་མཆོད་པ་ཙམ་ལས་ནུས་པ་མེད་༽ །སྐྱེ་བ་དྲུག་དང་བདུན་དུ་ཡང་། ༼མེ་ལོང་ལ་གཟུགས་བརྙན་དུ་བྱུང་པ་སྟེ་༽ །སྐྱེ་བ་བརྒྱུད་པར་༼བར་མ་ཆད་པའོ༽གདོན་མི་ཟ༼འདི་ཡན་ཆད་བྱོལ་སོང་གི་སྐྱེ་བ་བདུན་པ་བསྒྲུབ་པའོ༽ ། ༼གཞན་ཡང་དུད་འགྲོ་ཡིན་ན་ཁ་༡་རྫས་སྦྱོར་བའི་དགོས་པ་༽ །གང་གི་༼སྐྱེ་བ་བདུན་པའི་མཚན་ཉིད་༽ཁ་ཡི་དྲི་ཞིམ་ཞིང་། ༼དེ་དག་གི་རྗེས་སུ་འབྲངས་ནས་ལུས་འདོད་གཞན་གྱི་བྱེད་ཙུགས་ཀྱི་བར་དུ་༽ །མིག་མི་འཛུམས་པར་རྣམ་པར་བལྟ། །བདེན་པར་སྨྲ་ཞིང་༼གཞན་གྱིས་དེ་༽མཐོང་ན་དགའ། །རྟག་ཏུ་དམ་ཆོས་༼དད་པ་ཆེ་བས་༽དགའ་འགྱུར་ཞིང་། །༼སྔར་གྱི་༽རང་གི་སྐྱེ་བ་ཤེས་པ་དང་། ༼རྔུལ་ལ་༽ །ལུས་ཀྱི་དྲི་ནི་རྟག་ཏུ་ཞིམ། །མཚན་ཉིད་འདི་དང་ལྡན་པ་ནི། །སྐྱེ་བ་བདུན་དུ་འབྱུང་བ་ཡིན། ༼ཞི་བར་འདོད་ན་ཚན་དན་དཀར་པོ་དང་བསྲེགས་ལ་སྦྱང་བ་རང་འབར་བ་དང་རྟོགས་པར་བྱས་པས་དུག་མེད་པར་བྱས་ཏེ་བཟས་གསུང་།དབང་ལས་ལ་སོགས་པ་ཡང་བསྒྲེས་དེ་ལ་གུར་ སུམ་རྒྱས་གྷི་ཝཾ་དང་སྐེ་ཚེ་སྲེག་པར་བྱའོ་འདོད་འདིར་ཡང་སྔོན་དུ་བསྙེན་པ་སོང་པས་དེ་ནས་ཡུམ་གྱི་ཉེ་སྙིང་གི་འཁོར་ལོ་བྲིས་ལ་ཙཀྲའི་ལྟེ་བ་ལ་མི་འམ་ཕྱུགས་ཀྱི་སྐྱེ་བ་བདུན་གང་རྡོག་པར་འདོད་པ་དེ་བྲིས་བར་གྱིས་བྲིས་པ་སྤེལ་ཚིག་དང་བཅས་པ་བྲིས་ལ་རབ་གནས་ལ་སོགས་པ་བྱས་ལ་འབྲས་ཟན་ལ་བོང་བུའི་རྒྱུ་བ་བྱས་ལ་དེའི་སྙིང་ཀར་ཙཀྲ་བཅུག་ལ་བསྒྲུབ་པ་པོ་ཡང་ནང་དུ་ཞུགས་ཏེ་སྐྱེ་བ་བདུན་གྱི་མེ་ལོང་ལ་མི་ཚིལ་ལསོགས་པས་ཕྱིས་ཏེ་སྦྱང་ལ་ལྟས་ན་སྐྱེ་བ་དུ་བླངས་པ་དེའི་གཟུགས་་་་་་མཐོང་བ་འོང་ངོ༽ །དེ་ནི་ཟོས་པ་ཙམ་གྱིས་ནི༼་དེ་ལྟར་ཤེས་ནས་དེ་ལ་བསྙེན་བསྐུར་བྱས་པས་དེ་མངོན་ཤེས་ཅན་་་་་་་་༢༨་་་ ་ཡིན་པས་ལུས་འདོར་གསུང་། འབའ་དན་ཏ་འཕོ་བའི་སྦྱོར་བ་བྱ་དགོས་གསུང་༽། །༼གཞན་ལྟར་༽ལྷ་ཡི་གཟུགས་ནི་འཛིན་པར་འགྱུར། །༼དེའི་ཤའམ་གོ་རོ་ཙ་ན་༽བསྣམས་པའམ་རེག་པ་ཙམ་གྱིས་ནི། །༼གོ་རོ་ཙ་ན་༽གང་ཞིག་༼མ་ཟོས་པར་༽ཐིག་ལེ་བྱས་པ་དེ། །མོད་ལ་༼མཁའ་ལ་སྤྱོད་༽འགྲུབ་པར་འགྱུར་བ་སྟེ། །༼གང་འགྲུབ་ན་༽འདི་ནི་༼དུད་འགྲོ་གང་འདོད་པའི་༽རང་དགའི་གཟུགས་འཆང་འགྱུར།༼ བཟའ་བར་མ་ཟད་ཐིག་ལེའི་སྦྱོར་བས་དང་སི་ཏི་འགྲུབ་༽ །དེ་ཡི་སྙིང་ཁའི་༼ ་་གི་ཝང་གི་བྱེ་བྲག་༽རོ་ཙ་ན་༼དབུས་ན་གོ་རོ་ཙ་ན་སེར་པོ་མཐོ་བ་ཙམ་ཡོད་པ་དེ་༽ ། ༼གོང་གི་སྐྱེ་བ་བདུན་པ་རྟོགས་པར་ལ་༽ །མཁས་པ་ཡིས་ནི་བསླངས་ནས་ནི། ༼སྤྱི་དོན་༢་པ་འཕོ་བ་བྱེད་ན་མི་ལ་གདན་དང་པའམ་སཾ་བུ་ཏ་༤ན་དུད་འགྲོ་ཡིན་ན་་་་་བི་ད་ན་བཞིན་ནོ་དེ་དག་ཁ་བསྐང་ངོ། ༢་པ་ལྟར་་་་་་་་་་་དུད་འགྲོ་གང་ཡིན་གྱི་རུས་པ་བྱས་ལ་སྔར་གྱི་སྤེལ་ཚིག་ཅན་གྱི་ཙཀྲ་སྙིང་ཁར་བཅུག་ལ་བདག་གིས་སྔར་བཟླས་པའི་སྙིང་པོ་ག་ནས་་་་་་་་་ ་་་་་༢༨་་་སྙིང་ཀར་ཙཀྲ་ལ་བཞུག་དེའི་འོད་ཀྱི་སྐྱེ་བ་བདུན་གྱི་རྣམ་ཤེས་ཧཱུཾ་གི་རྣམ་པར་བླངས་ལ་གཟུགས་བསྙན་ལ་བཞུག་གོ་༽ །སྙིང་པོའི་སྔགས་ནི་བཟླས་ནས་སུ༼ལག་གི་ རྒྱུ་བར་བྱ་བར་འདོད་པ་དེར་གྱུར་༡་པ་བཏགས་ནས་༽། །དེ་ཡི་༼དཔྲལ་བར་༽ཐིག་ལེ་བྱ་བ་ཡིན། །སེམས་ཅན་གང་དང་གང་གི་ནི། ༼བདུན་པའི་ཤ་རུས་པ་ལྤགས་པ་སེན་མོ་ལྔ་༽ །གཟུགས་སུ་བྱེད་པར་འདོད་པ་ན། །དེ་དང་དེ་ཡི་གཟུགས་སུ་ནི། །༼འདོད་པ་ཙམ་གྱིས་༽ཐིག་ལེས་༼ཐིག་ལེ་བྱས་པ་ཙམ་གྱིས་༽འགྱུར་བར་ཐེ་ཚོམ་མེད། །མཁས་པས་༼ཡོངས་འདུ་བྱ་བ་མེ་ཏོག་དམར་པོ་ཡོད་༽ཤིང་ལོའི་ཁུ་བ་ནི། །རོ་ཙ་ནར་༼དང་༽བཅས་༼པ་༽བླངས་ནས་སུ། །དཔྲལ་བར་ཐིག་ལེ་བྱས་ནས་ནི། །༼འབྲིང་གི་༽དེ་གཟུགས་འཛིན་པར་ཐེ་ཚོམ་མེད། ༼གཞན་ཡང་༽ །ཕྱུགས་ཉིད་ཀྱི་ནི་བ་སྤུ་དག་༼དང་སྐྱེ་བ་བདུན་པའི་གོ་རོ་ཙ་ན་བསྲེས་ཏེ་དེ་ལས་ཐག་པ་བྱས་ཏེ་༽ །ལག་པའམ་སྤྱི་བོར་བཅིང་བར་བྱ་༼དེས་ཀྱང་འདོད་པའི་རྒྱུ་བ་འཛིན་པར་འགྱུར་རོ༽། །དེ་ཡི་ཡན་ལག་ལྔ་ལྡན་ཅིང་། ༼གང་གི་རྒྱུ་བཔར་བྱེད་པར་འདོད་པའི་ཕྱུགས་ཀྱི་སྤུ་ལ་ཐ་གུ་བྱས་པ་༽ །དེ་ཡི་སྤུ་དང་རྣམ་བསྲེས་ལ། །ལག་དང་སྤྱི་བོར་བཅིངས་ནས་ནི། ༼སྐུད་པ་གང་བྱས་དེའི་༽ །དེ་ཡི་གཟུགས་འགྱུར་ཐེ་ཚོམ་མེད། ༼བསྒྲུབ་པའི་ཛོ་གའམ་བསྟན་ཏེ་གང་རུང་རུང་གིས་མི་འགྲུབ་མཆོག་གིས་འགྲུབ་པའོ་༽ །རྣལ་འབྱོར་པ་ནི་༼ཡུམ་གྱི་ཉེ་སྙིང་༽བསྒོམ་ཞིང་བཟློས། ༼ལྷའི་རྣལ་འབྱོར་འཁོར་ལོ་རྒྱས་པ་ཡང་ན་དེ་བསྒྲལ་བར་༽ །མི་རྣམས་ནུས་པར་༼སྐྱེ་བ་བདུན་པ་བརྟག་པ་༽ལྡན་ཡིན་ཡང་། ༼དེ་བསྒྲལ་བ་ལ་སོགས་པ་༽ །དཀའ་ཞིང་སྡིག་ལ་མངོན་དགའ་རྣམས།༼༢༨་འདིའི་ངོ་ནས་རྟགས་གཉིས་རྟགས་ཅན་ལ་བསྒྱར་ས་མ་རྙེད་༽ །དངོས་གྲུབ་ལམ་ནི་འགོག་པ་ཡིན། །གླང་པོ་རྟ་དང་བོང་བུ་དང་། །རུས་སྦལ་རྔ་མོ་ཕག་དང་ཝ། །ཁྭ་དང་འུག་པ་བྱ་རྒོད་དང་། །ཁྲུང་ཁྲུང་ཁྲ་དང་ས་ར་ས་༼བཞད་ཆེན་པོ༽ ། ༼དེ་ལྟ་བུའི་༽ །གཟུགས་བཟང་བ་དང་གཟུགས་ངན་པ་༼རྣམས་ཀྱང་༽ ། ༼མཁའ་སྤྱོད་ལ་སོགས་པར་འགྱུར་ནུས་གསུང་༽ །ལྷ་ཡི་གཟུགས་སུ་དེ་འགྱུར་རོ། ༼དེའི་ཟ་བ་ལ་སོགས་པ་༽ །རྣལ་འབྱོར་དཔའ་ཆེན་རང་དགའི་༼གང་འདོད་པར་༽གཟུགས་༼སུ༽། །༼འདི་ཉིད་ལ་༽སྐྱེ་འགྱུར་དེ་ནི་ཐེ་ཚོམ་མེད། ༼ཐབས་༽ །དེ་ལས་ཤིན་ཏུ་མཆོག་གྱུར་བ། །༼དམན་པ་དང་འབྲིང་ལ་དད་ན་དེ་ལས་༽འཇིག་རྟེན་གསུམ་ན་ཡོད་མ་ཡིན། དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་སྐྱེ་བ་བདུན་དུ་བསྒྲུབ་པར་བྱ་བའི་གཟུགས་ཡོངས་སུ་བརྗེ་བའི་ཆོ་གའི་ལེའུ་སྟེ་བཞི་བཅུ་རྩ་དགུ་པའོ། །༼དེ་ལྟར་ལེའུ་གསུམ་གྱིས་སྐྱེ་བ་བདུན་པ་བསྟན་༽ །༼འདི་རྗེ་བཙུན་མའི་སྙིང་པོས་ལས་བསྒྲུབ་པས་འབྲ་བུའི་གསང་པ་ལ་་་  སྐྱེ་བ་བདུན་པའི་ཕན་ཡོན་ནི་དུད་འགྲོ་རྣམས་ཀྱིས་མི་སྐྱེ་བ་བདུན་གྱི་ཤ་ཟོས་ན་མཁའ་སྤྱོད་ལ་སོགས་པར་ལྷའི་ལུས་དང་འདྲ་བར་འགྱུར་བ་ལ་སོགས་པའོ། དེས་ན་གོང་གི་རུས་པ་ལ་ཅེས་པ་སོགས་ཀྱང་དོན་འདི་ལ་དགོངས་ཀྱི་དུད་འགྲོ་སྐྱེ་བ་བདུན་པ་བརྟག་པ་མིན་ནམ་སེམས་གསུང་༽དེ་ནས་སྦྱིན་བསྲེག་ཆོ་ག་ནི། །ངེས་པར་༼མཚོན་པ་༽དབང་དུ་བྱེད་འགྱུར་བ། ༼སྐུ་གསུམ་གྱི་དལ་རྒྱས་པའམ་ཨ་བི་ད་ན་ལས་བྱུང་བ་ལྟར་ཡི་གེ་༣་པའི་བསྐྱེད་རིམས་སྔོན་དུ་སོང་པས་བསྲེག་རྫས་་་འཇུག་པ་བསྟན་༽ །༼བཛྲ་བེ་རོ་ཙ་ན་བསྙེན་པ་རསཙཀྲ་དང་བཅས་པ་སྔོན་དུ་སོང་པས་སྦྱིན་བསྲེག་སོགས་བྱའོ་༽གང་ཞིག་ཤེས་པ་༼ཆེ་བ་༽ཙམ་གྱིས་༼འཁོར་ལོ་རྒྱས་པའི་རྣལ་འབྱོར་༽ནི། །མྱུར་དུ་༼དབང་༽དངོས་གྲུབ་ཐོབ་འགྱུར་བཤད། །༼སྔོན་དུ་བསྙེན་པ་སོང་པས་ཡི་གེ་བཅུ་༣་པའི་འཁོར་ལོ་ཇི་ལྟ་༤ན་བྲིས་ཏེ་རབ་གན་ལ་སོགས་པ་བྱས་ཏེ་དེ་དང་ལྡན་བས་ལག་པའི་སྦྱིན་བསྲེག་བྱ་་ བ་ལང་ཤ་༽༼སྔོན་དུ་བསྙེན་པ་སོང་པས་ཡི་གེ་བཅུ་༣་པའི་འཁོར་ལོ་ཇི་ལྟ་༤ན་བྲིས་ཏེ་རབ་གནས་ལ་སོགས་བྱས་ཏེ་དེ་དང་ལྡན་པས་ལག་པའི་སྦྱིན་བསྲེག་བྱ་༽གོ་མཾ་ས་དང་མྱོས་བྱེད་བསྲེ། །ལག་པ་གཡོན་པས་སྦྱིན་བསྲེག་བྱ། ༼འདི་རྣམས་འགྲུབ་ངེས་པ་༽ །སངས་རྒྱས་ཀྱང་ནི་༼མཚོན་པ་ཙམ་༽དབང་འགྱུར་ན། །ཕྲན་ཚེགས་མི་ནི་སྨོས་ཅི་དགོས། །༼ཤ་ལྔ་བཅུད་ལོན་ལྔ་ པ་པར་ཟོས་ནས་༽སྐྱུགས་པ་༼དང་༽སོ་ཤིང་༼བྲུད་ནས་༽དོར་བ་དང་། ༼ བག་ཟན་གྱི་དྲི་མ་བྲལ་བ་༽ །དེ་བཞིན་རང་གི་ལུས་མཉེས་པ། །༼བསྒྲུབ་བྱའི་༽མིང་༼དང་༽ནི་མྱོས་བྱེད་༼ཆང་རྫས་ལྔ་༽བཏགས་བསྲེས་པས། །ཁམས་གསུམ་དག་ནི་༼གང་འདོད་པ་རྣམས་༽དབང་དུ་འགྱུར། ༼གཞན་ཡང་༽ །ཟླ་མཚན་གྱི་ནི་ཁྲག་དང་ནི། །༼སྔར་གྱི་རྫས་བཅུ་བོ་༽ཟོས་ནས་ཟློན་པའི་ཟས་དག་དང་། །༼གང་རུང་གི་༽མི་ཡི་སྐྲ་དང་༼ཕྱེ་མ་བྱས་པ་༽ལྡན་པ་ཡིས། །༼གང་འདོད་༽མོད་ལ་༼སྦྱིན་བསྲེག་བྱས་པས་༽འགུགས་པར་འགྱུར་བ་ཡིན། །༼བག་ཟན་གྱི་དྲི་མ་བྲིལ་བ་སྔ་དང་འདྲ་༽རང་གི་ལུས་བྱུང་སྐྱུགས་པ་དང་༼གཞན་ཡང་དབྱེ་བ་༽། །མཁས་པས་རང་གི་སྐྲ་༼ཕྱེ་མར་བྱས་པ་དང་༽དང་ནི། །ནིམ་པའི་ཤིང་༼གི་མེ་ལ་སྦྱིན་སྲེག་༽ལ་རབ་སྦྱོར་ན། ༼སྤེལ་ཚིག་དང་བཅས་པ་༽ །མོད་ལ་དབྱེ་བར་འགྱུར་བ་ཡིན། །༼གཞན་ཡང་བསྐྲད་པའི་ལྷའི་སྦྱོར་ལ་༽རབ་མཉམ་བཞག་པས་ད་དུའི༼འི་༽་མེར་༼ར་ལ་༽། །ཁྭ་ཡི་གཤོག་པས་༼དང་༽ཉུུངས་མར་ལ་༼པལ་ཀའི་མར་ཁུ་༽། །༼སྤེལ་ཚིག་དང་བཅས་པ་༽བསྲེས་པའི་སྦྱིན་བསྲེག་བྱས་གྱུར་ན། །འཕྲལ་དུ་འཆི་བའམ་སྐྲོད་པར་འགྱུར། ༼གཞན་ཡང་དག་༽ །གཉིད་ལོག་༼པའམ་༽མ་ལོག་༼པའི་༽ལངས་པའམ། །ཟས་ལ་སྤྱོད་སོགས་མེ་ཐུན་ནམ་༼སྙོམས་འཇུག་བྱེད་པ་༽། །སྔགས་པས་རྟག་ཏུ་ཟློས་བྱེད་དེ། ༼དབང་དུ་བྱ་བ་འགྲུབ་པ་ལ་བར་ཆད་༽ །དེ་ལ་བདུད་ནི་ཡོད་མ་ཡིན། ༼གཞན་ཡང་རྒྱས་པ་༽ །ལྕེ་སྦྱང་གི་ནི་བསྲེག་བླུགས་བྱ། ༼དེ་ལྟ་བུའི་ཐུན་གསུམ་༽ །ཡང་དག་སྦྱིན་བླུགས་བྱེད་པའི་མི། །དེ་ཡི་ཟླ་བ་གསུམ་རྗེས་ལ། །རིགས་ཀྱི་དབུལ་བ་འཇིག་པར་༼སྔར་བུ་མེད་པ་ལ་བུ་མང་པོ་འབྱུང་་༽འགྱུར། ༼གཞན་ཡང་༽ །ཤ་ཆེན་དག་གིས་ལ་ལ་ཞིག །༼ཆང་༽མྱོས་བྱེད་ལྡན་པ་སྦྱིན་བསྲེག་བྱེད། ༼ཐུན་རེ་ལ་གོང་མ་ཀུན་ལ་སྦྱར་གསུང་༽ །༼ སྔོན་དུ་བསྙེན་པ་སོང་པས་ཤ་ མེད་པར་ཆང་མ་ བསགས་པས་ནོ་མ་ཟླ་བ་དྲུག་བྱས་བར་མཁའ་སྤྱོད་དུ་འགྲོ་གསུང་༽ འདི་ཡང་ཀུན་ལ་སྦྱར་གསུང་༽་བརྒྱ་རྩ་བརྒྱད་ཀྱི་བར་དུ་ནི། །༼ཀུན་ལ་སྦྱར་༽བསྒྲུབ་པ་པོ་ནི་ཐུན་གསུམ་དུ༼དུ་བྱེད་༽། །མ་ལུས་ས་རྣམས་སྤྱོད་པ༼འི་མི་༽ནི། །ཟླ་བ་དྲུག་གིས་༼མཁའ་སྤྱོད་དུ་གཞན་ཡང་རྒྱས་པ་སྤེལ་ཚིག་དང་བཅས་པའི་སྦྱིན་སྲེག་གིས་༽དབང་དུ་འགྱུར། །དགེས་པར་གྱུར་ན་༼སྦྱིན་སྲེག་གི་མཉེས་ནས་༽མཁའ་འགྲོ་མ། །རྒྱལ་སྲིད་སྟེར་བར་གདོད་མི་ཟ། ༼ལས་དེ་ཐམས་ཅད་ལ་ལྷའི་རྣལ་འབྱོར་བསྒོམ་དགོས་པར་བསྟན་༽ །ལྷ་རྣམས་ཐམས་ཅད་བསྒོམས་ནས་ནི༼ དཔའ་བོ་༡་པས་མི་ཕན་པར་གསུང་༽ ། ༼སྔ་གྲོའམ་དགོངས་ཀ་ལྟ་བུ་༽ །ཐུན་གཉིས་བར་དུ་༼ཤ་ཆེན་དང་མྱོས་བྱེད་གྱིས་༽སྦྱིན་བསྲེག་བྱ། །རང་གི་ལུས་ནི་༼མ་ཤིའི་བར་༽དེ་ཉིད་ཀྱིས། །༼གོང་གི་ཤ་ཆེན་གྱི་ནོ་མ་ཟླ་བ་དྲུག་གི་༽མཁའ་ལ་སྤྱོད་པ་ཉིད་ཐོབ་འགྱུར། ༼གཞན་ཡང་༽ །གོ་མ་སྐྱ་དང་༼ལྕེ་སྤྱང་ཆང་༽མྱོས་བྱེད་ཀྱིས། །སྦྱིན་བསྲེག་ཕྱི་ནང་༼དང་༽བྱ་བ་༼བཟའ་བ་༽བྱས། །དེ་ཡི་ལག་ཏུ་མྱུར་འགྲུབ་སྟེ། །དངོས་གྲུབ་༼དབང་ལ་སོགས་པ་༽ཐམས་ཅད་དུ་༼སྔ་མ་ཐམས་ཅད་༽འགྱུར་བ། །སྔགས་ཀྱི་བཟླས་བརྗོད་མཚན་མོ་བཟླས༼གསང་བ་ཡིན་པས་ཡུམ་གྱི་་་་་་་ནས་ཕྱི་ནསྔ་གི་སྦྱིན་སྲེག་སྔར་ལྟར་བྱ་༽། །༼མཚན་གཅིག་གིས་༽ཡུལ་འཁོར་གཅིག་ནི་༼དབང་དུ་འགྱུར་༽འཇིག་པར་བྱེད། །དེ་ལྟར་ཉིན་རེ་༼སྔགས་བཟླས་པ་སྔོན་དུ་སོང་བས་སྦྱིན་སྲེག་བྱ་༽བྱས་ནས་ནི། །རྒྱལ་པོ་ཉིད་དུ་དེ་བྱེད་འགྱུར། །འདི་ལས་རབ་མཆོག་གཞན་དག་ནི། །འཇིག་རྟེན་གསུམ་ན་ཡོད་མ་ཡིན། །༼གཞན་ཡང་ཁྱད་པར་གྱི་ཆེ་བ་རྒྱུན་དུ་བཟླས་ན་ གནར་གཅོད་པའི་སྡུག་བསྔལ་ཉམས་སུ་མི་མྱོང་༽རྣལ་འབྱོར་ཆེན་པོ་རང་དགར་འཆི། །སྣ་ཚོགས་༼གང་འདོད་པ་འདི་དང་ཕ་རོལ་གཉིས་ཀ་ལ་༽གཟུགས་ནི་འཛིན་ཅིང་རོལ། །༼གཞན་ཡང་༽བིལ་བ་༼ཤིང་་་་་༽དེ་བཞིན་པ་ལ་ཤ༼འི་འབྲས་བུ་༽། །ཨུ་དུམ་བཱ་ར་ཉིད་དག་ནི་༼༣་གྱི་༽ ། ༼ཐབ་༡་ལ་ཐུན་ངེས་ཎ་པར་༽ །སྦྱིན་བསྲེག་འབུམ་བྱས་༼བསྲེག་ལུགས་༽མྱུར་དུ་ནི། །ནོར་གྱི་བདག་པོ་ཆེན་པོར་༼གནམ་ཐོ་སྲས་ལྟ་བུར་༽འགྱུར། ༼གཞན་ཡང་༽ །གོ་མཾ་ས་དང་མྱོས་བྱེད་༼བ་ལང་ཤ་དང་ཆང་༽བསྲེ། །རྒྱལ་སྲིད་འདོད་ཅིང་༼སྤེལ་ཚིག་དང་བཅས་པས་༽སྦྱིན་བསྲེག་བྱེད། །༼ཧེ་རུ་ཀ་༽རྣལ་འབྱོར་དབང་ཕྱུག་མཉེས་བྱས་ན། །དབུལ་པོ་ཉིད་དུ་ག་ལ་༼སྟེ་ཕྱུག་པོར་༽འགྱུར། ༼གཞན་ཡང་༽ །གོ་མཾ་ས་ནི་བསྲེགས་པའི་རྒྱུས། ༼གཅོ་གཡང་ཤ་འབའ་ཞིག་གིས་་བར་ཆད་མེད་པར་༽ །ཅི་བདེ་བ་ནི་༼ནོར་ལ་སོགས་པ་༽འགྲུབ་པར་འགྱུར། ༼ གཅོ་གཡང་ཤས་༽ །གོ་མཾ་ས་ཡི་སྦྱིན་བསྲེག་གིས། །མྱུར་དུ་ནོར་༼གྱི་༽བདག་༼པོ་གནམ་ཐོ་སྲས་དང་༽མཉམ་པར་འགྱུར། ༼དཀའ་ཐུབ་༽ །བརྟུལ་ཞུགས་གཙང་སྦྲ་མེད་ན་ཡང་། །༼བཟླས་བསྒོམ་གཉིས་ལ་གནས་ན་༽གནང་བས་དངོས་གྲུབ་༼མཆོག་གི་དངོས་གྲུབ་ཀྱང་༽ཐོབ་པར་འགྱུར། ༼གཞན་ཡང་དུར་བ་འབའ་ཞིག་བསྲེགས་ན་༽ །ལྷག་པའི་ཚེ་འགྱུར་གུ་༼འདི་མན་ཆད་དུད་འགྲོ་ཁ་འཆིང་ཡང་༽སྨན་དྷ། །༼ཡོད་༽མུད་ག་མ་ཤ་ཙ་ན་ཀ།༼རི་ལུ་ཁ་ཚ་༡་་་ན་ལེབ་་་་སྲན་ཆུང་༽ །སྦྲང་རྩིའི་རྩིགས་མ་༼རོ་ཁ་བ་༽སྐེ་ཚེ་དང་། ༼སྒྲེས་པོ་རྣམས་བ་ཤ་ཀའི་ལོ་མ་ཟེར་༽ །ཏ་མ་ལ་ཡི་འདབ་༼ལ་ལ་དུ་མ་གནམ་ལ་༤་ཕྱང་ཟེར་༽བླངས་ཏེ༼འདི་དག་གི་སྦྱིན་སྲེག་བྱས་ན་༽། །གང་ཞིག་༼དུད་འགྲོ་གདུག་པ་ཅན་གང་ཡང་རུང་བ་༽ཁ་ནི་འཆིང་བྱ་བ། །རྣལ་འབྱོར་ཅི་འདོད་གྱུར་བ་ཡི། །༼གང་གི་ཁ་འཆིང་བར་འདོད་པ་སྟེ་༽གང་དུ་དགའ་བ་དེར་འགྱུར་རོ། །༼དེ་ལྟ་བུའི་དངོས་གྲུབ་རྣམས་བསྒྲུབ་པ་ལ་འཁོར་ལོ་ཆེན་པོ་བསྐོར་དགོས་པས་ལྷ་རྣམས་ཀྱི་གནས་ཕྱི་ནང་གི་བཅུ་བསྟན་༽༼ ་་་་་གནས་ལ་སོགས་པ་བཅུའི་ལྷ་དགོད་པ་ཕྱིའི་རང་ལུས་ཀྱི་གཉིས་ཐུན་མོང་དུ་བསྟན་ལ་དེས་ས་བཅུ་ཐོབ་པར་འགྱུར་བའོ་༽དེ་ནས་གཞན་ཡང་བཤད་བྱ་བ། །གནས་༼ས་བཅུ་ལ་༽ལ་སོགས་པའི་རྣལ་འབྱོར་མ་༼དང་༽། །ཧེ་རུ་ཀ་དཔལ་༼དང་༽སྐུའི་ཡན་ལག ༼དཔའ་བོ་ཉི་ཤུ་༤་༽ །ཀུན་ཏུ་བརྟེན་༼ཕྱི་དལ་ནང་གི་དལ་༽གཡོའི་བདག་ཉིད་ཅན། ༼ཕྱིའི་དཀྱིལ་འཁོར་མཆོད་ཅིང་བསྒོམ་པ་དང་ནང་གི་རྩ་སྟེ་རྫོགས་པ་བསྒོམ་པ་གཉིས་ཀས་༽ །གནས་ནི་རབ་ཏུ་དགའ་བའི་ས། །དེ་བཞིན་ཉེ་གནས་དྲི་མ་མེད། ༼ཡོན་ཏན་སྐྱེད་༽ །ཞིང་ནི་འོད་བྱེད་ཤེས་པར་བྱ། །ཉེ་བའི་ཞིང་ནི་འོད་འཕྲོ་བ། ༼སྒྲིབ་པ་དག་པ་༽ །ཚན་དྷོ་ཧ་ནི་མངོན་གྱུར་ཡིན། །ཨུ་པ་༼དེ་དང་ཉེ་བའི་༽ཚན་དྷོ་སྦྱང་དཀའ་བ། །འདུ་བ་རིང་དུ་སོང་བ་ཡིན། །ཉེ་བའི་འདུ་བ་མི་གཡོ་བ། ༼རྣམ་རྟོག་ནུས་པ་ལ་༽ །དུར་ཁྲོད་ལེགས་པའི་བློ་གྲོས་ཡིན། །ཉེ་བའི་དུར་ཁྲོད་ཆོས་ཀྱི་སྤྲིན། །ཤྲཱི་ཧེ་རུ་ཀའི་༼ལུས་ཀྱི་གནས་གསུམ་བཅུ་༤འམ་ཉི་ཤུ་བཞིར་༽ཡུལ་དུ་སྤྱོད། །འདི་ནི་ནང་གི་༼ལུས་ཀྱི་གནས་ཉི་ཤུ་༤འམ་ལུས་ཀྱི་རྩ་ཉིཤུ་༤འི་རྩ་གཉིས་པོ་དེས་ས་བཅུར་འདུས་པའོ་༽བདག་ཉིད་ས། །ཕ་རོལ་ཕྱིན་བཅུའི་ས་༼ ཡར་བ་ས་སྡུད་པ་ཕ་རོལ་དུ་ཕྱིན་་པའི་ཕྱིའི་སྒྲོ་འདོགས་ནང་དུ་དཔྱོད་པ་༽རྣམས་ནི། །༼འདིར་༽རྣལ་འབྱོར་མ་ཡི་༼པུ་ཛ་ལ་སོགས་པ་ཡུལ་རྣམས་བསྟན་པའོ་༽བརྡ་ཡི་སྐད་༼དུ་བརྟགས་པ་་་ཐུགས་གསུང་༽། །མཐོ་རིས་ས་སྟེང་ས་འོག་ཏུ།༼ པོའི་དཔའ་བོ་དང་རྣལ་འབྱོར་མ་རྣམས་ལ་ཚོགས་བསག་ཅིང་སྒྲིབ་པ་སྦྱངས་པས་དེས་ཐམས་ཅད་ལ་འདྲེའོ་༽ །༼ཉི་ཤུ་ལྔ་༽དཔའ་བོ་ཡན་ལག་བརྟན་གཡོའི་བདག༼སརྦའི༽ །པུ་ལ་སོགས་པ་གང་བསྟན་པ། ༼འཛཾ་བུའི་གླིང་དུ་སྐྱེས་༽ །ཕྱི་ནང་༼ལུས་༽བདག་ཉིད་༼དང་༽ཅན་དུ་གནས་༼རྒོང་ང་༽ ། །༼དེ་ཐམས་ཅད་རྣལ་འབྱོར་མ་སུམ་ཅུ་༧་གསུང་༽དཔལ་ལྡན་ཁྲག་འཐུང་རྒྱལ་པོ་ཆེ། །འདོད་པ་ཀུན་གྱི་དབང་ཕྱུག་གཙོ། །༼ཕྱིའི་དབང་དུ་བྱས་ན་ལྷ་རྣམས་༽ཀུན་ཏུ་ཕྱག་༼༡༢་༽དང་ཞབས་༼༢་༽ལྡན་པ།༼ཕྱིའི་ལྷ་ཞལ་གྱི་རྣམ་པ་ཅན་༽ །ཀུན་ཏུ་མིག་དང་མགོ་བོའི་ཞལ། །ཀུན་ཏུ་ཐོས་ལྡན་༼སྙན་མངའ་བ་༽འཇིག་རྟེན་ན།༼རིགས་དྲུག་གི་སེམས་ཅན་ཐམས་ཅད་ལ་ཁྱབ་ལ་དེ་ལྟ་བུའི་ཚུལ་གྱིས་ཁྱབ་པར་༽ །ཐམས་ཅད་གཡོགས་པར་༼ནང་དུ་ནི་རྩའི་རྒྱུ་པ་༽རྣམ་པར་བཞུགས་༼སོ་༽ །༼ གནས་བརྩོགས་པ་བཅུ་ལ་བརྡས་བཏགས་ན་ ༽ །དེ་བས་༼གནས་པ་བསྒོ་བ་ཡིན་༽དངོས་གྲུབ་༼སྔར་གྱི་རྣམས་༽བསྒྲུབ་བྱའི་ཕྱིར།༼རིམ་པ་༢་ལ་༽ །བསམ་གཏན་ལྡན་པའི་སེམས་ཀྱིས་ཏེ།༼སྔར་གྱི་དངོས་གྲུབ་ཐམས་ཅད་འདོད་པ་༽ །སྒྲུབ་པ་པོ་ལ་ཕན་པའི་ཕྱིར།༼སྐྱེད་རྫོགས་གཉིས་༽ །གསང་བའི་དེ་ཉིད་གསུངས་པ་ཡིན།དཔལ་འཁོར་ལོ་སྡོམ་པ་ལས་དབང་གི་༼ཕྱི་ནང་གཉིས་ཀྱི་༽སྦྱིན་བསྲེག་དང་གནས་༼ཕྱི་དང་ནང་ལ་སྦྱར་བ་གཉིས་སུ་༽ལ་སོགས་པའི་ས་༼དངོས་གྲུབ་ཀྱི་རྒྱུ་༽བསྟན་པའི་ཆོ་གའི་ལེའུ་སྟེ་ལྔ་བཅུ་པའོ། །༼བཞི་བཅུ་ཞེ་་་འི་དོན་མདོར་བསྟན་ནས་བཤད་པར་བྱ་བ་སྤྱི་དོན་༣་ལས་དང་པོ་དེ་ཁོ་ན་སྟོང་ཉིད་བཅུ་བཞིར་བསྡུས་པའི་ཚུལ་གྱིས་བཤད་པར་དམ་བཅའ་བའོ་༽དེ་ནས་གཞན་ཡང་བཤད་བྱ་བ། །༼རྒྱུད་རྒྱས་པ་ན་མེད་པས་༽མན་ངག་ཤིན་ཏུ་༼དེ་ཁོ་ན་ཉིད་བཅུ་བཞི་༽རྙེད་དཀའ་སྟེ།༼གསང་བར་བྱ་བ་ཡིན་པས་༽ །དཔའ་བོའི་བརྡ་ཡི་སྐད་དུ་ནི།༼རང་དགར་འཇུག་པ་སྤང་བའི་དོན་དུ་༽ །ང་ཡིས་རྒྱུད་དུ་སྦས་པ་ཡིན། །གོས་དང་ཕྱག་རྒྱ་ལྔ་ལ་སོགས།འདིའི་སྐོར་གྱི་མཆན་ཡང་བཙུད་མེད༽༼༥༢་་་་༡་་་་རབ་ཡན་ལག་་་་་་་་། ༽༼སྣང་ངོ་ལ་འདི་༢་ཀ་༡་ཏུ་༽ །ཨ་ལི་ཀ་ལི་ཞེས་བརྗོད་པ་༼རྐང་པ་འདི་གཉིས་ལ་༣་༽། །༼བསོད་ནམས་སྒོ་ཡེ་ཤེས་ཚོགས་༽རྒྱུ་སོགས་སྟོང་པ་སྔོན་འགྲོ་བ།ཧེ་རུ་ཀའི་ཡི་གེ་བརྒྱ་བ་གསུང་།ཧེ་རུ་ཀ་ཞེས་པ་ནི་༢་སུ་ཎ་པའི་ཡེ་ཤེས་ནམ་ཐར་༣་གྱི་བདག་ཉིད་ཡིན་པའོ། །འཇུག་པ་༼ཟླ་སྟེང་དུ་ཧཱུཾ་ལས་འོད་ཕྲོས་པ་བྱ་གྲུབ་ཟླ་གདན་རྡོ་རྗེ་པདྨ་་་་། ཟླ་སྟེང་དུ་ཧཱུཾ་ལས་འོད་བྱུང་པ་ལ་སོགས་པའི་རིམས་ཀྱིས་རྟེན་དང་བརྟེན་པ་རྫོགས་པར་བྱེད་པའོ་འབྲས་བུ་སྤྱི་ལ་དམིགས་པ་དང་་་་་་་་་་་་་་་་་་༽སྒྲ་ལ་སོགས་པ་༼མ་ལ་༽ནས། །ཇི་སྲིད་བསྡུས་པའི་སྦྱར་ལྡན་ཞིང་།༼མྱང་བ་སྒོམ་་་་དེ་འོད་དུ་ཞུ་་ མ་ལ་ བས་༽ །བདུད་རྩི་ཚིམ་བྱེད་༼འོད་བསྡུས་ནས་ད་དུ་གྱུར་བ་ལས་རྒྱུ་རྡོ་རྗེ་འཆང་དུ་གྱུར་པ་་དྷར་མ་དྷ་དུ་༽མྱ་ངན་འདས། །དམ་རྒྱ་སོགས་ཕྱག་རྒྱ་བཞི་དང་རྡོ་རྗེ་སེམས་དཔའ་བསྡུ་བ་ལ་སོགས་པ་རྫོགས་རིམ་སྒོམ་ལག་པའི་མཆོད་པ་དབང་བསྐུར་བ་༼ཁྲུས་ནང་དུ་སྣང་ངོ་༽ །༼ཡི་གེ་ཉི་ཤུ་༤་༽ །གོ་ཆ་ཆེན་པོ་༼བཞི་བོ་འདི་སྒོང་སྐྱེས་ལྟར་་་་་་་ས་སྤྱོད་འབའ་ཞིག་དུ་རྩིའོ་༽ཡབ་ཡུམ་གཉིས་སུ་མེད་པས་༽ཡང་དག་བསྲུངས།༼༡༤བོ༽ །སྔགས་རྣམས་ཀུན་གྱི་མཆོད་པ་ཡིན། །དེ་ལྟར་དེ་ཉིད་བཅུ་བཞི་ནི། །མདོར་བསྡུས་ནས་ནི་བཤད་པ་ཡིན་ཆོ་གའི་མན་ངག་མི་བསླུ་བར་ལམ་གྱི་གསང་བ་དེ་གོམས་པས་ཕན་ཡོན་གྱི་ཚུལ་གྱིས་འབྲས་བུའི་གསང་བ་ལ་འཇུག་པ་བསྡུས་ཏེ་བསྟན་ཏོ། །མི་མཆོག་གང་ཞིག་ཀུན་སྤྱོད་པ། །སྡིག་པ་ཐམས་ཅད་རྣམ་དག་བདག་དངོས་སུ་སྤང་བའི་དོན། །དེ་བཞིན་གཤེགས་པའི་ས་ཐོབ་ཅིང་ཐོབ་བྱ་ཐོབ་པའི་ཕན་ཡོན་བསྟན་དེས་འདྲེ། །སྐྱེ་ཞིང་དང་སྐྱེ་གནས་བདེ་གཤེགས་ཀྱི། །འབྲས་བུ་མཆོག་དེ་མ་ཐོབ་བར་དུ་ཡང་ལམ་དུ་དེ་ཁོ་ན་ཉིད་བཅུ་བཞི་གོམས་ལས་རིགས་སུ་སྐྱེས་ཆོས་ལྡན་རྒྱལ་པོར་འགྱུར་དེ་མ་ཐོབ་བར་དུ་གསུང་འཁོར་ལོས་བསྒྱུར་བ་ལ་སོགས། །ཇི་སྲིད་མངོན་བསགས་སྡིག་པ་ཡི། །བག་ཆགས་ཀུན་ཟད་མཚན་ཉིད་ཡིན། །དེ་ཉིད་བཅུ་བཞི་གང་ཞིག་འདི་ནི་རྟག་བསྒོམ་པ། །ཁམས་ཀྱི་རྒྱལ་ཕྲན་དུ་འགྱུར་ས་ལ་འདོད་པ་ཀུན་དབང་ཕྱུག་ཆེན་པོར་འགྱུར། །སྡིག་པ་ཟད་པའི་དཔེ་དཔེར་ན་མར་གྱིས་གང་བའི་སྣོད། །མེ་ཡི་དབུས་སུ་བཞག་ན་ནི། །མར་གསར་ཞུ་ཞིང་ཞུ་འགྱུར་ཞིང་། །སྣོད་ཀྱི་དྲི་མ་ཡང་རིམ་པས་དག་པར་འགྱུར། །དེ་ཉིན་༡༤དེ་བཞིན་ཤྲཱི་ནི་ཧེ་རུ་ཀའི། །མཚན་གྱིས་སྡིག་པ་འཇིག་པར།མཚན་གྱིས་སྡིག་པ་དག་པར་འགྱུར།འགྱུར། །རིམ་པ་གཉིས་པའི་བསམ་གཏན་མཉམ་རྗེས་གཉིས་ཀ་ལའང་་་་་་་་་་་་ མངོན་པར་རྫོགས་་་་་་་་་་པ་མཉམ་རྗེས་གཉིས་པོ་་་་་་་འདིའི་འབྲས་བུ་་་་་་་་ལ་མི་བསླུ་བ་བསམ་གཏན་སེམས་དཔའ་ཙམ་གྱིས་སམ། །པི་ཏི་ལ་སོགས་པ་ཀློག་ཅིང་བསྒོམ་པ་མིན་པ་འདོན་དང་བྲིས་པ་ཡིས། །ལ་ཀུའི་སི་ཏི་ལ་སོགས་པ་ལས་ཤེས་མཐོ་རིས་གཟུགས་མེད་པ་དང་གཟུགས་ཀྱི་ལྷ་དང་འདོད་པའི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་ཐོབ་པར་འགྱུར་ལོངས་སྤྱོད་ཐོབ་འགྱུར་བའམ། །ཡང་ན་མིའི་ནང་དུ་སྐྱེས་ན་སངས་རྒྱས་མ་ཐོབ་བར་དུ་འཁོར་ལོ་བསྒྱུར་བ་ཐོབ། །གཞན་ཡང་རྣལ་འབྱོར་པ་རྣམས་འདི་རང་གི་མཐར་ཀུན་རྫོབ་དུ་འཕོ་བའི་འཆི་བའི་ཚེ། །གཙོ་བོ་དཔལ་ལྡན་ཁྲག་འཐུང་སོགས་མཁའ་འགྲོ་གསུམ་བཅུ་བདུན། །ལག་ན་མེ་ཏོག་བསྡུ་བའི་ཕྱིར་སྣ་ཚོགས་ཐོག །རྒྱལ་མཚན་བ་དན་སྣ་ཚོགས་དང་། །རོལ་མོའི་སྒྲ་ནི་སྣ་ཚོགས་དང་། །སྣ་ཚོགས་གླུ་ཡི་མཆོད་པས་མཆོད། །འཇིག་རྟེན་ལྷ་དག་བྱུང་ནས་འཆི་བ་འཆི་བ་ཞེས་བྱ་བའི་རྣམ་རྟོག་འདི། །རྣལ་འབྱོར་པ་ལ་དེར་བསམ་པ་གཉིས་ཞལ་མཐོང་བ་དང་ཆོས་ཉན་པ་ལ་སོགས་པ་རིམས་ཀྱིས་བར་ཐོབ་བསྒྲུབ་པ་ཉམས་སུ་ལེན་པ་དཀའ་བས་མཁའ་ལ་འགྲོ་བའི་གནས་སུ་ཁྱེར། །དེ་འདྲའི་དཔལ་ཆེན་སྐྱེས་པའམ་རྣལ་འབྱོར་མ་བུད་མེད། །དེ་འདྲའི་ཛོ་ཀི་དེ་ས་སྟེང་ན་ནི་སྲིད་པ་ཙམ་བསྒྲུབ་པ་ཉམས་སུ་ལེན་པར་དཀའ་བས་རྙེད་པར་དཀའ། །དཔལ་ལྡན་ཧེ་རུ་ཀ་སྡོམ་པའི་སྒོ་ནས་བསྟན་རྒྱུད་ཆེན། །བཞི་བ་ཕན་ཡོན་དང་འབྲས་བུའི་ལམ་ལ་་་་་་པའི་ཉེས་དམིགས་འབུམ་གང་གིས་ཤེས་ནས་སྤྱིར་དེ་ལ་མ་དད་པ། །དེ་ཟད་པར་་་་་དབུལ་བ་སྡུག་བསྔལ་གྱིས་གདུངས་པ། །ལམ་གྱི་ཁྱད་པར་བསྟན་དེ་ལ་རྟག་ཏུ་འབྱུང་བར་འགྱུར། །སྔར་སྐྱེད་པའི་ལྷ་མོའི་རྣམ་པ་གསལ་བར་བསྟན་་་་་་་མགུལ་རྒྱན་གདུ་བུ་དཔུང་རྒྱན་དང་། །རྣ་ཆ་ཚངས་པའི་སྐུད་པ་དང་། །དོ་ཤལ་མགོ་བོའི་ལྔ་བཅུའི་་འཕྲེང་བ་དང་། །་་་ལྟར་སྐྱེད་པའི་་་་་་ད་འདྲ་བའི་ཚོགས་པ་་་་་་ཀུན་དང་མ་བགྲང་སྐེ་རགས་སིལ་སིལ་སྒྲ་སྒྲོགས་པ། །དལ་གྱི་རི་སྟེངས་མཉམ་བཞག་སྐྱེད་རིམ་འམ་སྣ་ཚོགས་པད་མ་ཡི། །ལྟེ་བར་ཨ་ལི་ཀ་ལི་ར་གྱུར་པ་ལས་་་་་་་་སྐྱེས། །དབུ་མའི་དངོས་པོ་རྣམ་པར་་་་་བདག་པོ་རྣམ་གནོན་ཅིང་། །རྡོ་རྗེ་དྲིལ་བུས་དངོས་གྲུབ་རྣམས་ཀྱི་རྒྱུ་ཕྱག་མཚན་གྱིས་མཚོན་པ་ཙམ་་་སྐུ་ལ་མཁྱུད། །ཉི་ཤུ་རྩ་བཞི་ཕྱེད་ལྡན་པའི། །དཔའ་བོ་རྣལ་འབྱོར་མ་༼སུམ་བཅུ་རྩ་དྲུག་གི་༽ཚོགས་༼ཉི་ཤུ་རྩ་བཞི་༽བསྐོར་༼བའི་༽ །༼དེ་ལྟ་བུའི་༽ །ཤྲཱི་ཧེ་རུ་ཀ་རྒྱལ་༼ཙཀྲ་རྫོགས་པ་༽ཆེན་པོ། །གོ་འཕང་མཆོག་༼ཏུ་གྱུར་པ་༽ནི་བསྒོམ་པར་བྱ།༼ བསྒྲུབ་པ་པོ་དེ་ལྟར་བསྒོམས་པ་དང་དལ་ཡང་ཚེས་བཅུ་མཆོད་པ་ལ་སོགས་པ་རྣམས་ཀྱིས་ཀྱང་༽ །དཔའ་བོ་ཀུན་དང་རྣལ་འབྱོར་མའི། །༼མིའི་རུས་པ་ལ་སོགས་༽འཁོར་བཅས་དབུས་སུ་འབྱོར་ལྡན་པ།༼བསྒྲུབ་པ་པོ་དེ་ལྟར་བསྒོམ་པ་དང་ཡང་ཚེས་བཅུའི་མཆོད་པ་ལ་སོགས་པ་རྣམས་ཀྱིས་ཀྱང་གསུང་༽ །ཐམས་ཅད་༼དཀྱིལ་འཁོར་༽དགེས་ཤིང་གཉིས་མེད་×པ་སྣ་ཚོགས་སྟོན་མཛད་དེ། །སྣ་ཚོགས་ཚུལ་གྱི་གདུལ་བྱ་ལ་༼ཉམས་དགུ་སོགས་༽། །༼རྣམ་རྟོག་རིམས་ཀྱིས་ཟད་པ་ཡིན་པའི་ཕྱིར་༽ཐབས་ནི་སྣ་ཚོགས་སྟོན་པ་ཡིན།༼ལྔ་པ་༽བསམ་གྱིས་མི་ཁྱབ་པའི་དོན་ཡིན་པས་གང་ལ་ཡང་མི་སྨད་པ་བསྟན་༽ །ཟབ་མོའི་ཆོས་ནི་སྟོན་པ་ལ། །༼སྐལ་མེད་༽གལ་ཏེ་མོས་པར་མ་གྱུར་ཀྱང་།༼དེ་ལ་བསྒྲུབ་པ་པོ་ལ་༽ །སྨད་པ་དག་ཏུ་མི་བྱ་སྟེ།༼ཆོས་མིན་བྱ་བའི་ཐེ་ཚོམ་ཟ་བ་པོ་་དཔེར་ན་སྒྱུ་མ་མཁན་ནམ་གར་མཁན་ནམ་རི་མོ་མཁན་དང་འདྲ་སྟེ་ཆོས་ཉིད་བསམ་མི་ཁྱབ་པས་༽ །ཆོས་ཉིད་བསམ་༼གྱིས་༽མི་ཁྱབ་༼གདུལ་བྱ་སྣ་ཚོགས་སུ་༽དྲན་བྱ་༼པ་ཡིན་པས་རྟོགས་པར་དཀའ་༽། །གང་གིས་༼ན་༽འདི་བད×་སྲས་ནི། །བདག་ཉིད་ཆེན་པོ་རྣམས་ཀྱིས་མཁྱེན། ༼སྔར་༽ །སངས་རྒྱས་རྣམས་ནི་༼སྔར་༽འབྱུང་འགྱུར་ཏམ། ༼ཕྱིས་༽ །མ་བྱུང་ན་ཡང་རྣམ་ཀུན་ཏུ། །བསམ་མི་ཁྱབ་པའི་ཆོས་ཉིད་ནི། ༼སྐྱེ་འགག་༽ །འཕེལ་འགྲིབ་སྤངས་པས་གནས་པ་ཡིན། ༼མི་རྗེད་པར་དྲན་པ་ན་༽ །དེ་ལྟར་རྣམ་པར་བཞག་ནས་ཀྱང་།×་་་་འགྲོ་བ་བསམ་ཡས་ཤིང་།༼ ཕན་ཡོན་གྱི་སྒོ་ནས་མཆོག་གི་སྒོ་ནས་བསྟན།དེ་ནས་ཕན་ཡོན་གྱི་སྒོ་ནས་བསྟན་གང་ཟག་གི་རིམ་པས་རྒྱུད་ཀྱི་རིམ་པ་བསྟན་པ་༽ །སངས་རྒྱས་རོལ་བ་བསམ་མི་ཁྱབ། །ཇི་སྲིད་༼མདོ་ཕ་རོལ་ཕྱིན་པ་༽མདོ་བྱ་༼བའི་རྒྱུད་༽སྤྱོད་པ༼འི་རྒྱུད་༽་ནི། །རྣལ་འབྱོར་༼གྱི་རྒྱུད་༽གསང་༼པ་བླ་ན་མེད་པའི་རྒྱུད་༽མཐའི་དབྱེ་བ་༼མས་བླ་ན་མེད་པ་༽ཉིད། ༼མཐའི་དབྱེ་བ་མའི་བླ་ན་མེད་པ་སཾ་པ་ར་༽ །སེམས་ཅན་མོས་པས་འཇུག་པ་རྣམས། །༼རྒྱུད་ཀྱི་མཚན་༽དེ་དང་དེ་ལ་དགའ་བ་ཡིན།༼མ་བླ་ན་མེད་པ་མནད་དྲང་བའི་དོན་ཡིན་པས་མའི་ཡང་བླ་ན་མེད་ངེས་པའི་དོན་ཡིན་ནོ་བྱ་བ་༽དཔལ་ཧེ་རུ་ཀ་ཞེས་བྱ་བའི་རྒྱུད་ཀྱི་རྒྱ×བསྟན་ཆོས་ཐམས་ཅད་༼ཉོན་མོངས་འཇོམས་པ་༽དཔལ་༼རྗོད་བྱེད་དོན་གྱི་་་་་་་་་་༽ཧེ་རུ་ཀ་༼བསྒྲུབ་ཉེ་བ་༽དཔའ་བོ་ཆེན་པོ༼འི་ཟེར་༽ས་ཀླགས་པས་འགྲུབ་པ་༼མིང་གི་རྣམ་གྲངས་༽ཐམས་ཅད་མཁྱེན་པ་གཞན་གྱིས་མི་ཐུབ་པ་འདོད་ན་གྲུབ་པའི་༼ཆེ་བ་ས་བཅུ་༣་པ་རྡོ་རྗེ་འཛིན་པ་ཡེ་ཤེས་དེ་གཞན་ལས་ཁྱད་པར་དུ་བསམ་༽མཆོག་གི་མཆོག་༼རྡོ་རྗེ་འཛིན་པ་ཡེ་ཤེས་དེ་༽ དཔལ་འཁོར་ལོ་སྡོམ་པ་ཞེས་བྱ་བའི་རྣལ་འབྱོར་ཆེན་པོའི་རྒྱུད་ཀྱི་རྒྱལ་པོ་༼སྒོ་དྲུག་ལས་༽ལས་ལེའུ་ལྔ་×ར་ཝརྨ་དང་། ཞུ་ཆེན་གྱི་ལོ་ཙཱ་བ་བནདྷེ་རིན་ཆེན་བཟང་པོས་བསྒྱུར་ཅིང་ཞུས་ཏེ་གཏན་ལ་ཕབ་པའོ། སླད་ཀྱི་པཎྜི་ཏ་ཆེན་པོ་སུ་མ་ཏི་ཀིརྟི་དང་། ལོ་ཙཱ་བ་མལ་བནདྷེ་བློ་གྲོས་གྲགས་ཀྱིས་ཞུས་ཏེ་གཏན་ལ་ཕབ་པའོ།༼བཀའ་མཆན་ལ་སྣ་བསྲིངས་པ་ཚན་ཅིག་སྣང་སྟེ་གོང་དུ་བསྲིངས་པ་རྣམས་ལ་གོང་དུ་དང་གྱོག་བྱས་པ་ལ་མཚམས་བཅུག་ཡོད།བཤམ་དུ་བསྲིངས་པ་རྣམས་ལ་དང་གྱོག་རེས་མཚམས་བྱས་ཡོད། སྟེང་ན་ཞ་བྲིས་ཡོད་ཟིན་མཆན་དུ་སྣང་། སྦྲུལ་ཤད་ཅན་རྣམས་སུ་ན་ལ་གྲ་ཡིས་བཏབ་པར་སྣང་། འགྱུར་ཆན་གོང་ན་སྦྲུལ་ཤད་ཅན།༽</p>",
    "ContentChinese": "<p class=\"chinese-text\">上師噶托欽哲才旺諾布所製《勝樂簡略手印》者，得之錫金王室藏本。首三葉及末第三十葉缺。電腦錄入時，原文多有古體字、重字、介詞、語助、元音、字頭等不合今制者，悉從其舊。如有字跡不清、辨識有誤、注文不當、標記無據、注文位置不明等謬誤，祈請大德學者對校原本，為之訂正。編輯者識於二〇〇四年十二月十日。


空拳擊打徒勞然，如飲陽焰終不饜。
瑜伽三昧最殊勝，一切相應妙法門。
若人恆常修此法，人天莫不敬畏伏。
入此壇城受灌頂，諸部密續得成就。
喜笑觀相與執手，二二相擁諸儀軌。
諸部密續未嘗說，攝真明點密嚴中。
密部金剛大怖畏，壇城最勝未曾有。
所說未說諸密義，悉住具德飲血尊。

此為《黑怙主現說續》灌頂功德品第三竟。

爾後空行遊大地，精進轉輪未圓滿。
大力吉祥密護者，酤酒商女轉輪力。
鳥面馬耳最勝天，翠綠天女妙相好。
飲酒風力大怖母，地護樹蔭諸天眾。
楞伽主母矮身相，勇慧廣鼻光明現。
猛目大威諸成就，空行二十四天眾。
身語意密三壇城，內外一如無二別。
此眾往昔已成就，自名持誦咒力成。
終以吽吽發吒合，見此最勝瑜伽法。
如火餘經如草芥，唵字普明諸法相。
勇父雙運證菩提，壇城觀想得成就。
了知此理常修習，如來授記得成就。

此為《黑怙主現說續》勇父空行雙運品第四竟。

諸法匯入法界中，於彼無漏月輪心。
書已如法善持誦，一切諸法攝歸一。
密咒真言如是說：阿梨迦梨和合時。
諸部善巧作轉變，四四分別知其理。
最勝佛陀以莊嚴，勇父真言當採擇。
成就一切諸所願，四部五部善了知。
第五復取其第五，取第四部第五尊。
第一第三尊處攝，二十九尊諸尊位。
四部第一尊中取，後住四尊及二尊。
三十尊位當善取，二十六尊及半數。
三十三尊第一尊，末後三尊並三尊。
三十二尊次第取，四部五部與四部。
末後第一二三尊，第二第三初位尊。
五部五部與第四，第一二尊並三尊。
如是十一十六部，三部初位二十六。
四部三位善了知，烏沙摩中第二尊。
初位初尊二十七，二十八尊亦如是。
初部三位與四部，五部四位三十一。
十五二十五尊位，初部二位二十一。
安達悉底第二尊，復取三十尊位等。
五部初位烏沙摩，復有第一諦字門。
四部初位烏沙摩，二十八尊第二尊。
三部初位與三尊，初部三位當善取。
四部四位求其處，安達悉底二尊位。
三部五位并六位，次取梵字復當攝。
初部四位八位中，四部五位五部中。
二十七位四部四，重取二十七尊位。
二十六位二十五，三十三位四部四。
五部五位四部五，初部初位二十七。
安達悉底四位中，二十一位烏沙摩。
二十六位皆當取，咒語真言如是持：

迦囉迦囉，俱嚕俱嚕，班駄班駄，怛囉薩耶怛囉薩耶，俱嚩耶俱嚩耶，吽吽，喝喝，吠吠，發發，陀訶陀訶，播遮播遮，薄叉薄叉，婆娑嚕地囉多囉摩邏瓦藍毘寧，儗哩訶拏儗哩訶拏薩鉢多播多羅誐多步壤誐薩瓦摩怛惹耶怛惹耶，阿迦吒訶，阿迦吒訶，紇哩紇哩，若弄若弄，岡釤那摩岡釤那摩，吽吽，呬呬，枳里枳里，悉里悉里，呬里呬里，地里地里，吽吽發。

供養之時勇士眾，明王密咒最殊勝。
一切成就悉圓滿，三界之中無與比。
具德飲血咒若知，餘咒徒勞無實義。

此為《黑怙主現說續》根本密咒文字採集品第五竟。

復有二十二梵字，心咒七字近心咒。
八位種子相和合，十二彎鉤皆具足。
中間六字當遺除，六支瑜伽黑怙主。
六勇六處相應時，一一文字善相合。
唵南莎訶發吒等，二吽發吒相應故。
修習之人當善知，此為六勇心要咒。
初處心間第二頂，第三頂髻四甲冑。
第五眼處第六者，金剛標誌善安立。

此為《黑怙主現說續》六勇甲冑採集品第六竟。

爾後十三韻母字，第二文字相和合。
十一韻母善莊嚴，第六文字為嚴飾。
第四韻母第七字，十一韻母第八字。
第二韻母第九字，第二韻母十二字。
第二韻母二十一，十四文字相和合。
第二十字配三韻，十五文字善相應。
第十六字為嚴飾，三韻十七成就法。
第二韻母十八字，第二十一皆具足。
第五佛母二十三，十三韻母二十四。
初位取一配二五，二韻相合成就門。
二十八字善相配，十五韻母共和合。
二十九字初三合，下分火界共相應。
三十一字二韻合，三十二字十三韻。
三十三字日輪合，四韻三十四相應。
一切所欲皆成就，第五韻母三十七。
空行成就無等倫，三十八字二韻母。
諸天成就無疑惑，四十二字火下合。
四十三字五韻母，四十五字二韻配。
五韻四十六相應，一切勇士供養門。
四十七字二韻母，金剛薩埵最為尊。
五十一字五韻合，此為莊嚴最勝法。
五十二字二韻母，諸天成就無疑惑。
五十三字十三韻，諸字中尊能滅敵。
五十六字六韻母，五十九字安達字。
二韻十五上相合，一切成就由此生。
六十一字二韻母，諸佛稱此為最勝。
六十二字三韻合，空行勝妙無等倫。
六十三字十一韻，莊嚴文字最殊勝。
六十四字二韻合，成就解脫大醫王。
六十五字金剛開，六十六字三韻合。
諸佛宣說悉地門，六十七字二韻母。
瑜伽空行悉成就，六十八字下相應。
七十一字二韻母，文字莊嚴最殊勝。
七十四字二韻合，如來宣說本成就。
七十五字六韻母，瑜伽最上善法王。
七十六字二韻合，常以火界共相應。
更無莊嚴可比擬，七十七字陀相合。
空行莊嚴最殊勝，七十八字二韻母。
因中最勝諸佛讚，八十一字四韻末。
本來成就此為因，一切悉地由此入。
八十二字二韻合，此為根本密咒王。

唵字開始諸字母，吽發終位善相攝。
此為根本密咒王，一切修持皆成就。

此為《黑怙主現說續》密咒採集品第七竟。

爾後一切自性中，諸勇平等相應時。
空行網羅總持門，輪圓大樂最勝尊。

哈娑囉婆三拉孜瓦尼枳荼吒發吽吽岡如如嘿嘿雜巴室利唵
明王心要最殊勝，未來永劫難再現。
發吽紇陵紇陵欣唵
梵央摩紇陵吽發
唵跋折囉吠嚧佳尼耶吽吽發娑婆訶
空行明咒最殊勝，未來永劫難再現。
世間四寶最為勝，持誦密咒最為尊。
空行明咒最殊勝，明王即是黑怙主。

此為《黑怙主現說續》逆轉心要與六瑜伽女密咒採集品第八竟。
今依根本密咒王，最勝事業次第法。
今當分別善宣說，三界所有諸眾生。
一切剎那皆成就，諸法事業悉圓成。
諸天生處能動搖，一切天眾居處所。
龍眾一切與夜叉，乾闥婆等念即滅。
雲霧能令速散去，並能降下甘霖雨。
能令雨止復晴天，能令大海皆枯竭。
江河逆流向上行，能令雷電皆退散。
念誦十萬此密咒，大地震動遍三千。
能令飛騰諸樹上，隨心所欲遍遊行。
能奪一切諸咒力，並奪一切諸成就。
能引血脈復還歸，能現千百諸形相。
欲見即見不欲隱，能摧宮殿並樹巔。
能令諸毒成甘露，甘露亦能變成毒。
月光化水水成月，能奪諸香妙香氣。
隨心所欲轉生處，金翅鳥面與月聚。
天女遊戲出生處，尊勝福德無能奪。
如是一切諸成就，具德果報悉圓成。
念即能殺復能活，能令不生復不滅。
能破地下諸伏藏，能降冰雹並電光。
能令諸天現舞蹈，持誦一遍即命終。
遍三界中得自在，若欲攝受隨心成。
世尊此法最殊勝，不須苦行持禁戒。
但誦此咒即能成，隨欲所作悉皆辦。
若以忿怒心誦咒，一遍即能殺億眾。
若以寂靜心持誦，即能令死還甦醒。
塚間炭灰誦一遍，觸及何物即倒地。
誦咒灰觸諸物時，即為羅剎所執持。
阿提目葛枝一誦，觸及諸物即來歸。
碎瓦一誦擊何物，彼即麻痺不能動。
隨意所往悉能行。以求求羅香一誦，
和諸祭物為香薰，一切有情皆降伏。
左手一誦而覆之，能解諸毒令痊癒。
空行所禁以咒水，一灑即得解脫之。
迦羅毘羅枝一誦，隨欲轉生何胎中。
具德飲血密咒者，不解成就求悉地，
如愚擊殼求其穀，無有此咒諸悉地。
眾生不得成就樂，不解此咒習瑜伽，
徒勞無益終不得。此咒能與諸所欲，
一切成就悉圓滿。如來所說諸印咒，
行者當修飲食等，資具悉地諸供養，
八種成就皆具足。
此為《黑怙主現說續》根本法品第九竟。

次說黑怙無二法，若人但解此相應，
決定無疑得成就。今當宣說三身法：
法身瑜伽得成時，即說是為法身相；
圓滿報身瑜伽時，即說是為報身相；
化身瑜伽得成時，即說是為化身相。
法報化三必當得，自身即成黑怙主，
於此更無有疑慮。今說此咒心要義，
諸修行者善諦聽。誦心咒者能騰空，
去來遠近百萬里。能現千百諸化身，
能登宮殿諸樓閣，與諸瑜伽母同遊，
百萬由旬悉能往。騰空去來無罣礙，
餘法更無如是能。欲顯則現不欲隱，
能現童子老少身，或現象馬與水牛，
虎豹獅子及野牛，鼠兔騾驢諸獸形，
孔雀家雞與鴻雁，鷗鳥梟鷹諸鳥形，
隨意所欲皆能現。能奪人語并視聽，
能奪嗅味諸知覺，隨欲引血作損害。
此為《黑怙主現說續》三身成就心咒法品第十竟。

次復為修行者說，但依此法修持時，
速得成就入悉地，今說成就方便法。
若人身有妙香氣，言語誠實不妄語，
目不瞬動經久時，無有忿怒心安詳，
口出芬芳妙香者，此乃七世為人身。
若得此人心中寶，誦黑怙主咒百八，
點其頂門即能飛，升至梵天百萬里。
但食此寶即能得，三世智慧神通力。
一日一夜能往返，五十由旬遠近處。
復得天身諸妙果，若人知此心要者，
隨心所欲悉能得。
此為《黑怙主現說續》七世轉生相品第十一竟。

次說近心要咒法，能成一切諸悉地，
三界所有諸事業，剎那即能悉成就。
咒曰：吒發吽吽哈哈呬嗡。此為近心要咒也。
誦此咒滿十萬遍，能令三界皆震動。
能召諸天阿修羅，夜叉羅剎諸龍眾，
乾闥婆與緊那羅。能令大海諸河流，
以及池沼皆枯竭。於其所誦咒處所，
一切空行為僕使。以此咒水洗眼時，
能知何人七世身。又見壽盡將死者，
及見壽長命存者。以咒目視諸眾生，
即令其身皆麻痺。取死人足底皮革，
和人血為丸藥時，配諸龍腦麝香等，
陰乾裹以三種金。加持安置吉宿時，
置於黑怙主口中，左手掩口誦千八，
即得身形皆隱沒，影跡亦復不復現。
諸天尚且不能見，何況世間諸凡夫。
若出口中還顯現。此經所說空行丸，
乃是勇士親宣說。以此近心要咒力，
取死人頭成髑髏，無肉潔淨善加持，
左手指節數數撫，血脈還歸於本處。
密誦真言頭骨上，握拳擊之生頭痛。
憶持密咒盛牛乳，頭痛即能得安寧。
誦咒點滴諸眾生，隨目所視皆禁縛。
密誦手指指天時，隨指所向即顛仆。
念誦打地即命終，誦咒灑水還蘇醒。
密誦指尖向虛空，千眾禁縛隨心轉。
一言即得解脫門，屠夫灰燼誦百遍。
隨念眾生被打時，化為彼等諸形相。
護摩灰燼誦百遍，天眾亦不能視吾。
七遍誦水灑其身，還得顯現如本相。
結頂骨印密合時，持氣念誦皆狂亂。
千眾亦當成醉狀，意念即得解脫門。
持誦髻髮作七結，一切空行皆來集。
空宅誦百束頂髮，瞪目誦咒成隱身。
解髻即得還本形，頂骨盛灰密誦已。
上下四方皆散灑，天與非天及夜叉。
羅剎龍眾乾闥婆，緊那羅等皆禁縛。
能奪空行諸威力，床座臥褥諸男女。
百遍持誦不相離，意念即得解脫門。
木屑誦已投江河，流水逆上向源頭。
即此木屑能鎮壓，巨浪洪濤歸平靜。
仰面觀空千遍誦，投灑空中止大雨。
他軍變化諸兵器，弓箭刀矛諸器具。
或以手擲或持執，手中兵器五種法。
三界之中無不攝，此五兵器最為尊。
以藥塗身持千遍，入陣百劍不能傷。
身體堅固如金剛。
此為《黑怙主現說續》近心要事業儀軌品第十二竟。
次說甲冑諸事業，三界所有諸所欲，
悉能如意而成就，今當次第而宣說。
若人持誦甲冑咒，入於道路不見形，
盜賊虎豹不能害。入王宮殿諸密處，
亦不能見任意取，諸天亦復不能見。
以咒手觸彼身者，即如中矛而麻痺，
三十三天不能動。以足踏地誦咒時，
彼者即得解脫焉。以己血點作圓相，
誦咒三遍見何人，即能引彼身中血。
入彼家中誦千遍，一切皆得重病苦。
以水誦五遍灑之，即得痊癒還如故。
若視其面而持誦，即奪其語令不語。
入江河池誦千遍，能於水上如陸行。
入於深水如大海，揉手誦咒滿千遍，
一切空行歸所制。種種形貌諸空行，
持明空行羯諾荷，悉為所攝而歸伏。
吉宿織衣著此服，誦滿萬遍即成就。
身著此衣不見形，能於虛空千由旬，
隨意所往皆能至，乃至大海諸邊際，
上至諸天皆能到。六根明利了諸境，
一切皆成佛自性。取如意樹之汁液，
誦咒千遍作圓點，能令其人化為樹。
以水七遍灑其上，還復如故得解脫。
取象足跡中塵土，誦千遍已擊其身，
即化其形為大象。
此為《黑怙主現說續》甲冑咒法品第十三竟。

次我驢面瑜伽者，為令意樂速成就，
今當宣說此修法。空行形貌如持明，
復有空行眾形相，及羯諾荷妙容顏，
驢面血口執三叉。於此觀想驢容中，
能見壽盡與長壽。此驢瑜伽成就者，
觀想其中驢形相。若見象形前現者，
即知彼為象所生。隨其前生為何類，
瑜伽士能如實見。是人即得諸成就，
依七世身作次第，以此供獻諸空行，
修行之人得成就。剎那能於百千里，
上至空中而飛行。此最勝妙瑜伽咒，
能成空行諸事業。依此修法得驗已，
一月之中必成就。此秘密咒最勝妙，
心咒之中最吉祥。若人了知此心要，
定為瑜伽真行者。我為彼等而宣說，
是為空行網勝樂。
此為《黑怙主現說續》驢面瑜伽行品第十四竟。

次說一切三昧耶，若人解知此手印，
決定無疑得成就。馬者說為丈夫相，
邸者亦為丈夫義，底者即是女人相，
布者即是降伏義。蘇者表示飲食相，
摩者即為母親義，阿者即是妻室相，
毗者即為姊妹義。地者表示親愛人，
盧者即是童女相，悉底者為血相義，
薩者寂靜飲酒相。佩者即是粥食相，
醯者即表肉食義，婆者即是食啖相，
部者表示交會義。毘者即是尸陀林，
部者即表死屍相，地者瑜伽母相義，
黎者即是持明母。薩底哩者具色相，
俱者即是空行母，訶者羯諾荷相義，
惹者即是纏足相。婆者即表肩臂相，
蘇者表示善言辭，薩者表示善來義。
彌者即是魚相義，菩喻者即飲食相，
毗者即是飲相義。伽者通非通行相，
迦者即是來去義。薩者不往他處相，
囉者無瞋恨相義，杜者惡行女相義，
蘇者吉祥女相義。那者薄福女相義，
薩者持三昧耶者，阿者無三昧耶相，
阿者即是來相義。那者即是未來義，
索者即是愛著相。是等一一字手印，
當知勇士與姊妹。不應授與無信者，
當與具信及三昧。
此為《黑怙主現說續》手印品第十五竟。

次說大悉地深密，為修行者而宣說。
具大信心持戒者，堪為勝上法器人，
是中當為彼宣說。心懷歡喜利他者，
當授與彼具信人。由色相貌及行儀，
無二勇士應依止。但知彼等真實相，
修行即得諸成就。猶如白蓮女人相，
目如蓮葉長且淨，常樂白衣為莊嚴，
栴檀妙香以嚴身。樂見如來眾集會，
當知是為勝種性。其有女人如鍊金，
喜著赤黃妙衣裳，具有訶子栴檀香，
是為勇士所攝受。復有女人青蓮色，
喜著青衣青蓮香，如是勇士亦隨從。
極淨女人白蓮色，常具紅蓮根本香，
是亦如是隨勇智。赤黃女人形貌美，
所著衣裳純赤色，茉莉青蓮妙香具，
是為金剛種姓生。黃綠女人白衣樂，
尸利沙花香具足，是為如來種姓攝。
復有女人純赤色，衣裳亦同赤色相，
常具龍腦妙香薰，毗盧遮那種姓攝。
瑜伽母眾諸種姓，如是定說有其七，
常樂左手諸威儀，各具本色以為相。
種姓明咒亦具足，六色差別而顯現。
結自印契出密語，自種字中所生聲。
左行女人瑜伽者，當於左方善觀察，
左手示現諸密印，左目觀視諸境相。
樂與天女共談笑，是則名為具誓者。
若有女人生敬信，善示本種所生子，
不離種姓諸事業，不捨自宗經教言。
誦持本尊密咒者，是名具足三昧耶。
若結頂禮印契者，常以左身而恭敬，
若與天女共言說，決定成就無虛妄。
左手拇指畫於地，經常描繪諸圖像，
搖動其頭作標記，斜視示現手印相。
為利行者作加持，憶念本尊密咒時，
或於頰上或耳鼻，以指觸示為標記。
斜視一誦密咒已，恒常觀視修行者，
此為決定成就者，必具誓言瑜伽母。
如是瑜伽母可信，定能授與諸成就。
此為《黑怙主現說續》七瑜伽母相品第十六竟。

次說難得瑜伽母，及諸空行眾妙相，
五甘露中而出生。夜摩尼與怖畏母，
欲具母與可怖相，遍行美母光明母，
如是七眾應當知。今說攝受諸瑜伽，
具相茉莉持明母，蓮華轉變童子母，
不退來去諸天女。空行眾有七種相，
目視生愛舉眉時，如昔形貌能攝受，
後得安住諸境界。是為具相空行母，
勇士當與無二修。若抱童子美醜者，
搖動親吻為標相，是名准毗迦空行，
能滅行者諸罪業。食時側目視於左，
蹙眉轉面動其眉，作怒指相不他往，
令人驚怖生畏懼，是名持明母當知，
不應親近而供養。豬獅貓及狼羊馬，
悉能令彼生驚怖，能轉諸相故名轉，
不應親近修供養。極喜大笑出聲已，
去而不返生愛著，明顯發笑具童相，
是名羯諾荷空行。見者心生大厭離，
足手衣角及木杖，觸者皆不得存活，
是名不退還空行，不宜修持當遠離。
無故發笑復啼哭，忽爾瞋怒心不定，
是名依醯迦空行，天女宣言不應近。
常與佛法僧同住，是為金剛種所生。
空行手印有八相，勇士當觀其標記：
髑髏斧牙並輪相，幢幡寶劍及螺貝，
是為八種勝標幟，一切勇士皆具足。
此為《黑怙主現說續》空行母相及手印品第十七竟。

次復宣說諸空行，具足誓戒諸標相。
若能如實善了知，當住空行三昧耶。
赤黃女人蓮華香，目光柔和具愛相，
爪甲赤紅眼亦赤，家繪蓮華而供養，
是為蓮華種所生。眉間具有三叉相，
身現青色淺深相，常修金剛種觀想，
家畫金剛而供養，恒作祭祀不間斷，
此空行母具吉祥，是為黑怙種所生。
額上現有三叉相，或現短矛赤黃眼，
手足皆作赤色相，喜樂雞馬為畜養，
家畫金剛而供養，定是吉祥黑怙種，
決定空行無疑惑。空行金色耀天顏，
雙目不動毛髮延，手印額上現金剛，
常樂害業居王班，慢心誠語茉梨香，
室畫金剛日日觀，羯荼羅族所生來，
金剛薩埵賜福綿。瑜伽尊主喜食肉，
形瘦青目貌清寒，額紋似矛兩叉分，
樂害常入塚間看，無懼不潔任來去，
頂點供養意悠然，室中畫顱敬供奉，
黑魯嘎部空行圓。雲色女子齒參差，
左牙外露慣傷悲，室中畫斧日日拜，
導師部眾定心知。金剛之族黑魯嘎，
為益行者說密儀，
此為《黑怙主現說續》瑜伽相貌品第十八竟。

更有妙法待宣揚，空行往昔說端詳，
女面圓滿鬚眉長，淨衣莊嚴性溫良，
不動誠實樂正法，勇士妹兮蓮印昌，
或結龜印佛瓶灑，十日蓮華供法堂。
垂唇目長赤黃瞳，富貴福德顯殊功，
旃檀色澤齒均齊，雜彩衣裳三紋隆，
笑語歡欣眾隨行，戰陣談論意氣沖，
見其傲慢施矛印，舞態左右應相從。
十四並及八日時，此為供養吉祥日，
室中畫印三叉戟，恆常頂禮致虔誠。
世間自在空行相，如是諸相今當陳。
頰間現有微窪處，赤黃二色相輝映，
碧黃眼色映天真，髮絲纏繞極清雅，
頭額常結彩帛巾，一道紋理向上聳，
頸項修長勝天鵝，喜著紅衣常歡笑，
時時怒氣忽流轉，心緒搖曳多變幻，
見此傲慢著斜衣，當示矛印為真信，
再以鈴印重示之，左轉以作答覆意。
世尊黑魯嘎空行，如是諸相今當說。
身形短小脛粗壯，常樂黃衣著兩肩，
斜披衣褶現雅態，見此女子當速知，
輪印先示為遠照，其次復示螺印意，
左轉答覆成佳話，十四日時為吉祥，
金剛畫於室中央，黑魯嘎尊空行相，
今當略說諸法要。身毛遍布覆全身，
眼色黑黃映天真，身軀豐滿容顏麗，
面龐廣大唇青黑，圓目鼻塌不恆常，
歌聲悅耳出天籟，雲色容貌奪人心，
見此傲慢當速知，龍印以示為遠照，
其次復示矛印意，左轉答覆成佳緣，
十一吉祥之良辰，室中畫牙致供養，
金剛空行諸相狀，如是記取莫相忘。
此為《黑怙主現說續》瑜伽手印品第十九竟。

復次更有妙法陳，空行手印諸密記，
應知兄弟與姊妹，如是了知為真諦。
左手舒展為初機，直言實語應相知，
無名指示為答覆，直言如是真實意。
腹部輕拍表飢渴，額示空中降臨來，
十指入口表飽足，舌動欲食意味深，
膝上輕觸表疲倦，一指輕點意已休，
齒相咬合表食肉，頂髻示意為行持，
眉間皺紋表束縛，迦樓翅展表解脫，
拳印示意當速知，頂髻答覆應相合，
髮相示意當了知，三叉叉印應相和，
肢體搖動當速知，以牙印信為答覆，
手擊手掌表食供，右手示意表行持，
耳根觸摸表安住，爪甲相觸表死亡，
左拇畫地為壇城，膝蓋觸摸表護持，
左拇畫地表尊者，目開闔動表護持，
觸摸關節表安息，使者隨緣而應對。
此為《黑怙主現說續》瑜伽手印密法品第二十竟。

復有手印今當說，肢體手印諸義諦，
婦人頂觸當示意，以頭還答應知時，
若示額間當握拳，見齒當以舌相酬，
若示唇動答膝骨，頸示當以腹相酬，
若人示手答肩臂，腰間示意答其背，
乳房示意答膝骨，腹示當以臍相酬，
密處示意當以根，髀示頭首表其意，
膝示小腿為答還，足示足底為其答，
指節示意以指還，若示大地指天穹，
若示天際指日輪，溪流示意海濤應。
此為《黑怙主現說續》手印品第二十一竟。
復次更有妙法說，隨順肢體勝手印，
若知兄弟與姊妹，決定無疑成眷屬。
一指舒展表遠來，二指伸展為答還，
今說諸瑜伽母眾，肢分手印甚明顯。
二指屈曲如目形，瑜伽行者示此者，
必定終身得加持，秘密灌頂無疑惑。
若人示以中指者，食指還示作答覆，
無名指示舌為答，顱示當以矛相還，
頂門示者髮際應，地示當以口相酬，
眉間皺紋示髮際，若人示齒唇相答，
頸項示意口為還，額示當以眼相酬，
此為諸瑜伽女眾，次第肢節手印法，
此為密印秘密中，正見真實無生法。
此為《黑怙主現說續》殊勝品第二十二竟。

復次更有妙法陳，空行遊戲諸相狀，
勇士遠見空行眾，兄妹眷屬互相知。
具誓依止生歡喜，猶如勇士遊大地，
以地為基作供養，瑜伽戒行當恭敬。
返顧觀看生歡喜，容顏變化現赤相，
眉動常生妙樂意，種種速知諸密行。
空行所生諸變化，輪迴流轉當了知，
三紋圓滿為標記，決定空行眾所依。
當知此為真實相，忽然返覆心生變，
前言轉成後意生，面容改變極明顯，
金剛光明極清澈，聲如鳩鳴常婉轉。
此相家中當觀察，金剛明鏡常相隨，
寶劍明鏡同時現，幢幡常示為標誌。
二相和合鏡中觀，標相形相皆具足，
如是相具空行眾，當知最勝無有上。
此為《黑怙主現說續》空行標誌品第二十三竟。

復次今說密語法，兄妹決定相知時，
波當吉語表安好，答云波底應相知，
伽目表示行去意，魯波表示來相會。
底希表食應知曉，格利訶那表攫取，
毘羅南者為心要，摩羅乃是死聲苦，
迦尼迦者為鈴聲，尸羅謂是解脫道，
迦羅表髮知其意，婆羅即是猪鳴聲。
舒羅麻那為耳朵，曼達那是甘露處，
那羅和合應當知，達利迦者空行母，
甘曼陀魯為壇城，阿目迦者為塚間，
甘毘羅者為門戶，濕婆羅舍婆羅門，
波利達為剎帝利，毘羅帝是吠舍眾，
羯盧達是首陀羅，安陀即是屠夫相，
舒利迦者為屋舍，阿利迦者為牲畜，
荼吉尼者為姊妹，美如迦者為水相，
格利係羅為印封，齒舌相觸表飢渴，
底利舒羅表塗香，庫達何處所從來，
阿目迦答某處至，吉羅表示眾花開，
度目羅者為笑聲，丹達即是降甘霖，
底利巴底表祈請，度利亞者為外方，
度摩底亞為雲氣，跋係羅那表身形，
薩布表示七山巒，薩利多羅表四河，
昂姑利者指分節，跋達那者表面容，
雜利迦者表示舌，安達那者表牙齒，
巴迦底者表幢幡，巴字或表諸莊嚴，
旃陀表示眾花鬘，遮羅即是風氣動，
巴舒表示野獸群，亞底即是曼陀羅，
索桑表示四衢道，帕勒庫善表生起，
摩訶格謝大牲畜，伽表地生那表人，
狗表牛王摩水牛，跋表飲食呵亦然，
阿毘亞迦表使者，惹格表示林中居，
手觸口中表飽足，舌觸表示已滿意，
那悉底者表空無，呵梨表示慚愧意，
觸空表示火燒空，觸上表示上無下。
此為《黑怙主現說續》手印密語品第二十四竟。
復次為求諸所願，八句末添吽吽啪，
為諸信解微劣者，愚癡無知眾生說。
咒曰：嗡那摩巴嘎瓦帝 威熱夏耶
摩訶格巴阿尼桑尼巴耶 雜達摩固達達卡達耶
當師札卡繞札巴夏那目卡耶 
薩哈司拉布雜巴素拉耶
巴爾修巴修地亞達舒拉卡鐸嘎達里涅
比雅嘎拉則那安巴達拉耶
摩訶敦巴安達卡繞瓦布夏耶
卡拉卡拉 俱魯俱魯 班達班達 札薩耶札薩耶
叉巴耶叉巴耶 吽吽 糯糯 偏偏 啪啪 達哈達哈 巴佳巴佳 瓦蘇魯提拉安札瑪拉瓦浪比那
格日那格日那 薩普達巴達拉嘎達布讓崗薩爾瓦
瓦達爾雜耶達爾雜耶 阿卡遮阿卡遮 吽吽
尼永尼永 克善克善 杭杭 欣欣 吽吽
吉里吉里 悉里悉里 希里希里 迪里迪里 吽吽啪
此為《黑怙主現說續》根本密咒品第二十五竟。

復次宣說祕密法，三界難得殊勝咒，
若知黑魯嘎密言，一切密咒皆可捨。
順逆諸法皆具足，使者安住正法中，
上下成就常施與，我之使者遍遊行。
見觸與及親吻時，恆常擁抱瑜伽處，
乃至瑜伽眾圓滿，一切成就皆圓成。
善者當授此法門，餘者終不得傳授，
猶如慈母與姊妹，猶如女兒及妻眷。
恆常授與真實法，是為如法修持者，
次說瑜伽難得戒，男左女右同道行。
欲得成就當如是，住於田野與家中，
雖遠亦能得相知，黑魯嘎外無他法。
上師即是瑜伽母，於此續中修行者，
決定圓滿無有疑，不應輕慢及遠離。
隨力供養諸聖眾，烏面等八諸眷屬，
增長信心與敬愛，常為成就之根本。
修行住處當護持，行者常持諸戒律，
諸續共通無上法，無故不應令戒失。
以信領受諸淨戒，非可眼見手所持，
密法不應輕示人，應當勤勉善守護。
智者小指微動時，使者安住正位中，
清淨不淨與雜染，修行者住三種境。
悅意清淨具功德，具德之人住法中。
此為《黑怙主現說續》觀察弟子與誓戒品第二十六竟。
復次行持諸律儀，使者眾中善修行，
速得成就入解脫，當知使者諸相狀。
遊行諸方與諸境，使者形相如劍鋒，
淨罪增福善功德，修行者得三和合。
成就自得諸悉地，不待持誦與禪定，
迅速即得諸成就，咒印修者善供養。
專注供養得成就，此外更無勝法門，
論中明示無疑惑，樂修使者之道者。
修者勤求得成就，咒印具足善相應，
常當受用諸飲食，瑜伽遍入諸法門。
修者善住三摩地，一切種姓應修習，
飲食無別應受用，於此無有彼此分。
使者修法有二種，修行成就諸儀軌，
唯一使者為根本。
最勝歡喜及成就，諸境自然成就中，
空行眾母悉安住，住彼持誦當修行。
得食第二當了知，遊戲安住諸成就，
修行近於證悟時，諸使者眾善啟發。
上師傳承次第得，灌頂具足善持咒，
是為使者諸法要，手印相應具善德。
無著布施持戒行，智慧因生得圓滿，
善念自性晨起時，一切身業當修習。
超越支分諸兵器，遍身安住悉修行，
清淨所作身相中，恆時持誦諸密咒。
持誦密咒而修習，瑜伽住處當示現，
不應觀修諸兵器，具戒不應起瞋恨。
不違灌頂之教授，與彼同行證安樂，
為求解脫此意趣，當修誓戒諸行持。
愚癡迷亂悉遠離，夜間常著虛空衣，
或著赤黑常轉變，獸皮支分為衣裳。
隨心修習得安樂，供養莊嚴皆捨離，
黑魯嘎尊加持身，五種手印相應住。
於一切時善修習，頸飾臂釧耳環等，
頂戴珠寶作莊嚴，供養塗香恆安住。
夜間常修令明顯，晝則秘密而修持，
智慧作業極隱密，寂靜調伏諸疲勞。
當知清淨有三種，如本相續而安住，
種姓高下勿分別，頂髻等處勿束縛。
使者清淨為第一，第二即是月清淨，
一食清淨為第三，是為清淨三種相。
瑜伽行者常護持，此等清淨諸律儀，
獲得清淨諸次第，成就無從他處來。
如彼攝真經中說，及於勝樂續中言，
密續之中善宣說，如是最勝初續等。
金剛怖畏續中說，持咒律儀得成就，
於此但依禪定力，咒者剎那得成就。
樂修瑜伽道者眾，當善修此諸淨行，
福德清淨所生者，修者功德極廣大。
千面難以盡宣說，一面亦難道其德，
吉祥飲血大智慧，清淨相好皆成就。
樂之福德飲甘露，能淨罪障作怖畏。
觸摸言語諸罪業，一切過失得解脫，
身語無過行持者，最勝眾生諸罪惡。
清淨自性善逝地，次第證得諸果位，
生生世世憶宿命，住於種姓轉輪王。
如是常時供諸佛，信心奉獻諸護法，
如法儀軌作供養，信心隨願作布施。
黑月十日與十二，及至白月圓滿時，
精勤供養當修習，金剛天女以肉酒。
信心供養諸有情，黑魯嘎尊生歡喜，
勝妙心意極悅意，彼等手授勝成就。
夜間持戒作供養，披髮裸身作施食，
了知黑魯嘎本性，瑜伽合一悅本尊。
此為《黑怙主現說續》行持軌則供養施食品第二十七竟。
復次清淨供養法，決定趣向大涅槃，
如是自身作供養，諸佛子等皆供養。
勇士瑜伽眾母等，堅固動搖悉供養，
兄弟讚歎作供養，善住月圓相聚時。
與諸兄弟子俱會，苦樂一切共相生，
密咒手印及智慧，於彼不應為開示。
不信一切生誹謗，淨食受用為供養，
恒時誓戒當修行，密咒不應輕授予。
教授不應令失壞，誓戒住處隨所宜，
教授亦當行布施，除彼使者諸他人。
不應愚迷行貪欲，使者常為解脫因，
精勤修習當受用，下劣種姓勿依止。
灌頂亦非所當為，如母姊妹及女兒，
妻妾使者悉安住，輪圓成就如是行。
非為其他所當為，苦行定當盡無餘，
最勝中下同攝召，如是諸物定無疑。
世間恆時左行道，先舉左足而前行，
先用左手為動作，左道修行作供養。
身之左邊善纏繞，以左滿足受飲食。
持戒不壞得圓滿，修者常住於誓戒，
誓戒種姓諸行持，同受飲食共修行。
四姓一切悉修行，世間種姓分四種，
一切種姓同修持，瑜伽成就善供養。
牛馬犬肉諸雜肉，作成三角曼荼羅，
諸佛尚且能摧滅，何況凡夫諸眾生。
如是勇士受用食，咒印相應作妙藥，
黑魯嘎尊化現身，諸續皆捨此修持。
瑜伽恆時善護持，一切所作諸事業，
無礙如實得成就，於此更無他所證。
此乃使者最勝尊，精進同行相應住，
貪愛受用得圓滿，瑜伽妙物善分別。
喜樂上師諸教授，是為勝施主所說。
此為《黑怙主現說續》內供養與具相儀軌品第二十八竟。
復次更有所宣說，具相使者當了知，
誓戒空行諸住處，如是了知得成就。
兄弟父親及尊主，剎那見之生歡喜，
舌粗眼色赤黃明，毛雖粗硬赤黃色。
一切成就共同因，持咒律儀常歡喜，
具足正念與正知，使者眷屬皆安住。
二十四種勝空行，修行解脫得果報，
成就一切諸所願，常持根本密咒王。
一切魔障悉寂滅，三界動靜諸世間，
瑜伽遊戲施果報，此咒所生皆具足。
咒印相應善圓滿，修持成就極精進，
若離手印密咒者，眾生不得蒙加持。
如是熱力諸作業，精勤修習當證得，
成就一切諸所願，於大瑜伽生瞋者。
百世當生為犬身，復生賤民屠夫家，
譬如有人欲求酥，雖勤攪水不得出。
身唯煩惱徒勞苦，執持供養作依緣，
活命謀生作因緣，依止瑜伽餘無用。
勝妙瑜伽大勇者，住於何方何境土，
雖在蠻夷惡種中，彼土即為所觀處。
為攝眾生作因緣，我常安住於彼處。
此為《黑怙主現說續》使者相狀威力品第二十九竟。
復次更有所宣說，難得祕密今當說，
若人僅以了知故，速得成就諸悉地。
平坦可意諸土地，旃檀塗香作莊嚴，
具足妙香淨地中，散灑新鮮諸花瓣。
香氣馥郁極悅意，自身圓滿諸事業，
結界已畢作加持，畫出四面作供養。
圓形九重善描繪，極為平整無偏差，
一一標列諸文字，其中安住大勇者。
成就一切諸意願，順逆次第善觀察，
母音子音修行者，如是了知眾數量。
三十二格皆攝取，第五音聲為差別，
五十之數善攝持，二十四音為差別。
先取平地，以旃檀塗之，散花熏香，使生勝妙。作泥鼓壇，圓繪九重。
其文字排布之法：
始取三十二格，以第五音別之。取半百之半，即二十五音。復取二十四音分之。又取三十六格，以第三音別之。復取三十二音，以第五音別之。次取二十五音，配二十四音。又取三十三音，配十五音。
如是排布，成蘇姆巴尼大咒。此咒威力無比，諸續無有，能護壇城，降伏諸魔。持誦一遍，不須觀察，即能成就。
加之以“唵”字於前，“吽啪”二字於後，成四句密咒。此為三界殊勝之咒，諸佛所宣，輪王所持。於諸密續，唯此為最。
四忿怒尊、八大本尊，皆依此咒以護壇城。若誦此咒，即能降伏一切惡者，不待觀想，自能成就。
如是密咒之編排，實為難得之法，非具慧根者不能解之。
三界勝者此為名，四句密咒作莊嚴，
唵字一切為明顯，吽啪二字為終結。
輪王佛陀勝密咒，未來未曾有此生，
攝真勝初及勝樂，金剛怖畏諸密續。
四忿怒尊相應住，八身具足作加持，
為護壇城諸意趣，一切惡者作降伏。
僅以宣說此咒力，不須觀察得成就，
輪王瑜伽諸所說，能生一切諸成就。
咒曰：唵蘇姆巴尼蘇姆巴 吽吽呸
唵格日那格日那 吽吽呸
唵格日那巴雅格日那巴雅 吽吽呸
唵阿那雅吙 帕嘎萬 瓦日拉 吽吽呸
此為《黑怙主現說續》泥鼓結界攝咒品第三十竟。
第二十六品明守護誓戒，此三品明飲食誓戒。自此以下三品之首品，明道之密要，修持具相母供養諸物，名曰命氣解脫等，廣明飲食誓戒之義。

大肉能摧諸障礙，金剛所生最勝尊，
此能摧滅諸惡者，威力無比極可畏。
犬豬二肉及家禽，銅冠蓮花同受用，
食用供火與施食，勿應分別生疑慮。
若離疑慮皆成就，一切王位得圓滿。
螺貝珍珠魚鱗等，三者生因雖相同，
法身所成諸眾生，頭骨誰敢生輕毀。
勇士頭骨作花鬘，半月骨飾為莊嚴，
勇士自在諸莊嚴，手印五相今當說。
修行者用左手印，此為勇士五部印，
手指即是佛剎土，諸印善入當了知。
三界動靜諸眾生，皆從左方而生起，
金剛薩埵居拇指，食指即是毗盧尊。
中指蓮花舞自在，無名指住諸成就，
勇士施予眾悉地，小指安住虛空藏。
威猛相好極莊嚴，指甲之上馬頭尊，
此為勇士所安住，一切勇士從左生。
左掌蘊含黑魯嘎，金剛亥母大歡喜，
手背金剛空行母，此為手印諸安布。
一切聖眷悉雲集，如是依法而修持，
供養一切諸勇士，地即眼母為所說。
水界即是摩摩計，火即白衣尊所顯，
風即度母善宣說，準部迦即空性尊。
即是般若波羅蜜，中央安住諸勇士，
智者迎請諸尊眾，密法不應輕示人。
精勤守護密莫傳，如是手指諸印相，
與眾共食而修持，勇士瑜伽同修習。
空行網中勝樂尊。
此為《黑怙主現說續》飲食火供與施食手印儀軌品第三十一竟。
復次當說諸妙法，飲食宴會眾集時，
若知如法諸儀軌，速得成就諸悉地。
修者依前諸次第，召集一切諸牲畜，
五種牲畜當了知，人龜野驢及野狼，
馬等成就壇城中，此等即是成就分。
種性之中牛最勝，四足之中象為尊，
飛禽之中鵝第一，畜生之中牛為上。
田生諸天面搖動，成就所修壇城中，
諸畜成就因緣說，烏鴉水鳥鸚鵡等，
狐狸兩生咒聲大，鶴與山雀皆珍貴，
食用供齋并火供，所願事業悉成就。
黑狗湯及黑豆飯，無畏屍口作火壇，
百零八遍作供養，屍身起已而發問。
地下空行劍成就，摧伏饒益諸功德，
丸藥眼藥諸伏藏，神足長壽諸成就。
一一授與而離去，非由餘道得成就。
上下使者皆成就，此續決定無疑惑。
牛天不溺與餘火，枯竭根住風力持。
大岩洞中自性中，或由龜眾而生出。
速得成就圓滿果，四臂四面尊像現。
乃至十萬手印相，身色潔白大忿怒。
金剛亥母彼尊前，身色兵器皆觀照。
勇士髑髏鬘莊嚴，全身塗灰作嚴飾。
手印莊嚴其身軀，髮髻寶冠具利刃。
面現微露諸利牙，大餓鬼眾為座墊。
從此修者當恆時，了知咒尊而修習。
如是殊勝功德中，修者決定得成就。
此為《黑怙主現說續》畜生與起屍修法及生起次第儀軌品第三十二竟。

爾後行者食道糧，諸種方便無不陳，
飲食壇城勇士眾，隨力所能皆可行。
縱無妙供正所需，五甘露味當加持。
飲食齋供廣大時，當於夜間作法時。
次後使者當供養，向左頭首作示現。
自身頭首置於前，勇士二位無別供。
或母或妹亦可為，女兒妻妾隨緣攝。
如是儀軌相應法，解脫輪迴諸繫縛。
從此咒力得成就，乃至諸法皆圓滿。
上師住於自身中，修行者當受供養。
勇士座位諸壇城，手印無疑皆成就。
修者專注等持中，歌舞伎樂悉隨行。
一切眾生未證得，瑜伽智慧不貪著。
恆轉輪迴無盡期，憂苦煩惱常纏身。
是故修者當一心，手印供養無餘遺。
供養最勝無等倫，輕慢必招燒身報。
瑜伽母續諸教中，大手印法初修習。
如是精進修持時，淨信供養悉圓滿。
此後勇士諸眾等，勇士圓滿皆修行。
如是供養次第成，上行下行得成就。
寂靜增益并攝召，降伏驅逐諸法門。
癡迷僵硬諸咒法，離間降伏諸事業。
修行無待得自然，成就決定無疑惑。
此為《黑怙主現說續》飲食火供與施食手印儀軌品第三十三竟。

空行佛母瑜伽網，輪壇廣大儀軌宣，
一切所作皆宣說，成就無疑當證得。
勇士眾與瑜伽母，蓮花中心當安置，
中脈住處亦如是，乃至眉間當安住。
勇士層疊起貪欲，次後火燒非餘法，
牛肉並及其血液，精進圓滿五蘊燒。
次於熾燃火焰中，五蘊當作所燒物，
次於熾燃大海中，普遍門輪當觀想。
勇士主尊四面相，勇士住處花瓣上，
四使者母諸天眾，勇士無二大樂尊。
依照儀軌次第行，旃荼羅外相應法，
自身形相當執著，輪壇中央當示現。
如是輪壇諸示現，次第成就令明顯，
智慧海中諸勇士，略說此法今宣說。
使者無二瑜伽者，決定成就無疑惑。
此為《黑怙主現說續》使者母無二火供及事業儀軌品第三十四竟。

次後最勝諸事業，如實次第當宣示，
供養無二瑜伽性，諸業各別當修行。
所有廣大咒音聲，依次分類如其相，
色相使者諸咒語，如箭迅速當旋轉。
互結密咒妙法門，依於境界而開顯，
寂靜之法當緩徐，寂靜非為猛暴法，
種子文字次持誦，吽字安於最末尾，
所修息滅得成就，一步亦不能移動，
二者和合成瑜伽。金剛環繞作紐結，
金剛開啟眉間處，如是蜂群作環繞，
鐵鉤本性作招攝，杵臼搗擊作擾動，
金剛口中作吞噬，箭矢射入作相應，
非時死魔得超勝。支分契合喀章嘎，
顱器供養成一味，口中兵器當相應。
此為《黑怙主現說續》無二處所與非時死魔欺誑儀軌品第三十五竟。
其後手印大供養，密咒布設極聞名，
以此手印諸供養，速疾成就無疑惑。
二相咒語相應故，空行勇士無二相，
蓮花光明無垢染，瑜伽行女精通供，
手印調伏諸事業，如是兵器作相應，
咒師空行作和合，以諸心咒亦同修，
撼動空行具慧者，清淨身相當如是。
勇士供養知儀軌，勤作諸事業修持，
分類隨意咒行者，顛倒決定作相應，
摧滅饒益二種故，觀修諸事業自性，
彼等分類細分已，於諸脈道作相應，
修習圓滿瑜伽者，由此修持得成就，
天與非天眾等類，及諸人類速成就。
此為《黑怙主現說續》究竟供養與事業儀軌品第三十六竟。
其後更當為宣說，色相調伏諸儀軌，
互相和合密咒義，空行母與為一體。
酒肉甘露五俱合，持誦終畢當吐出，
夜數七日圓滿時，飲食之中當相應。
此法盡其壽命際，決定獲得自在力。
黃牛酥油飲用已，持誦終畢當吐出，
爾時自身面洗淨，縱使常起大忿怒，
僅見即得自在力。油麻稻米細研磨，
塗身之法當相應，香油持咒作加持，
飲食之中當相應，若非放捨諸事業，
盡壽獲得自在力。黑芝麻與辣椒子，
食畢吐出作法事，復以魯達相和合，
指甲肛門蟲及血，自身精液皆觀察，
飲食眼藥與衣物，塗抹之法當相應，
此法盡其壽命際，決定獲得自在力。
牛肉火供作儀軌，血液塗抹諸天眾，
即刻獲得自在力，若不降伏當死亡。
彼肉置於正面前，或以觀想作火供，
火供終畢行食施，三界剎那皆招攝，
七夜之內得成就。三界難得殊勝法，
誓言行持諸相狀，恆時自咒當秘密。
勤修密咒當秘密，未得密義不成就，
福德微劣不能成，昔有福薄諸修者，
令我歡喜得成就。
此為《黑怙主現說續》內在自性調伏殊勝品第三十七竟。
其後手印諸空行，身相特徵當宣說，
勇士支分諸分類，如是當為作宣說。
勇士自在勿描繪，亦勿誦讀諸經典，
左行諸法善隱蔽，空行密相諸密咒，
若以放逸而宣說，我當不予以觀視，
諸多千數之空行，噉食惡性此等人。
毀壞誓戒作惡行，殺害梵志無疑惑，
造罪愚癡之自性，欺誑惡性此等輩，
縱遭空行而噉食，我亦不予以救護。
密法之中此等人，猶如牲畜無差別，
違逆上師毀誓戒，天界人間當墮落。
吉祥黑怙密咒法，視如己命當護持，
空行勇士善相伴，我當饒益與護持。
上師亦當作加持，修者密修諸法要，
恆時歡喜諸空行，一切成就當生起。
修者威德自在尊，三界虛空遊行者，
勇士修者所欲求，一切時中作供養。
彼得瑜伽生歡喜，善解真實諸布施，
持守黑怙勇士戒，見到上師生歡喜。
修者見此諸密咒，猶如見佛生歡喜，
根本密咒最勝者，勇士七字咒心要，
善能持守此咒者，嗡吽分別作區分。
彼等精進作禮敬，猶如供養諸佛陀，
恆時大勇黑怙主，遊戲相應無疑惑。
從彼心間生空母，勇士瑜伽諸眷屬，
使者眷屬共圍繞，彼所生起諸善業，
眾生見之生福德。江河海洋諸池沼，
山嶽四衢諸通途，臺階深井諸水井，
空屋街衢諸道路，一切處中諸空行，
恆時觀視作護持。大怖畏處尸陀林，
空行地下諸境界，眾多起屍之形相，
可怖形相大力士，與彼同行大勇士，
隨意遊戲無畏懼。山谷密林諸秘處，
密行女人瑜伽母，於彼一切諸方所，
修者地上作遊戲。
此為《黑怙主現說續》瑜伽母地與密勇士咒法儀軌品第三十八竟。
其後修持大瑜伽，  八種咒音當宣說，
爾時瑜者得真見，  決定供養無疑惑。
眾多可怖諸音聲，  難忍空行生恐怖，
極為可畏大勇士，  令彼驚懼皆逃散。
若有勇士不生畏，  以其左手而執持，
攜往自處諸空中，  凡人與彼諸空行，
恆時歡喜作遊戲，  如同極樂之境界。
欲得黑怙尊位者，  攜往空行諸住處。
修者即是咒身者，  無有輪迴生與老，
普攝一切諸有情。
此為《黑怙主現說續》哈哈大笑品第三十九竟。
其後今當為宣說，  令諸眾生得調伏，
安住瑜伽咒儀軌，  一切住於大地者，
勇士持誦得成就。  燈酒共俱諸供養，
魚肉等物作供養，  勇士威力一切時，
七日之中作修持，  夜間專注作火供，
廣大成就得賜予。  百零八遍作修持，
三時之中作修法，  國王軍眾婆羅門，
七日之內得調伏。  半數勇士得調伏，
再半大臣得降伏，  小王三十二遍數，
依次火供作修持。  婆羅門眾二十遍，
七日火供作修持，  王族亦復修七遍，
吠舍五遍作火供，  首陀三遍作修持，
最下一遍作火供。  如是勇士諸次第，
一月之中盡攝集，  具咒修者作修持，
普攝一切諸有情。  勇士依此諸儀軌，
修持欲樂得成就，  猶如地上欲自在，
吉祥具足善緣者，  修者必為諸空行，
悅意歡喜無疑惑。
此為《黑怙主現說續》五族調伏與大手印依止品第四十竟。
其後勝妙諸事業，  修者若能善了知，
調伏招攝與分離，  殺害驅逐諸事業，
昏迷僵硬諸法事，  愚癡並及橛降伏，
奪語成啞諸法事，  聾者並及令盲目，
變化成為黃門身，  色相轉變諸法事。
此等十二大事業，  成就修者若憶持，
決定成就無疑惑。  東方北方諸住處，
空行眾母悉圓滿，  具足智慧自生處，
各方各處皆化現，  金剛壇城勝主尊。
此說空行諸分類，  俱盧陀與寂靜處，
信度之地與城邑，  金洲並及索日國，
如是家中諸天眾，  餓鬼城與雪山處，
甘孜藍巴迦之地，  迦陵伽與憍薩羅，
底舍俱尼奧德與，  迦摩露波摩拉婆，
天城並及勝自在，  瞿陀跋利阿布提，
烏仗那與札蘭達，  布盧與及摩耶等，
此等諸地之女子，  勇士無二瑜伽母，
彼等具足妙欲相，  意力速疾得趣入。
瑜伽母六俱盧陀，  寂靜之地諸天母，
信度之中為喇嘛，  種姓最勝那伽拉，
藍巴並及索日國，  種姓天母眾中尊，
餓鬼城中大黑母，  空行俱入如毗尼。
雪山甘孜般遮羅，  家中天母迦陵伽，
持戒者眾皆是也，  憍薩羅中食肉眾，
餓鬼城中得成就，  金剛空行粗威力，
底舍俱尼旃荼羅。  如是布盧摩耶等，
金洲毛髮諸女眾，  二萬一千為數量。
超出彼等諸數量，  吉祥黑怙尊壇城，
輪壇瑜伽眾母等。  吉祥黑怙大搖動，
彼之壇城主尊母，  二十四位空行母，
動靜三界諸世間，  遍滿一切諸有情。
此等空行誓言者，  修持化身為最勝，
禪定等諸諸法門，  地上一切皆圓滿。
咒師恆時住等持，  夜晚裸身當修持，
或男或女皆可行，  瑜伽母與勇士喜，
手印舞供養方便，  恆時供養自性尊，
無餘一切得成就，  左道供養善趣入。
此為《黑怙主現說續》二十四字壇城布置儀軌品第四十一竟。
其後勇士花與水，  飲已此咒當憶念，
手印俱時諸修者，  夜間恆常食肉行。
三咒修法此為要，  證得成就之安樂，
飲用並及行布施，  無始無終亦無中，
輪迴變化亦如是。  觸碰俱時大主尊，
真實清淨之行持，  始終歡笑手印法。
觀視妙相具聲譽，  或於夜晚或晝日，
以此笑聲當修持。  色相業力諸密義，
如其住處勇士聽，  恆常生起彼淚流，
信心令其毛豎立，  金剛不得踐踏過，
如是方位衣供養。  左道自在諸尊眾，
此為手印眾次第。  出入動搖與笑等，
嬉戲舞蹈妙相好，  種種示現於面前，
手印咒語當憶持。  哈哈嘿嘿八種相，
笑聲種種勝歡喜，  哈哈音聲當觀察。
啼哭恆時得讚歎，  由此彼得生歡喜，
咒語禪定善相應。  主尊眾等諸勇士，
毛豎俱生樂無間，  金剛不可踐踏過，
左道遍察為標記。
此為《黑怙主現說續》空行母色相轉變與笑聲咒語儀軌品第四十二竟。
其後六字咒主尊，  憶念此咒善修者，
哈哈嘿嘿八字相，  此等音聲善憶持。
其後空目善觀察，  勇士無二凡夫眾，
住處分別儀軌知，  修持常生大歡喜。
四衢路口與家宅，  勇士住處諸山間，
空行誓句住其處，  遠處亦能得觀察。
手印裸形作供養，  業力解脫諸束縛，
衣著之外諸覆蓋，  欲者不得觸其身。
如是垂髮得解脫，  修者發起諸事業，
根本密咒與威脅，  結界四方作加持。
天與非天眾會中，  不見供養作修持，
盛花器皿滿注之，  擲向空行得上騰。
花朵落地未至時，  彼時即得成隱形。
住於勝妙諸聖地，  空行千數遊行時，
得住自在諸聖處。  語自在母諸空行，
語自在尊能招攝，  諸天天女善言談，
地下一切所有處，  星宿運行皆了知。
國土並及寂靜處，  城市四衢諸道路，
獨樹及與勇士宅，  山頂並及聖像前，
恆時持誦心心咒，  天人不見其形相，
是故一切諸方所，  修者常住不為見。
樹梢紅色善思維，  七字自性諸密咒，
堅固不壞得摧落，  山王亦復不例外。
自身安置眾飾印，  地鋪吉祥茅草坐，
七字自性善安住，  百八遍數作持誦。
夢中一切諸所作，  意中所欲皆示現，
非時死難與損壞，  一切所作諸事業，
種種差別此與彼，  夢中一切悉示現。
如是持咒劍與水，  拇指燈火與明鏡，
持咒瑜伽常住者，  般闐那中得降下。
修觀七遍作持誦，  善惡二相得示現，
其後勇士七字咒，  布列咒字諸分類，
日輪中央作觀想，  持誦乃至千遍數，
猶如水晶之形相，  病苦眾生當觀視。
拇指剎那善作用，  諸病消除無疑惑，
病苦解脫得自在，  猶如秋月之清淨。
月輪中央作布列，  左手輪壇作莊嚴，
文字如同水晶色，  五種色相當觀照，
一切病苦作安置。  熱病魔障與癲狂，
諸痛並及癩病者，  中毒眾生諸病苦，
月輪文字作觀想，  十方散射作驅除。
夜晚祕密而安住，  牛肉和合三甘味，
七字密咒善了知，  百零八遍作火供。
咒師晨朝之時分，  千兩黃金得獲得，
火供千數十萬次，  小國勝處得成就。
或以密咒大王咒，  隨念何處得往生，
彼處決定得受生，  此事決定無疑惑。
白色能作諸寂靜，  黑色剎那能奪命，
紅色能作諸攝召，  剎那決定得招來。
黃色一切作鎮伏，  此乃論中決定義，
黃色能伏諸軍眾，  船舶機關與象眾。
白色僅憶念一次，  決定能延死亡期，
百蛇齧咬臨死時，  速疾能除死亡難。
毒氣昏迷諸眾生，  明顯作用得消除，
熱病魔障與癲狂，  見手恐懼皆遠離。
賭博緊握作拳印，  心中恆時作持誦，
乃至拳印未開前，  一切僵硬得成就。
設使怨敵手中持，  種種兵器作揮舞，
乃至拳印未開前，  兵器不能作投擲。
或者一切諸事業，  如其所欲作成就，
稻穀花果與樹葉，  牙粉並及諸飲食，
身之相應最上者，  如是第二具威力，
第三即是外相應，  第四無有所緣慮。
七字密咒王成就，  大地山林共一切，
大海繫帶亦無妨，  於彼決定得成就，
此事決定無疑惑。  三界動靜諸有情，
能作呵責作利益。
此為《黑怙主現說續》近心咒事業成就儀軌品第四十三竟。
其後得使者之時，  七字具足作修持，
何處善作諸事業，  彼業速疾得成就。
如是復次七字咒，  手掌中央作布列，
瑜伽六母善安住，  六輻輪中善安處。
左方輪中作勸請，  憶念所攝諸身相，
口誦密咒大王咒，  所欲招攝手指示。
彼定招攝無疑惑，  紅檀香末並俱時，
辣椒並及鹽為伴，  所修足印泥和合。
二手揉合作順適，  瑜伽母供作火施，
夜晚屠夫火焰中，  塚間火中散粉末。
所修對境善和合，  如是事業當發起，
乃至百遍作持誦，  彼定招攝無疑惑。
國王自身並其財，  一切悉皆得自在，
此等修法得成就，  餘處我不作宣說。
取彼塵末善揉合，  鐵粉和合作一處，
塚間布包善包裹，  七遍持誦四衢中。
深掘八指作埋藏，  敵人名字皆書寫，
彼名所說得隱沒，  彼當速疾得鎮伏。
取此粉末善揉合，  清淨牛乳作和合，
若欲再得作救護，  決定成就無疑惑。
取此粉末善揉合，  五種醉物作和合，
塚間布包善包裹，  敵人名字作纏縛。
百遍持誦咒語已，  速疾埋藏塚間中，
剎那即得成狂亂，  取出即得得解脫。
取出衣物遠離已，  精進牛乳作和合，
再得救護作修持，  此事決定無疑惑。
此為《黑怙主現說續》六瑜伽母與七字事業儀軌品第四十四竟。
紅花萬八獻供時，牛乳淨洗誦真言。
七日持誦花冠上，流水投之祝願成。
十一日中取花時，大河逆流現瑞相。
飲其清流得成就，密咒威力震十方。
百結相纏作法時，百八持誦結印成。
三時運轉小指動，七日之內降婆羅。
帝釋必降無疑慮，旋取紅檀作像形。
三辛塗身脂油潤，密處銅針施點明。
無煙檀火燒香時，百遍持誦燃火明。
王臣眷屬皆攝召，妃嬪侍從盡歸心。
人王眷屬悉降伏，茅葉書咒密壇成。
屍陀林衣墨香畫，名號相連祝願誠。
火中煉治至脂融，轉輪聖王皆攝降。
足跡紅檀灰合時，無煙檀火作供養。
兩手揉搓施火中，一切所願皆圓成。
取彼灰粉凝神住，氣絕心迷降福靈。
風力自至修者前，牲畜使者皆來臨。
紅花新枝濕潤取，火中煉之不焦枯。
速取七遍持咒力，旋轉一刻感召成。
男女隨風來歸順，紅花百誦星宿明。
塗香投花水中住，臍沒水際立中央。
千遍持誦真言力，雙手和合飲甘露。
從此修者得成就，言語威力震八方。
王妃意念皆攝召，諸天修羅盡歸降。
忿怒語言能殺敵，離間驅逐隨心成。
修者言語具威力，降伏一切諸魔精。
江河車轍並大海，象馬雲霄任運行。
人或諸業皆降伏，意願所求盡如情。
復說諸法不思議，大勇自宣密要成。
一切女人皆迷醉，日月蝕時修此經。
紅花採取作法時，七遍持誦安密處。
合花二朵如理修，密處和合作法成。
無二智慧瑜伽住，百遍持誦真言明。
取花修者擊額時，剎那之間得降伏。
心神昏迷失本性，百節肢體任所行。
信心永固無退轉，剎那攝受得圓成。
此法現前必成就，如意自在無不從。
此為《吉祥勝樂金剛續》六瑜伽母語言成就及召請法儀軌品第四十五竟。
五字訣中具秘密，一切事業悉能成。
但知密義得成就，速證三昧第一明。
五字真言如次第，兩手相摩作加持。
口出鮮血敵即死，莊嚴顱器畫輪時。
無名指血塗其上，直待枯涸敵命終。
若生忿怒目赤時，千軍萬馬皆當滅。
貓狸鼬鼠與野狗，烏鴉水鳥諸飛禽。
供養空行作護摩，速得成就無疑慮。
兔毛搓線誦千遍，繫於頸項化其身。
手結密印千遍誦，紅花一一持咒言。
若觸孕婦胎即轉，放之自在得解脫。
作彼恐怖印能死，再施甘露還復生。
吉祥勝樂五字法，事業儀軌品已竟。
此為第四十六品。
復說密法不思議，空行心要最勝明。
但誦真言得成就，一切悉地皆圓成。
恆持密咒獲福德，廣大吉祥皆具足。
人骨為樁六寸長，百八持誦密埋藏。
斷彼種族無後嗣，田疇牧場皆衰敗。
若欲調伏諸君王，泥塑像形八寸長。
置於門前作供養，檀香花果護摩施。
百千供養得成就，攝心入我任驅使。
此咒能作諸事業，召請鎮壓并迷惑。
枯竭昏沉奪辯才，致盲放逸皆能為。
若欲男女相轉化，屍花果實鴉爪塵。
兔血和合十一丸，依時密置頂即變。
若欲化人為犬形，鐵屑塗抹鼬額間。
七夜持誦至千遍，第八加入紅花末。
百八持誦作供養，頂上塗抹化為犬。
若欲復人本來形，夜中供養諸空行。
若欲點金成他物，金樹果實作護摩。
百遍供養成非金，訶子護摩還本相。
若欲降下諸災禍，猛禽巢木作供養。
七日之中現災變，以稻護摩得消除。
月蝕之時採貓毛，持誦其名作護摩。
取彼灰燼置頂上，立成貓形無異相。
若欲復歸人身形，拭除頂灰誦密言。
烏筋為線百八誦，繫於頸上化為烏。
隨諸眾生取其筋，持誦為線系頸間。
即得轉成彼等身，烏燕孔雀水鳥形。
貓頭鷹與鷂鷹等，禿鷲之形皆可變。
牛毛為線八百誦，繫頸即成大牛身。
四足獸毛皆可用，持誦為線繫頸間。
隨其所繫成其形，解之還復本來身。
於穀持誦入他家，半獻主人半自留。
頂上灑之作灌頂，七夜之間穀自來。
吉祥勝樂金剛續，諸佛空行密咒法，
一切事業行品竟，此為第四十七品。
復說密法不思議，空行眾尊樂中尊。
瑜伽自在心要門，成就一切諸事業。
但作憶念能搖動，三界眾生悉震驚。
漸次證得諸悉地，無欺誠實皆圓成。
咒王具德最勝明，成就一切善妙事。
空行瑜伽諸尊眾，康達羅訶拉瑪等。
三十七尊咸攝入，此咒總持最殊勝。
地下天界人間中，一切事業但誦成。
更無勝此微妙法，三界之中最無上。
無與倫比最究竟，成就一切諸事業。
空行眾尊所住處，略說非為廣宣揚。
花果莊嚴妙山王，毗婆羅山勝境中。
常修觀想於其上，空行拉瑪諸尊眾。
康達羅訶瑜伽母，勇士之中最勝尊。
哈哈吽吽大歡喜，二十四勇圍繞住。
空行網壇勝樂尊，金剛薩埵毗盧主。
蓮花舞自在天王，吉祥黑怙虛空心。
馬頭明王寶金剛，大力尊眾為前八。
妙眼大怖金剛賢，極賢吽聲大勇士。
金剛螺髻諸勇尊，此為後八語勇士。
新苗金剛身尊等，無量光佛天鼓音。
利牙外露大骨尊，顱骨碎片諸勇眾。
二十四勇遍三界，勇士空行諸眷屬。
瑜伽母眾極忿怒，一切身分皆所依。
修行者應觀明見，輪壇圓滿入諸身。
安住等持成就義，恆修輪壇自性觀。
如前所說諸儀軌，供養空行勝樂尊。
大輪即是成就處，十億諸佛共宣說。
空行各有俱胝眾，眷屬圍繞常護持。
瑜伽空行諸尊母，具相生支諸天眾。
拉瑪等尊皆具足，成就一切諸善業。
此為《吉祥勝樂金剛續》勇士空行密壇大曼荼羅品第四十八竟。
復說畜生七世法，一切事業成就門。
但須憶念即成就，稻米塑造畜生身。
龜馬豬狗並野狐，烏鴞鷹鴿眾飛禽。
鶴與鴉鵲諸禽類，七世乘轉當觀察。
一世二世與三世，四世五世續不絕。
六世七世生生中，必定輪迴無間斷。
口中香氣極芬芳，眼光不瞬皆明亮。
言語誠實見者喜，恆愛聖法知宿命。
身有妙香常不變，具此相者當知是，
七世轉生之聖者。食此即得天人身，
持用點額成妙相。剎那即得空行果，
自在變化無礙礙。心意所欲諸形相，
皆能隨願得成就。妙樹汁液與牛黃，
點於額上無疑慮。畜生毛髮為繩索，
頂戴手持得解脫。五支具足諸相好，
和合毛髮為繩紐。頂戴手持應無疑，
必定化現彼形相。修者持咒修觀想，
世人雖具勝福緣。難行罪業所愛樂，
悉地道路皆遮障。象馬驢龜與駱駝，
豬狐鴉鴟并鷲鳥，鶴鷹大鵬諸禽獸，
妙相醜相皆能變。修者大勇隨心轉，
決定化生無疑慮。更無勝此微妙法，
三界之中最無上。
此為《吉祥勝樂金剛續》七世成就變化身相品第四十九竟。
復說護摩勝妙法，攝伏一切諸眾生。
但作憶持即成就，速獲悉地無疑慮。
牛肉美酒相和合，左手護摩作供養。
諸佛尚且能降伏，何況世間諸小事。
嘔吐楊枝及淨齒，自身塗香皆可用。
名字美酒相和合，三界有情悉歸降。
月水淨血及餘食，頭髮相混作供養。
剎那能攝諸眾生，自身所出諸穢物。
頭髮楝木共護摩，剎那能令眾分離。
油香烏羽相和合，作法能令敵遠離。
睡時醒時諸時分，修者持誦無間斷。
魔障不能為障礙，百子草木作供養。
滿月三月修此法，能除世代諸貧乏。
人肉美酒共和合，百八護摩三時行。
六月修習此妙法，一切大地皆降伏。
空行歡喜賜王位，此為必定無虛謬。
觀想諸尊作供養，二時護摩勿間斷。
此身即得虛空行，牛肉酒供作護摩。
速得成就諸悉地，一切事業皆圓滿。
夜誦真言作護摩，一夜能摧一國土。
日日修持不間斷，自然證得王者位。
菩提樹果無花果，百千護摩得速成。
富貴自然來歸附，牛肉美酒共和合。
若欲王位作供養，瑜伽自在生歡喜。
貧窮豈能得久居，牛肉護摩諸悉地。
隨心所欲皆成就，牛肉護摩最殊勝。
速得富貴等諸天，雖無清淨諸律儀。
依教修持得成就，吉祥悉地皆圓滿。
更有諸藥并靈草，能令猛獸口自禁。
復說密法不思議，諸地聖眾遍莊嚴。
極喜離垢發光地，焰慧難勝現前地。
遠行不動善慧地，法雲灌頂諸聖位。
依此外內壇城法，十方淨土遍莊嚴。
金剛薩埵勝主尊，十二臂足具莊嚴。
千目千頭遍觀照，普度一切諸含識。
是故為求諸悉地，當以禪定淨心修。
為利行者說此法，秘密真實微妙門。
此為《吉祥勝樂金剛續》護摩供養修行及十地品第五十竟。
復說密法不思議，甚深教授難得知。
勇士密語深隱義，吾以經中密藏之。
衣冠五印諸標相，阿里迦里音聲中。
空性無我為前導，能入音聲悉圓成。
甘露遍滿寂滅境，四大護法勝雙運。
一切真言作供養，十四真如略說明。
最勝丈夫行諸善，滌除一切諸罪業。
證得如來淨妙地，佛果未得轉生時。
十四真如常修習，王位未來必得成。
乃至宿業諸習氣，盡滅無餘為法相。
十四真如恆修者，能為諸國小王主。
罪業滅盡如酥油，置於火中漸消融。
爾時容器亦清淨，如是吉祥黑怙主。
聖號能令罪業滅，讀誦書寫獲福德。
或生天界無色界，或生人間轉輪王。
瑜伽行者臨命終，三十七尊來迎接。
手執蓮花諸幢幡，種種音樂妙歌詠。
世間諸天皆來集，瑜伽行者得接引。
如是大德持明士，瑜伽女眾極難得。
吉祥黑怙大密續，若人不信此深法。
貧窮困苦常相隨，眾飾莊嚴具威德。
頸珠臂釧耳璫等，頭冠瓔珞五十珠。
禪定山頂蓮花中，阿里迦里所化生。
中脈明顯最勝尊，金剛鈴印持護身。
二十四尊半圓滿，勇士瑜伽眾圍繞。
吉祥黑怙大勝王，無上果位當修習。
諸勇瑜伽眾圍繞，壇城中央具莊嚴。
一切歡喜無二法，種種方便化群生。
甚深法義若宣說，或有眾生不信受。
勿生輕毀諸過咎，法性難思當憶念。
此中密意唯佛知，過去未來諸如來。
不可思議真法性，離增離減常安住。
如是安立諸法已，眾生無量難思量。
佛陀遊戲不思議，經乘行乘瑜伽乘。
密乘究竟諸差別，眾生隨樂各信受。
吉祥黑怙大密續，降伏煩惱最勝王。
大勇聞誦皆成就，一切智者無能敵。
最勝之中最勝者，吉祥勝樂大輪王。
此大瑜伽密續王，五十品竟圓滿成。
達瑪跋摩與智稱，仁欽桑波共譯畢。

後由大德蘇摩底，祈爾底與洛追札，
復次校訂善圓滿，譯跋至此一併終。</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  }
]
