[
    {
    "id": "星相算命_001",
    "tibetanTitle": "༄༅། །དཔལ་དུས་ཀྱི་འཁོར་ལོའི་རིག་པ་རྩིས་ལ་འཇུག་པའི་སྒོ་སྔོན་འགྲོའི་རིམ་པ་རྣམ་གྲངས་མདོ་བཅས་རབ་ཏུ་བྱེད་པ་དྲི་མེད་འོད་ཟེར་མཛེས་པའི་རྒྱན་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་བཞུགས། །",
    "chineseTitle": "《吉祥時輪數理入門基礎明鏡善說論》",
    "author": "才旺諾布 造",
    "category": "星相算命",
    "tags": ["星相","時輪","時輪曆算"],
    "ContentTibetan": "<p class=\"tibetan-text\">ཨོཾ</p>",
    "ContentChinese": "<p class=\"chinese-text\"><p class=\"poem-block\">嗡娑帝 那瑪 室利 薩曼達 巴札嘎喇 匝札雅<br>卷一：基礎圖算入門品<br>一、開篇禮讚<br>遍智善巧濟群生，甘露源處寂怙主，<br>具德上師佛陀前，虔誠信心稽首禮。<br>二、著述緣起<br>少壯之士志弘遠，數理明晰通算學，<br>欲入此門求究竟，此乃至寶眾所需。<br>初習圖法諸要訣，秘傳悉數不隱匿，<br>淺顯直述易解文，讀之即可增智慧。<br>三、文字總說<br>首論確立諸要義，音聲言詞符號等，<br>文字形貌所呈現，實乃佛陀勝事業。<br>歷久浩瀚難計數，當知不可思議然，<br>此土娑婆閻浮提，域區各處語言異。<br>四、書寫規則<br>天竺尼泊爾藏地，字符相連成行列，<br>縱橫相接為定制，別論外餘通常然。<br>文字體制盡如是，書讀之法皆相符，<br>首端起自左方始，終至右側而行進。<br>五、數字書寫法<br>今為近要所論義，算師圖法諸通則，<br>數符轉化為算號，九數一點共成十。<br>文字符號任便用，大抵相合而無異，<br>算法如是而運行，繪圖之時作記號。<br>異於尋常字體法，下起上行為書寫，<br>何故一十百千等，自末向上而數之，<br>算號書寫從下起，抑或自右而為之。<br>然讀之時同常例，自上而下如是時，<br>多數上起為其例，如二萬千六百言。<br>六、數學符號運用<br>左右分位為其法，下標轉數書於末，<br>百數之末兩點現，千數之末三點成。<br>萬數四點十萬五，四分轉數各有分，<br>此理推廣復生他，分轉無誤為其要。<br>七、分數記法<br>半標橫線為記號，三分三角四分方，<br>如是繪之諸賢言，除分合併法示之。<br>除法得數有誤差，合併多無誤差現，<br>除法零散當匯總，合併示現剩餘力。<br>八、除法运算规则<br>餘者理則皆相同，平除自得所得數，<br>宣除下數為依據，過多下數不能得。<br>過少下數重得餘，此等過失當遠離，<br>是故多寡得其中，除數未定上數者。<br>九、進位法則<br>十數上溢九數盈，上行百位自然成，<br>十位千臨點現處，八數依舊一位明。<br>百有八數為常法，千萬億兆循此程，<br>智者當以理通達，更有妙理細推尋。<br>十、循環计算法<br>除數被除若相等，各自周轉得圓成，<br>被除倘若多於數，所得之數為周程。<br>若無餘數盡除盡，或因不足未得成，<br>當知其數未圓滿，此理常用記心中。<br>十一、分數计算法<br>更有玄機當細究，被除之數若為真，<br>二分所得之商數，恰是被除一半真。<br>三四五分亦如是，所得之數各有因，<br>若遇零散當會合，數理玄機細察真。<br>十二、时空度量衡换算<br>時與方位物度量，精粗大小有次第，<br>自下向上層層增，由上向下次第分。<br>且說一日分六十，時辰復分六十刻，<br>一刻又分六息間，展轉細分難窮盡。<br>十三、長度换算<br>由旬分作八由延，由延五百弓為度，<br>一弓四肘度分明，一肘二十四指量。<br>七分次第細推尋，蟣虱毫末微塵量，<br>象羊兔塵次第行，水鐵微塵至極微。<br>十四、总结<br>此中所述諸法門，文義精確記心中，<br>算理入門基礎法，萬勿輕忽需用功。<br>雖是初階基礎法，實為入門要徑途，<br>功小利大不可廢，至為珍貴密要符。<br>十五、謙辭迴向<br>智者久習本無待，此文何用徒費言，<br>然為初學諸學人，輔助記憶除疑惑。<br>如是天路耀明星，淨善願言化玉珠，<br>願以此福證菩提，利濟有情無窮盡。<br>是為《時輪數理入門基礎明鏡善說論》第一品：基礎圖算入門品竟。<br><br>卷二：數量類別與術語品<br>第一章 乘法總說<br>一、九因歌<br>今說算數諸理法，基數次位與別名，<br>且述其中要義端，首論九數乘法歌：<br>九一即九本自然，九二得數十八全，<br>九三二十七為度，九四三十六方圓。<br>九五四十五當知，九六五十四分明，<br>九七六十三無差，九八七十二為程。<br>九九八十一告成，此為九數乘法竟。<br>二、八因歌<br>八一為八本自然，八二十六理自彰，<br>八三二十四為數，八四三十二方量。<br>八五四十無有差，八六四十八堪詳，<br>八七五十六分曉，八八六十四圓當。<br>三、七因歌<br>七一為七本如是，七二十四無別理，<br>七三二十一為數，七四二十八可知。<br>七五三十五分明，七六四十二應知，<br>七七四十九圓滿，算盡七數歸於真。<br>四、六因歌<br>六一為六理自明，六二十二無別增，<br>六三十八數已定，六四二十四方成。<br>六五三十無有差，六六三十六圓清。<br>五、五因歌<br>五一為五本自然，五二得十無偏差，<br>五三十五理可明，五四二十數方圓，<br>五五二十五為度，此為五數乘法盡。<br>六、餘數乘法<br>四一為四四二八，四三十二四四寺，<br>三一為三三二六，三三為九二二四，<br>一一唯一無他增，圓滿得數點為記。<br>如是九數諸乘法，口熟心記最為要，<br>若欲圖式清淨成，未修遽教徒勞然。<br>第二章 大數位次<br>一、基本大數<br>諸佛所契算師知，三藏所詮大數名：<br>一十百千萬億兆，京垓已上更相增。<br>大數冠以月名者，億億兆兆重重增，<br>二十一位大數名，遞增十倍無窮盡。<br>二、佛經大數<br>大方廣經所宣說，世尊童年算術時，<br>展現算數不思議，一一大數具體名。<br>始從億兆至無盡，七十一位為其量，<br>十倍遞增無有窮，唯佛能知餘莫測。<br>第三章 數字異名<br>一、基本數名<br>自性本質與形貌，月兔同表其為一，<br>方位眼足表為二，時火所燒表為三。<br>四海明論表為四，箭與帝王表為五，<br>時光與味表為六，聖者星宿表為七。<br>龍蛇財寶表為八，九曰星宿與空竅，<br>十方不易表為十，十一諸神與猛獸。<br>十二宮垣日所行，十三醉心與欲念，<br>十四意根與人王，十五月德與時節。<br>十六君王十八過，二十四聖二十七，<br>星宿運轉三十二，齒德圓滿盡無餘。<br>二、異譯辨析<br>梵語億兆諸異名，翻譯差異須明辨，<br>洛叉俱胝諸梵文，譯者各異理可通。<br>藏地古譯有異名，察之源自梵語異，<br>此中已說諸要義，餘者當於本書尋。<br>第四章 結語<br>算數名相雖繁多，約定俗成無定因，<br>智者善解此道理，不執名相得其真。<br>長生天路耀明星，淨善願言化玉珠，<br>願以此福證菩提，利濟有情無窮盡。<br>是為《時輪算數入門》第二品：數量類別與術語品竟。<br><br>卷三：論時數曆算<br>第一章 總論時數<br>今論曆算諸要門，所推所算基本因：<br>年月時節與宮位，呼吸權衡百刻分。<br>七曜日數諸宿度，相會對照力時輪，<br>因緣內外皆相應，略述大要示其真。<br>第二章 年號命名<br>一、年號總說<br>日行十二宮位圓，月有晦朔二十四，<br>四時寒暑春與秋，周而復始號為年。<br>梵語稱謂有四義：計數所數往來轉，<br>無死藏論善演說，如是年號各分明。<br>二、六十年號<br>聖土外教諸算家，日輪周天為紀年，<br>勝樂註疏所宣說，六十年號列於前：<br>最勝最明白淨年，醉生主宰火耀年，<br>德容盛壯青春歲，持主自在豐實天。<br>柔順降伏群牛歲，雜色日光解脫年，<br>地主無盡調御歲，普持勇主變化年。<br>驢歡勝者勝利歲，勝者醉象醜面年，<br>金垂天垂轉易歲，普具躍動善作年。<br>妙作忿怒珍寶歲，威伏獼猴斧鉞年，<br>寂靜共違違逆歲，攝持放逸歡喜年。<br>羅剎阿那赤黃歲，時使圓成名譽年，<br>智難鼓音赤行歲，欲主忿怒窮盡天。<br>三、十二生肖<br>摩訶支那典籍中，雄雌配偶十二辰：<br>鼠牛虎兔龍蛇走，馬羊猴雞狗豬循。<br>五行相乘六十歲，次第輪轉古今遵。<br>四、五行與年號<br>大漢五行諸符號，揭己公庚戊為名，<br>木火土金水次第，如同梵音韻母聲。<br>漢土文字諸韻律，盡依此理作規程，<br>首始木鼠為元始，終於水豬六十成。<br>第三章 月號命名<br>一、月份總論<br>黑白二月各分時，十五日數兩周圓，<br>梵語稱月薩摩娑，別有異名今當宣。<br>漢土以鬼時節終，大月胡韃諸部用，<br>藏地論典諸大義，天竺通用吠陀經。<br>日月宮位與星宿，勝者密續諸經中，<br>因緣名數諸差別，凡此八類各分明。<br>二、十二月名<br>黑月始自羊宮起，諸曜常行此為先，<br>是故曆算月之首，始自黑月此理全。<br>蛇月夏初第一月，胡月三春中時分，<br>聖土黑月羊宮位，密續名相群牛月。<br>馬月盛夏第二時，胡曆四月春末分，<br>聖土四月雙宮位，密續根身龜蛇月。<br>羊月夏末第三時，胡曆五月夏初分，<br>昴宿之月天蠍宮，因緣觸入水獸月。<br>大猴秋初第一月，胡曆六月仲夏分，<br>尾宿之月射手宮，所觸水獺之月名。<br>雞月秋中第二時，胡曆七月夏末分，<br>量宿之月獅子宮，渴愛麝香月亦然。<br>狗月秋末第三時，胡曆八月秋初分，<br>大月處女星宮中，有支月亦名龍象。<br>豬月冬初第一月，胡曆九月仲秋分，<br>秤宿天秤之宮中，後有飛行之月焉。<br>鼠月冬中第二時，胡曆十月秋末分，<br>尾月天蠍之宮位，生命夢幻之月名。<br>牛月冬末第三時，胡曆十一冬初時，<br>角月人馬之宮中，老死地主月亦然。<br>虎月春初第一月，胡曆十二仲冬分，<br>星月摩羯之宮中，因緣無明月增長。<br>兔月春中第二時，胡曆正月冬末分，<br>軫月寶瓶之宮中，行為月名癡暗時。<br>龍月春末第三時，胡曆二月春初分，<br>昂宿雙魚之宮中，識月亦名為善月。<br>三、其他月名<br>如是月名諸類別，編列易解今略明，<br>漢語月名諸古德，稱作越歷舊傳承。<br>漢地曆書記月數，一月至於十二月，<br>親月二月參月四，五月六月七月八，<br>九月十月十一月，十二月名次第全。<br>第四章 時分論述<br>一、大時分<br>總論時分諸層次，成住壞空四大分，<br>圓滿三滿二滿世，鬥諍末世次第循。<br>壽命福德富貴時，佛法住世四時分，<br>持明王朝四時節，時數年月皆具陳。<br>二、小時分<br>九曜一餘定生起，同入宮位盡行時，<br>空入之名分四際，後代智者立此規。<br>附論時算諸典籍，彈指六十四分微，<br>極微剎那更細分，百二十分成剎那。<br>三、日分論<br>六十剎那為一息，三十須臾成一時，<br>三十晝夜成一月，十二月圓歲已週。<br>又如獅子請問經，紡織匠師紡一縷，<br>長短適中線一條，此為最短剎那時。<br>百二十分成剎那，六十剎那為一息，<br>三十息為一須臾，三十須臾成一日。<br>四、其他時分<br>又有眨眼二為度，四度難成十六分，<br>一時辰也如是增，須臾時分皆相應。<br>晝分十五依日影，夜分依於更點燈，<br>名相各異有別稱，諸說不同今具陳。<br>五、總結<br>無死藏論及別說，眨眼十八為一度，<br>三十分之三十時，剎那十二成須臾。<br>須臾三十成一日，十五日來成一祭，<br>二祭一月三月時，六月周天歲已終。<br>第五章 時分結要<br>時分名相如上述，一歲時分諸要門，<br>吉祥無上佛密續，時輪所攝世間品。<br>諸經論中說六時，或五或四或二三，<br>醫方八支與律藏，涅槃經中具宣說。<br>第六章 醫方時節<br>一、季節劃分<br>醫經律典諸經論，尼薩耆經與戒論，<br>日藏金光涅槃經，漢地譯本所宣說：<br>冬春夏秋四時分，各具三月為定制。<br>二、其他分法<br>律華經中並阿毗，春夏冬季三時分，<br>孟仲季節攝其中，諸佛以冬為首位。<br>餘者皆從四時行，黑月為始春季起，<br>四時年首雖不同，春初配以寅卯辰。<br>漢土至今仍奉行，孟春建寅為歲首，<br>觀音化現藏王時，年首定在二月中。<br>三、密續之說<br>總攝時輪四怛特，金剛空行海潮教，<br>同顯因緣月之始，二月無疑為年首。<br>世間眼目古智者，以寅為春立定規，<br>通說春初等梵音，譯師順應藏地語。<br>第七章 二分論<br>一、南北二分<br>日行南北二分野，印度東方諸國土，<br>此道亦可為年期，此時冬月為年首。<br>無死獅子藏中說：摩竭月時為元始，<br>吠陀論師亦主張，冬月為始不應誤。<br>二、節氣定時<br>雖因地域有差異，本土中央依日轉，<br>諸賢依經驗推算，各有不同今略說。<br>昔日先賢所傳承，吾師智者世眼言：<br>星次二月始現時，人馬宮中夜分長。<br>六月星現夏至時，北極盡處秋分至，<br>再加南極冬至臨，春分後逢夏至至。<br>三、日月會合<br>日行南北轉運時，月亦隨之而運行，<br>分至日月同一道，此理應當善觀察。<br>細詳安布諸分位，如我考察所得知，<br>依從文字與口傳，今為略說其大要。<br>第八章 分至節氣<br>一、二分節氣<br>分時升起諸星宿，善知七曜運行度，<br>日出日沒中分時，即為分至之時節。<br>春分時節善盈星，現於天球北極處，<br>秋分仙人星現時，天球南極方位見。<br>二、仙人星象<br>仙人升起七旬間，除病八德時運轉，<br>或說七日為定期，此說迷誤應善辨。<br>恆星中等光度者，色帶微黃可辨識，<br>此說源自聖者言，遍智上師所宣說。<br>第九章 星宿宮位<br>一、宮位度數<br>每宿四分各有度，一分十五時辰行，<br>九分度數成一宮，如是運轉有次第：<br>羊宮始自昴宿起，畢星初分為界限，<br>牛宮畢宿三分半，參星二分為疆域。<br>胃宿終盡觜星圓，井宿三分為蟹界，<br>巨鬼柳星皆癸宮，軫星一分獅子分。<br>處女翼星張宿滿，氐房心尾為天秤，<br>天蠍尾箕牛宮盡，斗牛為人馬宮度。<br>摩羯女虛危室分，瓶宿奎壁參為界，<br>雙魚昂星觜參度，如是十二宮周天。<br>二、宮位總數<br>如是宮位總和數，一千六百二十度，<br>此為天體運行域，眾星遊行此道中。<br>三、梵語宮名<br>梵語宮名今略述：彌沙名羊佛利沙，<br>彌徒那為雙子宮，羯羯吒為蟹行度。<br>僧訶獅子犍尼耶，處女都拉為天秤，<br>毗栗支迦蠍宮是，檀努名為人馬宮。<br>摩伽羅為摩羯位，宮陶名瓶彌那魚，<br>總名羅濕謂宮垣，如是梵名應記持。<br>第十章 七曜生宿<br>一、諸曜生處<br>七曜生處今略說：羅睺生於天秤初，<br>計都生於雙魚末，日生巨蟹四分始。<br>或說生於房宿中，依經無誤應受持，<br>故知血月生天秤，昴宿夜分等分時。<br>二、五星生處<br>獅宮朱宿火星生，天蠍二足水星起，<br>處女畢宿木星現，雙宿日月羅計臨。<br>水瓶彗星現其中，牛宮熒惑來降世，<br>如是七曜生宮位，依於時輪教理明。<br>三、宮位主宰<br>羊蠍火星為主宰，牛秤金星掌其權，<br>雙女水星為統領，蟹月獅日各司分。<br>人馬雙魚木星主，摩羯瓶宮土德臨，<br>隨宮現起諸星象，主客相爭成吉凶。<br>第十一章 氣息時分<br>一、氣息根本<br>年月日時諸運轉，根本即是命氣息，<br>善惡業力為其因，壽量長短由此定。<br>人身氣息有三等：長短中等各不同，<br>壯年無病正常人，一呼一吸為根本。<br>二、氣息換算<br>一息分作二萬數，一千六百為其量，<br>此為微細蟣虱息，故知人息攝微細。<br>一日之中三萬息，餓鬼一息人月周，<br>人間一時為天息，是故人年天一日。<br>人間一日成一息，阿修羅界如是知，<br>故知人間十二年，修羅一日無差別。<br>能力氣息人間歲，等同一年無增減，<br>二萬一千六百年，勝者一息如是說。<br>三、四禪天界<br>此中能力與勝者，色界極頂無色頂，<br>皆為補特伽羅名，世間怙主如是言。<br>然而三十一有中，所說壽量與氣息，<br>此處所說不相符，為引外道故隨順。<br>四、氣息根本<br>如是已說諸支分，今當宣說其精要：<br>贍部人間眾生息，實為時算之根本。<br>一日之中氣息數，二萬一千六百行，<br>水滴時分諸細分，皆從此中而生起。<br>第十二章 水滴時分<br>一、時分總說<br>佛陀金剛持如來，無上密意續部中，<br>歡喜金剛經典說：時分三十二水滴，<br>六十四分刻度成，三昧耶生續亦云：<br>十六時分三十二，水滴六十四分明。<br>二、時分細分<br>金剛空行續中說：六度眨眼為一分，<br>六分積聚成剎那，三十須臾成一時，<br>十倍千一再二十，水滴一量如是定。<br>六十水滴成一時，百時即為一大時，<br>八大時分成一日，水器量度今當說。<br>三、水器度量<br>銅器十二兩所成，器高八指寬十二，<br>精工鑄造成圓器，黃金三十沙數重。<br>六指長度為其度，針孔精鑿於器底，<br>清水無濁六十兩，此為時分準確量。<br>四、漢土計時<br>大唐計時九十六，每刻三十八水量，<br>折合氣息二百廿，晝夜平分四十八。<br>他如獅子請問經，諸經論典雖不同，<br>用語略異義相同，此依時輪最為顯。<br>第十三章 日分計算<br>一、基本原理<br>自他平等一氣息，六度圓轉至流盡，<br>五滴三十氣息行，百八十息三十滴。<br>六十水滴一時轉，總計三百六十息，<br>為一時辰之長度，時輪六十周天度。<br>二、換算關係<br>三千六百水滴量，二萬一千六百息，<br>晝夜等分無增減，是謂時分之根本。<br>餘者地分與節氣，一切依此而建立，<br>有智之人善推算，細部觀察當了知。<br>第十四章 晝夜節氣<br>一、諸家說法<br>智者有立四分位，水滴一分細分明：<br>空天時分三剎那，建立四分無差異。<br>或有分作三六位，時分以上無錯謬，<br>大體相同無異議，細部差別應詳察。<br>二、晝夜類別<br>次說晝夜之性相，宮日太陽月晝夜，<br>廣說三日差別時，此處且述其梗概。<br>一年之中立三日，各有不同分位別：<br>宮日三百六十日，太陽三百六十五，<br>月日三百七十一，長短次第如是知。<br>三、日月運行<br>宮日太陽晝夜中，日行星宿一周天，<br>合於四足度量分，前足東方後足南。<br>半圓之後前足西，後足北方而運行，<br>月行二十七日中，星宿周天四足行。<br>第十五章 曆法推算<br>一、朔望交會<br>十四分度定位時，月度均分得其數，<br>前足七分居東方，後足七分居南方。<br>若數不均前足西，後足北方定其位，<br>日月運行如五星，雖無逆行停留相。<br>閏月順逆皆相應，智者所言當善解。<br>二、時算根本<br>總論時算諸根本，太陽為主影為證，<br>長短極致與等分，一處出沒諸方域。<br>現量可見差別故，欲力時分定其準，<br>足度性相影長短，未得算師徒有名。<br>此理當善思維之，莫執表相為根本。<br>三、三日差別<br>宮日太陽月晝夜，長短差距各不同，<br>未滿一月依日行，日數為主而建立。<br>月滿之後依月行，雖未滿三十日時，<br>月從望至望月間，三十日滿月圓周。<br>是故律論諸師徒，粗算每年去六日，<br>細推五日餘分位，每分四十八刻度。<br>第十六章 總結<br>一、曆法根本<br>年滿之時日月中，宮日為主而建立，<br>何故宮日未圓滿，年歲不得成辦耶？<br>一年三百六十日，世間共許此為準，<br>星算圖式諸要門，三日差別所生故。<br>二、諸星週期<br>月十五日日六日，水三金九木十二，<br>土三十土十五年，羅睺九年為一周。<br>日月合計半月三，加三分之人年百，<br>日數二千月一周，十二月年復百年。<br>三、大期推算<br>人年四十萬二萬，二位下數十除餘，<br>上數積聚所得數，二十一萬六萬年。<br>此為主息一千八，一息千二百年期，<br>大轉一周五分商，此為爭鬥劫時量。<br>商數二三四乘積，二全三全圓滿量，<br>年滿諸數究竟時，眾星入於空位中。<br>復起定數重新生，世間勝智如是說。<br>眾星各有日數期，每依本身圓輪時。<br>半日以分晝夜度，權為初學導明知。<br>細論經法有明示，日依宮位月行遲。<br>羅睺計算以月日，五星行度依晝時。<br>日月歲數總推算，準確易解不差違。<br>十一輪星七值次，更有其餘名數奇。<br>日名蘇羅與羅毗，光形晝主千光持。<br>光蔽施火所生者，銀精七馬稱名時。<br>月名旃陀與初母，宿主星王藏寶期。<br>星曜輪環三方處，東方明點蓮友知。<br>火星名為曼嘎拉，赤體地生天子期。<br>肋光九焰與邪曲，吉祥稱號備周知。<br>水星名為布達那，月子髻生與一體。<br>金寶滿意生王子，歡喜稱號亦相宜。<br>木星巨辯明天師，躍動師長清淨期。<br>粗重光明智者主，言語主者施命時。<br>金星名為勝天師，無天上師惡斷持。<br>施主精液工詩者，十六光明百詞師。<br>土星閃耀名緩行，七光日子行遲遲。<br>梵生不盡眼閻幡，息滅和平時見之。<br>十五辨明遷不遷，輪圓十一位中存。<br>遷宿七者為分列，名號巴胡婆末搬。<br>句來龐亢及其餘，歌黑嘉木吉哈章。<br>巴尼章與毗瑟持，梵語藏音分別知。<br>播種馬首族性行，芝麻舍生本分明。<br>毗瑟跡尾皆稱謂，數符其一播種標。<br>二為馬首三族性，四五布尼六親生。<br>七圖毗瑟所計時，半月各分晝夜移。<br>白黑初一之後半，播種二前馬首期。<br>二後族性三之前，芝麻後半家生知。<br>四五布尼四後分，毗瑟運行時節宜。<br>如是五日月半分，黑分十四後分期。<br>十五前後白分初，四位不遷常定時。<br>梵語商句及其他，娑陀察睹與那伽。<br>金蘇格日尼稱謂，藏語楔子四足龍。<br>不悅依次分別明，黑分十四後分時。<br>十五前後白分初，一日前分常時現。<br>毗瑟金剛運時期，同分故為嚴肅期。<br>如是星曜宿度分，相合時宜辨作期。<br>梵音次第稱其名，伽羅日提與那叉。<br>瑜伽稱為迦羅那，五支聲名普傳知。<br>五聚亦為名稱宜，其中別有如是義。<br>今時推算時宜中，星數下標竹籤時。<br>起數盛名圖數宜，晨起至午為現在。<br>享用盡時月亦遷，此理分明可觀察。<br>虛空輪中前享分，減去現今正享時。<br>現今過去合其時，享用限量皆周全。<br>盡此無間即刻時，後分時享始起期。<br>如是時中月現行，生起諸類現時眾。<br>月中運行決定合，然而時節運行中。<br>諸類月中不宜合，彼為依日眾決定。<br>是故定於彼日時，今時如此諸說者。<br>月中相合非如理，譬如右手皮膚中。<br>左肉骨節非相合，雖似源流各別開。<br>不須合為決定一，是故各別教法中。<br>不錯修行正知行，作曆時享往昔中。<br>如算多年少有愆，此中如法增竹籤。<br>如是作曆日數中，多分有故應減除。<br>星宿復有月宿分，日宿清淨月宿中。<br>日夜竹籤海王分，日數一日享用時。<br>此中淨分諸星分，享用所減依次合。<br>然彼日數一日量，水時四時絲二一。<br>五息三時分為量，月輪度中正安住。<br>月環羅睺入境觀，依次月中星宿分。<br>當即觀察為上首，諸星相合二十八。<br>成相焚燒死相合，雙合吉祥相應喜。<br>日合增喜日喜日，怖日粗日非合日。<br>永斷盡勝甘露等，月宿享用處中現。<br>日之星宿時合分，四時分位悉周圓。<br>月星四數日光中，牙面觀察了知分。<br>五星計都與羅睺，出沒行向入位樣。<br>日之所行星宿中，觀察成就唯一義。<br>韻起所說輪類分，大分復依此為準。<br>是故時算一切中，月日星宿普知行。<br>如是月中星宿分，竹絲氣息分數量。<br>享用圖數過去許，餘分現在正受用。<br>明察星宿享用故，虛空輪中助分餘。<br>現今現前星辰一，享用月數時量是。<br>月環粗相現前執，細相徹底過去知。<br>相合清淨享用分，出沒過去現在時。<br>時量明察觀察法，依隨星宿享用儀。<br>然而相合法日中，水時二時絲四三。<br>五息三時分十九，受用勝師如是說。<br>總攝因緣眾聚時，名為相合合宜之。<br>雖含眾義詞多端，此處且論算術期。<br>十七力別今當辨，值日星宿二事持。<br>自在論中如是說，值宿力勝眾皆知。<br>持明諸者知其理，月值具一功德門。<br>四曜星宿八德備，時合功德億萬存。<br>今人算法尊日值，然知曜宿力最尊。<br>時合作用分二品，毗瑟羅睺特難分。<br>五支綱要辨力別，金剛羅睺日月陳。<br>曜象運時皆有次，力用大小細推循。<br>密教別門分方位，瑜伽祕法應時輪。<br>風力半時成變化，羅睺出沒布方門。<br>尊主所住星宮處，方向羅列極分明。<br>戰陣王族諸儀軌，如幻佛說妙難評。<br>根本最勝羅睺者，方位力用顯殊型。<br>所值星辰須細察，前後相對仔細聽。<br>二十四遷分晝夜，每遷氣息九百行。<br>小遷分作四分位，二百二十五氣量。<br>大遷各主司其職，晝夜三時轉不妨。<br>四主粗細分左右，蓮花金剛業寶揚。<br>四風天女分方向，上面頰鼻唇中流。<br>白衣度母並眼母，自在天母運行周。<br>大遷二十四時節，小遷九六細推求。<br>一日一夜成量數，二萬一千六百收。<br>密意瑜伽深妙處，二十四脈應相承。<br>自在受用並趣入，三時一起現分明。<br>為顯內外同合理，十二時輪轉匆匆。<br>虛空宮闕環相繞，日出日沒運行中。<br>三十六竿二十四，雪山北境定其程。<br>迦拉仙境與中土，香巴拉與漢藏城。<br>聖境竿度各不同，上下相次有差評。<br>水量三十互相奪，七地晝夜定長征。<br>論中明示此道理，顯密二義共相成。<br>宮宿運轉之道理，七位東升七位沉。<br>七半東昇七半落，東盡西沒相銜存。<br>毒宿宮位皆圓滿，七升如前復循輪。<br>如彼莎訖剛沒處，那嘎立即自東生。<br>納索高懸天際上，餘星由此細推行。<br>時合星宿雖不等，步分齊等此中明。<br>總攝虛空輪道理，二十七分細分清。<br>四分一中星宿住，試舉納索例中程。<br>四分虛空前二分，納索所轄定分明。<br>後二分屬王星轄，王星至竿細推評。<br>前二屬王分四盡，餘星皆應此理行。<br>值日五星依此轍，兩種星算古今存。<br>新舊諸說多名相，沿襲之外不須陳。<br>今有依從元算者，曉色虎兔列其循。<br>次第配合諸時位，一合或中終未真。<br>須從智者圖譜取，算理推求定法真。<br>答迦圖數根本處，或近或遠各自陳。<br>答迦淨域同宅主，梵音流出一時輪。<br>半分三九十二數，三十分位細區分。<br>諸力眾多經所說，當依本論細尋真。<br>此處略述明理趣，文簡義顯示其因。<br>時合功德億萬種，共通經論極稱珍。<br>總攝數中為最勝，日之時合第一循。<br>兼及月之時合者，大天論中音起經。<br>今時智者稱月密，十二宮白各有名。<br>住於何宮成時合，異名標示體各呈。<br>羊宮末至兔星內，行時月合眾名生。<br>十二月輪序次行，餘缺之日諸相生，<br>因緣和合法如是，智者觀之自通明。<br>然為初學示微言，正月初一識為先，<br>上弦順行下逆轉，盈虧明暗互相連。<br>黑月名色自為始，白分逆行赤順行，<br>上弦增長如流轉，下弦取受成輪迴。<br>四月生生順逆行，白赤因緣老死明，<br>五月觸法逆順轉，無明生死兩相生。<br>六月感受順逆行，老死行蘊定中明，<br>七月渴愛逆順轉，識與無明互相生。<br>八月取受順逆行，諸行名色成定形，<br>九月有支逆順轉，增處與識互相應。<br>十月生生順逆行，名色觸法互相生，<br>十一復逢老死轉，感受增處兩相成。<br>若遇閏月依前法，重疊排布理分明，<br>己宗月主增盈日，閏現無他當審聽。<br>吉祥續部如理說，因緣次第顯明然，<br>不敢臆造違經義，淨信為懷解此篇。<br>更詳文字他方尋，智者平心自可明，<br>今人或執宮次第，因緣配合且存疑。<br>雖有新智創所言，依準星算諧律文，<br>隨順時人多從此，吾等置之存中庸。<br>如是經義已宣明，日輪因緣說已終，<br>今當更論時分法，隨順因緣轉法輪。<br>水瓶無明依次轉，總攝三界諸因緣，<br>星算推時依歲行，陰陽五行運四天。<br>智者觀察知其妙，因緣時序互相連，<br>古卷或有年中說，後人傳寫或增添。<br>賢哲或有不許者，以為違背本經文，<br>然觀吉祥續經意，音韻年歲皆相通。<br>是故鼠年為無明，牛虎行識次第行，<br>兔為名色龍增處，蛇觸馬受羊渴求。<br>猴取雞有狗生死，豬與因緣次第通，<br>漢地年名雖有異，印土義理實相同。<br>或有譏毀古經者，妄造新義實可嗤，<br>如是十二因緣法，佛說無上甚深義。<br>信心淨妙為人說，略陳梗概今已終，<br>從此更論總義門，外相因緣妙理同。<br>諸乘皆說此道理，外內相應本相同，<br>外如於內內如外，清淨義趣別處明。<br>特於時輪最尊勝，外器內情皆具陳，<br>輪壇法相妙無比，細密過於諸教門。<br>今當略說其要義，六大所成金剛身，<br>中脈本淨智慧界，遍及一切脈輪門。<br>外空亦復如是住，中脈明月遍虛空，<br>羅睺時火中性界，日月二脈左右通。<br>白紅明點所依止，日月方便智慧融，<br>依此根本六輪現，五大智慧具圓通。<br>頂輪四瓣表四際，額輪十六表時分，<br>喉輪三十二葉滿，星宿二八智四增。<br>心輪八葉表八時，或表八曜運行真，<br>臍輪六十四瓣具，空點六十四時輪。<br>此中十二時分現，密輪三十二葉圓，<br>紅白十六方三十，支分大節具周全。<br>十二月輪各自具，三十瓣葉應時天，<br>支分大節六旬數，一日氣數六百全。<br>三百六十氣輪足，內外相應妙理圓，<br>星算一切依脈住，至妙明點轉法筵。<br>生死涅槃諸法界，世出世間無不全，<br>世俗勝義菩提性，一切從此明點現。<br>世俗因緣明點者，水火二大紅白圓，<br>精華總攝成明點，金剛薩埵妙理詮。<br>日月光明外相現，細密因緣風大全，<br>羅睺時火明點性，遍滿一切脈輪間。<br>種種星宿從此運，紅白增減妙用圓，<br>南北往來依此轉，寒暑四序此中現。<br>精氣風息入中脈，契合因緣時至圓，<br>六界時節六月後，日月相合羅睺現。<br>總攝器界成壞時，增減苦樂善惡全，<br>一切皆從明點起，佛說作用最為先。<br>特論風力最殊勝，一切功能具此間，<br>脈與明點諸作用，無不依於風力全。<br>故知此等諸法主，唯風最勝實可宣，<br>暫時內外諸氣息，星算根本從此詮。<br>右行五輪五曜義，剛宿五曜性相連，<br>左行五輪五曜義，柔宿五曜互相牽。<br>雖依運行如是說，總攝命氣日月圓，<br>星宿所行宮度者，臍輪左右瓣葉全。<br>六十二十蓮華相，四瓣五輪六十圓，<br>葉與輪心流注小，總攝成就大流圓。<br>是即一時如是轉，左右相等不等間，<br>如前所說從此起，日月年歲次第圓。<br>外在時分諸作用，風力運行悉圓全，<br>三界生滅諸法界，一切不離風力全。<br>如是經續聖釋中，智者所解妙理圓，<br>今以淺近言辭說，略陳梗概示其端。<br>更有旁出諸言論，四續時輪經義全，<br>承襲師訓相傳授，從師所聞如是言。<br>壯年平和氣息數，一日所行妙理圓，<br>外算一年時數等，左右流注表盈虧。<br>南北二道從此轉，十二宮度月輪齊，<br>十二時中氣息數，一月時數千八百。<br>小流氣數三百六，六旬日數應時機，<br>特論日輪周天數，閏月所以從此知。<br>諸曜空入復定生，根本智風妙理宜，<br>鼻中所行一息中，分為三十二分時。<br>其中一分智風起，積此小流一盡時，<br>吉祥足數智風現，外現六日應其時。<br>智風氣數相應足，吉祥兼足數相宜，<br>內現小周一終後，五十六足智風時。<br>外現一月時分中，五十六足十五依，<br>一日究竟智風數，六百七十五相宜。<br>外現一年究竟時，六百七十五智輪，<br>虛空所攝日積數，一年閏日從此知。<br>如是相續內三日，時輪兼足三十二，<br>智風氣數千八百，外現三年時節知。<br>半足三十二月間，智風氣數千八百，<br>虛空所攝三十日，一月閏數從此知。<br>相續內現二月間，五日之中二日全，<br>智風氣數成餘數，外現四十五年圓。<br>等與不等閏月數，二十四數量方圓，<br>百年智風流注說，三年最勝量可詮。<br>師承妙訣珍如此，今因契理故書傳，<br>復次我思臍輪中，十二宮度時輪全。<br>本命年輪正相應，外輪流注六十圓，<br>五行老年六十數，相合無差妙理圓。<br>如是算法相應處，東風南火次第全，<br>北水西土依時輪，諸方次第正相連。<br>中央地位時輪說，須彌正是虛空天，<br>如是種種諸名數，相合可得妙理圓。<br>然於略說此時中，且舉少分未敢宣，<br>如是共通智慧處，星算具有諸理全。<br>不共所化諸根器，各有不同信樂緣，<br>我等大師佛世尊，內外和合妙道詮。<br>外在時輪最殊勝，善說法門甚可怜，<br>志求此法新學者，利益一切眾生圓。<br>總持名數略教門，少分略說今已宣，<br>若人入於星算法，始終皆當識其源。<br>義理無差最為要，餘者不過相而已，<br>是故最初總持門，善解師承言教旨。<br>文義如理能通達，自然智慧得開啟，<br>若人不解實義理，但依文字作標記。<br>鸚鵡學語終無益，是故當求實理知，<br>若謂文字亦不取，不信因緣最愚癡。<br>是故當於智道中，恭敬修學莫暫離，<br>未解實理妄下筆，徒如鬼跡空無依。<br>諸法圓融未了知，捨棄共通諸學智，<br>翳眼所見諸色像，是故因緣當證知。<br>眾生業力未了悟，專執星曜善惡時，<br>即是外道所行法，是故心業當證知。<br>內道實理未了知，外算雖精徒勞爾，<br>不異牧牛老翁輩，是故瑜伽當證知。<br>唯求現世名利故，共通智慧作生涯，<br>即是商賈營利眾，是故淨願當發時。<br>於佛教法未信解，世間學問雖精通，<br>不過暫時諸伎能，是故正信當生時。<br>未發無上菩提願，三業雖勤徒勞爾，<br>不異童稚戲論事，是故迴向菩提時。<br>若欲詳說諸義理，窮劫難盡且略陳，<br>為令契理略宣說，少分義理今已終。<br>如是一切諸生中，常生歡喜智慧明，<br>諸智自在無障礙，算數總持妙寶林。<br>此中所集諸善業，回向無上菩提門，<br>願證佛果度眾生，利樂無盡等虛空。<br>是為《時輪算數入門》第三品：星算性相總持略說品竟。<br>於此偈曰：<br>所有學人與佛子，如實證得聖者地，<br>若於明處未精通，遍智高位難成就。<br>是故佛陀大導師，勸勉當習諸明處，<br>故應精進無懈怠，如理恭敬修智業。<br>未得如法真淨信，縱習世間諸明處，<br>猶如外道諸智者，終難趣入解脫門。<br>若於圓覺佛世尊，生起不退真信心，<br>敬奉佛言生淨信，護持正法勝意樂。<br>一切所行諸事業，善巧方便皆成因，<br>世間明處諸事業，解脫勝行最殊勝。<br>如是深解其義趣，當入明處修學門，<br>或有譏毀波羅蜜，謂此果德路遙遠。<br>是故世間諸明處，何不更受彼訶斥，<br>若欲速證勝果者，當勤修習實義門。<br>通達勝義諸明處，因緣莊嚴亦相宜，<br>未達此理諸有情，明處亦非當棄捨。<br>專修內觀妙理時，一意專修不學明，<br>如是虛耗暇滿身，是故入此算門者。<br>初觀智者廣論議，文深義廣疲難究，<br>或有太略義未圓，或是俗算非正論。<br>為利新學諸算者，故造總持略教門，<br>總綱前行義理論，簡要未見他處有。<br>是故我以智慧力，集諸智者妙言教，<br>文簡義豐最清淨，利他意樂同秋蓮。<br>一切算師所共知，為諸初學作依止，<br>遠離擾亂息心處，開創善說前未有。<br>初始語藏除貧寶，自在無盡珍寶嚴，<br>圓滿善說如意藏，饋贈求法諸賢士。<br>此後若有諸生成，悉依此力當了知。<br>如是賢劫長壽鳥，雖僅少依智者山，<br>已得明處寶翼成，妙舞智者座前展。<br>願以此善根力故，等空有情普蒙益，<br>文殊勇士最勝位，不久速疾願圓成。<br>此《入算明論》前行簡擇，圖象數理星算性相總義三品，第二品止，著於十二勝生末年水狗歲。因中懈怠，第三品復於木牛歲箕宿月下弦第十日，日光七耀與畢宿同度，吉祥和合之晨時，於東方貢域松林靜處，瑜伽士才旺諾布善為敘述。善哉！善哉！善哉！願吉祥光嚴閻浮提！</p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2025-09-02T11:00:00Z",
    "updatedAt": "2025-09-02T11:00:00Z"
  }
] 
