[
    {
    "id": "天相算命_001",
    "tibetanTitle": "༄༅། །དཔལ་དུས་ཀྱི་འཁོར་ལོའི་རིག་པ་རྩིས་ལ་འཇུག་པའི་སྒོ་སྔོན་འགྲོའི་རིམ་པ་རྣམ་གྲངས་མདོ་བཅས་རབ་ཏུ་བྱེད་པ་དྲི་མེད་འོད་ཟེར་མཛེས་པའི་རྒྱན་གྱི་མེ་ཏོག་ཅེས་བྱ་བ་བཞུགས། །",
    "chineseTitle": "《吉祥時輪數理入門基礎明鏡善說論》",
    "author": "才旺諾布 造",
    "category": "星相算命",
    "tags": ["星相","時輪","時輪曆算"],
    "ContentTibetan": "<p class=\"tibetan-text\">༈ ཨོཾ་སྭཱ་སྟི། ན་མཿཤྲཱི་ས་མནྟ་བྷ་དྲ་ཀཱ་ལ་ཙཀྲ་ཡ། ཀུན་མཁྱེན་ཀུན་ལ་སྨན་མཛད་པ། །བདུད་རྩིའི་འབྱུང་གནས་སྲིད་ཞིའི་མགོན། །དཔལ་ལྡན་བླ་མ་སངས་རྒྱས་ལ། །རྣམ་ཀུན་དད་པས་འདུད་ཕྱག་འཚལ། །གཞོན་ནུ་གང་ཞིག་རིག་པའི་གནས། །གྲངས་ལ་མ་རྨོངས་རྩིས་ཀྱི་སྒོར། །འཇུག་པར་འདོད་པའི་སྐྱེས་བུ་ལ། །ཤིན་ཏུ་གཅེས་པ་སྤྱི་ཡི་ནོར། །དང་པོ་ལག་ལེན་རི་མོའི་གནད། །མན་ངག་ཇི་སྙེད་མ་སྦས་པ། །གོ་བདེ་ལྷུག་པར་བརྡལ་བའི་ཚིག །བཀླགས་པས་ཤེས་པ་འདིར་སྤེལ་བྱ། །དེ་ལ་ཐོག་མ་ངེས་པའི་གནད། །འདི་ལྟར་ངག་ཚིག་བརྡའ་ཆད་གང་། །ཡི་གེའི་གཟུགས་སུ་ཤར་བ་འདི། །སངས་རྒྱས་འཕྲིན་ལས་འཇུག་པ་ཉིད། །ཡུན་ཕྱིར་རྣམ་གྲངས་འབྱམས་ཀླས་པ། །བསམ་གྱིས་མི་ཁྱབ་ཉིད་དུ་ཤེས། །དེ་ལས་མི་མཇེད་འཛམ་གླིང་འདིར། །ཡུལ་གྲུ་སྣ་ཚོགས་སྐད་རིགས་ཀྱང་། །ཤིན་ཏུ་མང་པོར་གནས་པ་བཞིན། །ཡི་གེའི་གཟུགས་ཀྱང་ཇི་སྙེད་གྲུབ། །དེ་ཡང་རྒྱ་གར་བལ་བོད་ཀྱི། །ཡིག་འབྲུ་ཕན་ཚུན་གྲལ་སྦྲེལ་བས། །ཡིག་འཕྲེང་འགྲེང་ཐབ་མཐུར་གཤིབས་གནས། །དམིགས་བསལ་ལས་གཞན་སྤྱིར་བཏང་དུ། །ཡི་གེའི་གནས་ཚུལ་དེ་ལྟར་མཐོང་། །ཡིག་རིགས་དེ་དག་ཐམས་ཅད་ཀྱང་། །འབྲི་དང་ཀློག་ཚུལ་མཐུན་པ་ཉིད། །དབུ་ཕྱོགས་ཐོག་མ་གཡོན་ནས་འབྱུང་། །ཐ་མ་གཡས་ཀྱི་ཕྱོགས་འགྲོའོ། །དེ་ལྟར་ཡི་གེའི་སྤྱིའི་རྣམ་བཞག །གླེང་གཞིའི་ཚུལ་དུ་ས་བོན་ཙམ། །གྲངས་བརྡའ་ཨང་ཀི་འབྲི་ཀློག་གནས། །གཏན་ལ་ཕབ་ཕྱིར་སྨྲ་བྱས་ཏེ། །ད་ནི་ཉེ་བར་བརྗོད་པའི་དོན། །སྐར་རྩིས་རི་མོ་མཁན་སྤྱི་ལ། །གྲངས་ཀྱི་བརྡའ་འགྱུར་ཨང་ཀི་ཞེས། །རྣམ་འགྱུར་དགུ་དང་ཐིག་བཅས་བཅུ། །ཡིག་གཟུགས་རེ་ཁཱ་གང་བདེ་ཉིད། །ཕལ་ཆེར་མཐུན་པར་གྱུར་པ་འདི། །རྩིས་ལ་ཇི་བཞིན་འཇུག་པ་ཡི། །གཎྜར་རི་མོ་བསྒྱིད་པའི་ཚེ། །ཡི་གེ་སྤྱི་ལས་ལུགས་བཀླགས་པར། །མས་ནས་དབུ་བརྩམ་ཡས་བསྒྲོད་བྲི། །ཅི་ཕྱིར་གཅིག་བཅུ་བརྒྱ་སྟོང་སོགས། །མཐའ་ནས་ཡར་ལ་བགྲང་དགོས་པས། །ཨང་ཀི་བྲི་བགྲང་མས་ཕྱོགས་སམ། །གཡས་ནས་བྱ་ཞེས་དོན་དེ་ཡིན། །འོན་ཀྱང་ཀློགས་ཚེ་སྤྱི་འདྲ་བར། །ཡས་ཐོག་ནས་ཀླགས་དེ་ཡི་ཚེ། །མང་མཐའ་ཡས་འབྱུང་དཔེར་ཉི་ཁྲི། །ཆིག་སྟོང་དྲུག་བརྒྱ་བརྗོད་བཞིན་ནོ། །དེ་ཡང་གཡས་གཡོན་ཕྱོགས་བྱ་ཡི། །འོག་ཏུ་བསྒྱུར་བྱེད་ཐ་མ་བྲི། །བརྒྱས་བསྒྱུར་གྲངས་མཐར་ཐིག་གཉིས་བྱུང་། །དེ་བཞིན་སྟོང་ལ་ཐིག་ལེ་གསུམ། །ཁྲིར་བཞི་འབུམ་ལ་ཐིག་ལྔ་སྟེ། །བཞི་ཆས་བསྒྱུར་བ་དེ་དེའི་ཆ། །རིག་པ་དེ་ཡི་གཞན་ཡང་སྤེལ། །ཆ་གྱུར་དེ་འདྲ་མི་ནོར་ཆེད། །ཕྱེད་རྟགས་རི་མོ་འཕྲེད་ལ་འཐེན། །སུམ་ཆ་ཟུར་གསུམ་བཞི་གྲུབ་བཞི། །བྲི་ཞེས་གནད་འདིར་མཁས་པས་གསུངས། །བགོད་དང་སྦྱར་བའི་གནད་བསྟན་ན། །བགོད་པ་ལ་ནི་ཐོབ་ནོར་འབྱུང་། །སྦྱང་ལ་ཕལ་ཆེར་ནོར་གྱི་དབྱེན། །བགོད་པས་སིལ་བ་སྡུད་བྱེད་ཅིང་། །སྦྱངས་བས་ལྷག་མའི་ནུས་པ་སྟོན། །གཞན་ནི་རིགས་པ་མཚུངས་པར་གནས། །བསྐྱང་བགོད་རང་གི་ཐོབ་ཚད་ཁྱེར། །བསྒྲག་བགོད་འོག་མའི་ཐོབ་དང་བསྟུན། །མང་ཐལ་འོག་མས་མི་ཐོབ་ཆད། །ཉུང་ཐལ་འོག་མས་སྐྱར་ཐེབ་ལྷག །དེ་དག་སྐྱོན་ཡིན་སྤང་བྱ་སྟེ། །དེ་ཕྱིར་མང་ཉུང་ཚད་ཟིན་གནད། །བགོད་ཚོད་མ་ཟིན་གོང་མ་ཡི། །ཁྱེར་ཆེས་མ་ཐོབ་གོང་མའི་ནོར། །གཅིག་ཕབ་བགོད་བྱེད་སྔར་གཟུགས་བསྒྱུར། །འོག་མས་བགོད་པས་རྣམ་པར་དག །གོང་མས་ཁྱེར་ཉུང་འོག་མ་རུ། །བགོད་པའི་ལྷག་མར་སླར་ཐོབ་ན། །རང་གི་གནས་དེར་ཐོབ་ནོར་བརྩེགས། །འདི་དག་མཁས་པའི་ཕྱག་བཞེས་ཡིན། །བགོད་བྱེད་མང་ཉུང་ཇི་ལྟར་ཡང་། །བགོད་ཐེངས་རེ་ལ་ཁྱེར་ཐོབ་ནོར། །གཅིག་ལས་མི་འབྱུང་དེ་འཇུག་ནས། །ངེས་པ་ཡོད་ན་མས་ནས་ཡར། །བགོད་བགྲངས་མཐུན་པའི་གནས་སུ་འཇུག །བགོད་ཡུལ་མང་ན་འཇུག་ཡུལ་ཉུང་། །དེ་ཚེ་ཐོབ་གྲངས་མ་ནོར་གྲལ། །དབུ་ནས་མར་ལ་རིམ་བསྒྲིག་ནས། །འཇུག་ཡུལ་སླེབ་ཚེ་གོང་དང་འདྲ། །འཇུག་ཡུལ་མེད་ན་ནོར་རང་ཉིད། །གྲལ་འཕྲེང་བསྒྲིགས་སམ་གནས་སྐབས་སུ། །འཕྲལ་མཁོ་མེད་ན་དོར་བས་ཆོག །གང་ཞིག་དབུས་མཐར་མ་ཐོབ་སྐབས། །བྱུང་ཚེ་ནོར་བུ་ཐིག་ལེ་སྦྱིན། །དེ་ཡང་བགོད་བྱེད་ཉུང་བ་དང་། །བགོད་བཞི་མང་ངམ་མཉམ་ན་ཐོབ། །བགོད་བྱེད་མང་ལ་བགོད་བཞི་ཉུང་། །བསྣན་སོགས་བྱ་བ་གཞན་མེད་ན། །ནམ་ཡང་ཐོབ་པར་མི་འགྱུར་གྱི། །གནད་འདི་འཕྲི་ལའང་ཤེས་ཀྱིས་ཀྭ །གཞན་ཡང་སྤྱིར་བཏང་ཨངྐི་ཡི། །གྲལ་མཐའ་ནས་ཡར་གཅིག་བཅུ་སོགས། །གྲངས་ཀ་གཞན་ལུགས་བགྲང་བའི་ཚུལ། །གོང་དུ་བཤད་པ་ཇི་བཞིན་ལ། །བགོད་དང་སྦྱངས་ལ་སོགས་པའི་དུས། །ལས་བྱེད་ཨངྐི་རང་རང་གི །སྟེང་ཐད་གནད་དེ་གཅིག་པར་ངེས། །དེ་ཡན་བཅུ་སོགས་རིམ་པར་སྦྱར། །སྦྱངས་བགོད་རང་གི་སྟེང་ཐད་ནས། །མ་ལོང་གོང་ནས་བཅུ་ཚན་ཕབ། །དེས་ཀྱང་མ་ལོང་དེ་གོང་ནས། །བརྒྱ་འབེབ་ལ་སོགས་རིམ་པས་བྱ། །བསྲེ་བསྣན་བྱེད་པ་རང་ཐད་ཀྱི། །གཅིག་བཅུ་བརྒྱ་ཡི་གནས་མལ་གང་། །མ་འཆུག་བྱ་སྟེ་འོག་མའི་གྲངས། །ལོང་ཚེ་གོང་ནས་གོང་འཕོ་འགྲོ། །དེ་ཡང་ཞིབ་མོར་བཤད་པ་ན། །བཅུ་མན་རྩ་བའི་གྲངས་ཡིན་ལ། །དགུ་མན་གཅིག་གི་གནས་མལ་འགྱུར། །གཅིག་ནས་བཅུ་ལོང་གོང་དུ་འཕོ། །གལ་ཏེ་བཅུ་ཡི་ལྷག་བྱུང་ན། །སྔར་གནས་རང་མལ་གཅིག་པར་འཁོད། །དཔེར་ན་བཅུ་དང་གཅིག་གི་གནས། །གཉིས་ཀར་དགུ་རེ་ལོང་བ་ལ། །གཅིག་གི་གནས་སུ་དགུ་བསྣན་པས། །བཅུ་ལོང་གོང་གི་དགུར་བྱིན་པས། །བཅུ་ནས་གོང་འཕར་བརྒྱ་རུ་འགྲོ། །བཅུ་གནས་སྟོང་སྟེ་ཐིག་ལེ་ཤར། ། ཉག་བརྒྱད་སྔར་ཤུལ་གཅིག་པར་གནས། །བརྒྱ་རྩ་བརྒྱད་ཀྱི་ཚུལ་འདི་ཡི། །བརྒྱ་སྟོང་ཁྲི་འབུམ་བྱེ་བ་སོགས། །ཀུན་ལ་རིག་པས་ཤེས་པར་བྱ། །ཡང་ནི་འདི་ལྟར་རིག་པར་བྱ། །བགོད་བཞི་བགོད་བྱེད་ཤོད་མཉམ་ཚེ། ། རང་རང་འཁོར་ལོ་དེ་རྫོགས་ཚད། །བགོད་བཞི་མང་པོ་བགོད་པ་ན། །བགོད་ནོར་ཅི་ཙམ་བྱུང་བ་དེ། །འཁོར་ལོ་དེ་འཁོར་གྲངས་ཚད་ཡིན། །བགོས་པའི་ལྷག་མ་མ་ལུས་པའམ། །བགོད་གཞི་ཉུང་ནས་མ་ཐོབ་ན། །འཁོར་ལོ་གང་ཡིན་དེ་ཚུང་ནས། །བསྒྲང་བྱའི་གྲངས་ཉིད་ཡིན་ཤེས་བྱོས། །ཚུལ་འདི་བགོད་བྱེད་ངེས་པ་ ཅན༑ །ཡོད་པ་ཀུན་ལ་རིག་པ་ཡིན། །གཞན་ཡང་འདི་ལྟར་ཤེས་པར་བྱ། །བགོད་གཞི་གྲངས་ཚད་གང་ཡིན་དེ། །གཉིས་ཀྱི་བགོས་པའི་ཐོབ་ནོར་ནི། །བགོད་བཞི་གྲངས་དེའི་ཕྱེད་ཆར་འགྱུར། །དེས་མཚོན་སུམ་བཞི་ལྔ་སོགས་ཀྱི། །བགོད་ནོར་དེ་དེའི་ཆར་ཤེས་བྱ། །བགོད་བཞིར་ཡ་འཁྱར་ལྷག་བྱུང་སྐབས། །དེ་ཡང་ངེས་པར་བསྲེ་དགོས་ཚེ། །ཡ་འཁྱར་དེ་དང་ཤེད་མཚུངས་པས། །བགོད་གཞི་བསྒྱུར་བས་ཡ་འཁྱར་བསྲེ། །བགོད་བྱེད་དེ་ཡང་ཆ་མཐུན་བསིལ། །དེ་ཡི་བགོད་པས་རྣམ་པར་དག །སྤྱིར་ནི་བགོད་པའི་གཞི་དེ་ཉིད། །བགོད་བྱེད་ ཉིད་དམ་དག་པའི་ནོར། །དེ་ཡི་བགོད་གཞི་དེ་བསྒྱུར་ནས། །སླར་ཡང་རང་རང་ཚད་དག་པས། །བགོས་པས་རི་མོ་དག་པ་སྟེ། །ཚུལ་འདི་རྣམ་འགྱུར་དུ་མ་བཅས། །ཁོང་དུ་ལེགས་པར་ཆུད་པའི་ཚེ། །རི་མོ་ལྷད་མེད་རྣམ་དག་པའི། །ཆོ་ག་རིག་པས་གསར་བསྐྲུན་འདོད། །ཀུན་ཀྱང་གེགས་མེད་འགྲུབ་པ་ཡིན། །གནས་སྐབས་ཕྲལ་གྱི་རི་མོ་ནི། །གཅིག་ནས་གྲངས་མེད་བར་བསྒྱུར་གཞི། །ཅི་འདོད་བསྒྱུར་བྱེད་ཡང་དེ་བཞིན། ། རྣམ་འགྱུར་བཅས་ཀུན་མི་འཁྲུལ་བར། །ལྷག་མེད་སྤྱད་ཐོབ་སྔ་གཟུགས་འཆར། །དེ་ཚེ་རི་མོ་སྦྱང་བ་སྟེ། ། རྩིས་གཞུང་གང་འདོད་ལ་འཇུག་པས། །ངལ་མེད་དེ་བཀླགས་རྟོག་གོ་ཀྱེ། ད་དུང་གཞན་ཡང་གཅེས་པའི་གནད། །འཕྲལ་འཁོ་འགའ་ཞིག་འདིར་བརྟན་ན། །དུས་དང་ཡུལ་དང་རྫས་སོགས་ཀུན། །ཕྲ་དང་སྦོམ་དང་རགས་པ་རྣམས། །གོ་རིམ་བཞིན་དུ་འོག་ནས་སྟེང་། །རིམ་པ་བཞིན་དུ་བརྩེགས་པར་བྱ། །དོན་དེས་སྟེང་ནས་རིམ་ཕབ་པས། །གོང་མའི་ཆ་ཤས་འོག་མར་འགྱུར། །དེ་ཡང་ཞིབ་མོར་བཤད་པ་ན། །དཔེར་ན་སྟེང་ནས་ཞག་གཅིག་ཕབ། །དེ་འོག་ཆུ་ཚོད་དྲུག་ཅུར་འགྱུར། །ཆུ་ཚོད་གཅིག་ཕབ་སྲང་དྲུག་ཅུ། །སྲང་གཅིག་ ཕབ་པས་དབུགས་དྲུག་གྲགས། །དེ་ཕབ་དེ་ཡི་ཆ་ཤས་འགྱུར། །དེ་དག་སླར་ཡང་རང་རང་གི། །འཁོར་ལོས་ སྟེང་དྲིལ་ཞག་ཏུ་འཕོ། །དེ་ནི་སྟེང་ནས་དཔག་ཚད་ཅིག །ཕབ་པ་འོག་ཏུ་རྒྱང་གྲགས་བརྒྱད། །རྒྱང་གྲགས་ ཅིག་གི་གཞུ་ལྔ་བརྒྱ། །གཞུ་འདོམ་གང་ལ་ཁྲུ་བཞི་སྟེ། །ཁྲུ་ནི་སོར་མོ་ཉི་ཤུ་བཞི། །སོར་གང་ནས་བདུན་དེ་ ནས་ཙམ། །ཤིག་དང་སྲོ་མ་ཉི་ཟེར་རྡུལ། །གླང་ལུག་རི་བོང་རྡུལ་དང་ནི། །ཆུ་ལྕགས་རྡུལ་ཕྲན་ཕྲ་རབས་ཀྱི། །རྡུལ་བར་རིམ་པར་བདུན་འགྱུར་དམན། །དེ་རྣམས་འོག་ནས་རང་ཚོད་ཀྱི། །གོང་དུ་རིམ་པར་དྲིལ་བ་ཡི། །དཔག་ཚད་གནས་སུ་འགྱུར་འདི་ནི། །མངོན་པ་མཛོད་ཀྱི་ལུགས་ཤེས་བྱ། །གཞན་ཡང་འཆི་མེད་སེང་གེ་ཡི། །མཛད་པའི་མངོན་བརྗོད་མཛོད་ལས་ནི། །སོར་མོ་ཉེར་བཞི་ཁྲུ་གང་སྟེ། །བཞི་ནི་གཞུ་སྟེ་འདོམ་གང་ཉིད། །དེ་བརྒྱར་ན་ལྭ་ཞེས་སུ་བཤད། །ཆིག་སྟོང་གཞུ་ནི་རྒྱང་གྲགས་ཏེ། །རྒྱང་གྲགས་གཉིས་ནི་ག་བྷུ་ཏི། །དེ་གཉིས་ལ་ནི་དཔག་ཚད་དོ། །འདི་ནི་ཀུན་མཁྱེན་སི་ཏུ་ཡི། །བསྒྱུར་བའི་མངོན་བརྗོད་འགྲེལ་ལྟར་སྟེ། །འགྲེལ་པ་མངོན་འགྱུར་ཉུང་ངུ་དེར། །དཔག་ཚད་དུས་འཁོར་ལུགས་མཐུན་མཐོང་། །དཔལ་མཆོག་དུས་ཀྱི་འཁོར་ལོ་ནས། །གཞུ་འདོམ་ཉིས་སྟོང་རྒྱང་གྲངས་གཅིག །རྒྱང་གྲགས་བཞི་ནི་དཔག་ཚད་གནས། །གསལ་བ་ཉིད་དུ་གསུང་བ་སྟེ། །དེ་ལྟར་གཞུང་གསུམ་རྒྱང་གྲགས་ནི། །ཐ་དད་མངོན་པ་མངོན་བརྗོད་ཀྱི། །དཔག་ཚད་མཐུན་དེ་དེ་དུས་འཁོར། །དཔག་ཚད་ཕྱེད་ཡིན་ཤེས་པར་བྱ། །གཞན་གྱི་རྫས་ཀྱི་དངོས་པོ་ལ། །སྲང་བཞི་སེ་བ་ཌཾ་ཨོ་ཀོར། །དེ་བཞིན་ཁལ་བྲ་ཕུལ་ཆ་ཤས། །འདེགས་ཁལ་ཉག་སྤོར་ཆ་ཤས་རྣམས། །སྟེང་ནས་འབེབ་དང་འོག་ནས་དྲིལ། །གོང་མའི་ཚུལ་གྱི་ཤེས་པར་བྱ། །མི་ཆོས་གྲངས་རྩིས་མཐའ་དག་ཡང་། །ཚུལ་འདི་རྟོགས་པས་བདེ་བཀླགས་སོ། །མདོར་ན་ཤེས་བྱ་ཀུན་རྩི་ཡང་། །བྲི་བྱ་ཡི་གེ་ཨངྐི་བཅུ། །དེ་སྤེལ་བསྒྱུར་བགོད་འཕྲི་བསྣན་གནད། །ཤེས་ན་གྲངས་རྩིས་མ་རྨོངས་འགྱུར། །དེ་ཚུལ་ལེགས་པར་གོ་བ་ན། །གྲངས་ཀྱི་རྣམ་འགྱུར་རི་མོའི་འཁྲུལ། །ཇི་སྙེད་བློ་ལ་རང་ཤར་འབྱུང་། །དེ་སྙེད་འབྱམས་ཀླས་ཉིད་ཤེས་བྱོས། །འདིར་བརྗོད་རི་མོའི་གནད་དེ་རྣམས། །ཚིག་དོན་མ་ནོར་ཡིད་གཞུང་པོས། །རྩིས་ལ་འཇུག་སྐབས་དྲན་པ་ཡི། །རྟག་ཏུ་བཟུང་བྱ་དམ་པར་ངེས། །དེས་ན་རྩིས་ཀྱི་སྔོན་འགྲོར་མིང་། །བཏགས་ཀྱང་རིག་གནས་འདིར་འཇུག་སྒོ། །ཚེགས་ཆུང་དོན་ཆེ་མེད་ཐབས་མེད། །ཤིན་ཏུ་གཅེས་པའི་མན་ངག་ཡིན། །འོན་ཀྱང་བློ་གསལ་བརྩོན་འགྲུས་ཅན། །མཁས་པ་ཡུན་དུ་བསྟེན་བྱས་ནས། །རིག་པ་བློ་ལ་འཛིན་པ་ལ། །ཡི་གེ་འདི་ལྟས་ཅི་ཞིག་བྱ། །དེས་ན་དེ་ལྟར་མགུ་བའི་སྐྱེས། །བདག་གི་བརྗོད་པ་འདི་མི་སེམས། །མ་སྦྱངས་ཤེས་པའི་རྩལ་མ་རྫོགས། །བརྩོན་པའི་ཤུགས་དྲག་མི་ལྡན་བཞིན། །རིག་པ་འདི་ལ་ཞུགས་འདོད་པའི། །རང་འདྲ་རྩིས་པ་གསར་བུ་ལ། །རྟོག་དཔྱོད་དབང་གི་ཡིད་འཁྲུགས་པའི། །ངལ་བ་སྤང་ཞིང་བརྗེད་གསོས་སླད། །རྩིས་མཁན་མཁས་པའི་གསུང་གི་རྒྱུན། །ཡང་ཡང་སྒྲོགས་པའི་དོན་ཇི་བཞིན། །བཀླགས་པ་ཙམ་གྱིས་ཤེས་པའི་གཏམ། །གསལ་བར་བརྗོད་ལ་ཉེས་ཡོད་མིན། །དེ་སྐད་ཚེ་རིང་ལྷ་ལམ་ལས་འོང་པའི། །རྒྱུ་སྐར་དབང་པོ་ཇི་བཞིན་ཆེས་དཀར་རྒྱུར། །ལྷག་བསམ་དག་པའི་ཚིག་གི་ནོར་བུ་འདི། །བཀོད་པའི་དགེ་བས་ཀུན་མཁྱེན་མཆོག་ཐོབ་ཤོག །ཅེས་པ་རིག་པ་རྩིས་ཀྱི་འཇུག་སྒོ་སྤྱི་དོན་རི་མོའི་གནད་ཤིན་ཏུ་གསལ་བར་བསྟན་པའི་སྐབས་ཏེ་དང་པོའོ། །དེ་ནས་གྲངས་རྩིས་བསྟན་པ་ལ། རྩ་བའི་གྲངས་དང་གནས་གཞན་ཚོགས། །མངོན་བརྗོད་གྲངས་ཀྱི་བརྡའ་ཆད་བཅས། །འདི་རུ་བཤད་བྱ། དང་པོ་ནི། དགུ་གཅིག་གཅིག་ནི་དགུ་རང་ཡིན། །དགུ་གཉིས་གཉིས་དགུ་བཅོ་བརྒྱད་ལ། །དགུ་གསུམ་གསུམ་དགུ་ཉི་ཤུ་བདུན། །དགུ་བཞི་བཞི་དགུ་སུམ་ཅུ་དྲུག །དགུ་ལྔ་ལྔ་དགུ་བཞི་བཅུ་ལྔ། །དགུ་དྲུག་དྲུག་དགུ་ལྔ་བཅུ་བཞི། །དགུ་བདུན་བདུན་དགུ་དྲུག་ཅུ་གསུམ། །དགུ་བརྒྱད་བརྒྱད་དགུ་བདུན་ཅུ་གཉིས། །དགུ་དགུ་བརྒྱད་ཅུ་གྱ་གཅིག་གོ །བརྒྱ་གཅིག་གཅིག་བརྒྱད་བརྒྱད་རང་ཡིན། །བརྒྱད་གཉིས་གཉིས་བརྒྱད་བཅུ་དྲུག་ལ། །བརྒྱད་གསུམ་གསུམ་བརྒྱད་ཉི་ཤུ་བཞིན། །བརྒྱད་བཞི་བཞི་བརྒྱད་སུམ་ཅུ་གཉིས། །བརྒྱད་ལྔ་ལྔ་བརྒྱད་བཞི་བཅུ་ཐམ། །བརྒྱད་དྲུག་དྲུག་བརྒྱད་བཞི་བཅུ་བརྒྱད། །བརྒྱད་བདུན་བདུན་བརྒྱད་ལྔ་བཅུ་དྲུག །བརྒྱད་བརྒྱད་དྲུག་ཅུ་རེ་བཞིའོ། །བདུན་གཅིག་གཅིག་ནི་བདུན་རང་ཡིན། །བདུན་གཉིས་གཉིས་བདུན་བཅུ་བཞི་ལ། །བདུན་གསུམ་གསུམ་བདུན་ཉི་ཤུ་གཅིག །བདུན་བཞི་བཞི་བདུན་ཉི་ཤུ་བརྒྱད། །བདུན་ལྔ་ལྔ་བདུན་སུམ་ཅུ་ལྔ། །བདུན་དྲུག་དྲུག་བདུན་བཞི་བཅུ་གཉིས། །བདུན་བདུན་བཞི་བཅུ་ཞེ་དགུའོ། །དྲུག་གཅིག་གཅིག་ནི་དྲུག་རང་ཡིན། །དྲུག་གཉིས་གཉིས་དྲུག་བཅུ་གཉིས་ལ། །དྲུག་གསུམ་གསུམ་དྲུག་བཅོ་བརྒྱད་དོ། །དྲུག་བཞི་བཞི་དྲུག་ཉི་ཤུ་བཞི། །དྲུག་ལྔ་ལྔ་དྲུག་སུམ་ཅུ་ཐམ། །དྲུག་དྲུག་སུམ་ཅུ་སོ་དྲུག་གོ །ལྔ་གཅིག་གཅིག་ལྔ་ལྔ་རང་ཡིན། །ལྔ་གཉིས་གཉིས་ལྔ་བཅུ་ཐམ་པ། །ལྔ་གསུམ་གསུམ་ལྔ་བཅོ་ལྔ་ལ། །ལྔ་བཞི་བཞི་ལྔ་ཉི་ཤུ་ཐམ། །ལྔ་ལྔ་ཉི་ཤུ་རྩ་ལྔའོ། །བཞི་གཅིག་གཅིག་བཞི་བཞི་རང་ཡིན། །བཞི་གཉིས་གཉིས་བཞི་བརྒྱད་རང་ཡིན། །བཞི་གསུམ་གསུམ་བཞི་བཅུ་གཉིས་སོ། །བཞི་བཞི་དག་ནི་བཅུ་དྲུག་གོ །གསུམ་གཅིག་གཅིག་གསུམ་གསུམ་རང་ཡིན། །གསུམ་གཉིས་གཉིས་གསུམ་དྲུག་ཡིན་ལ། །གསུམ་གསུམ་དག་ལ་དགུ་ཟེར་རོ། །གཉིས་གཅིག་གཅིག་གཉིས་གཉིས་རང་ཡིན། །གཉིས་གཉིས་དག་ལ་བཞི་ཞེས་གྲགས། །གཅིག་གཅིག་དེ་ནི་གཅིག་ཉིད་དོ། །རྫོགས་དང་ཐོབ་པར་ཐིག་ལེའོ། །དེ་ལྟར་དགུ་མཐར་གྲགས་པ་འདི། །ངག་བྱང་ཡིད་ལ་ཆུབ་པ་གཅེས། །གཞན་ནི་རི་མོ་རྣམ་དག་གམ། །འགྲུབ་པར་དཀའ་ཞེས་རང་ཉིད་ཀྱང་། །མ་སྦྱངས་གཞན་ལ་གདམས་རིངས་བ། །ནེ་ཙོའི་སྤུན་ཟླ་དག་གིསའང་སྨྲ། །གཉིས་པ་གྲངས་ཀྱི་གནས་གཞན་ནི། །སངས་རྒྱས་པ་ཀུན་མཐུན་གྱུར་ཅིང་། །རྩིས་མཁན་རྣམས་ལ་གྲགས་ཆེ་བ། །སྡེ་སྣོད་མངོན་པ་ནས་གསུངས་གྲངས། །གཅིག་བཅུ་བརྒྱ་སྟོང་ཁྲི་འབུམ་དང་། །ས་ཡ་བྱེ་བ་དུང་ཕྱུར་རྣམས། །རྐྱང་པའི་གྲངས་སུ་ཤེས་པར་བྱ། །ཆེན་པོའི་ཟླ་དང་བཅས་པ་ནི། །ཐེར་འབུམ་ཁྲག་ཁྲིག་རབ་བཀྲམ་གཏམ། །དཀྲིགས་དང་མི་འཁྲུགས་ཁྱད་ཕྱིན་དང་། །སྤང་བརྟེན་དེད་འདྲེན་མཐའ་སྣང་དང་། །སྒྱུ་རིག་འོད་མཛེས་དབང་པོ་དང་། །ལེགས་ཕྱིན་རྟོགས་འགྲོ་འབྱིན་སྡུལ་དང་། །རྒྱ་སྟག་སྟོབས་འཁོར་བརྡའ་ཤེས་དང་། །རྣམ་འབྱུང་སྟོབས་མིག་ཉི་ཤུ་གཅིག །བར་དུ་བརྒྱད་ནི་མ་སྙེད་པས། །རང་གི་མིང་གང་རུང་བ་ཞུགས། །གྲགས་མེད་བར་དུ་བཅུ་འགྱུར་བསྒྲེས། །ཚིགས་བཅད་དེ་ནི་མཁས་པས་ལུང་། །སིལ་བུ་ལས་ནི་གྲངས་བཞིན་སྟེ། །དེ་ལ་བསྣན་འོས་བརྒྱད་ཀྱི་མིང་། །ཚད་མེད་བཞི་འམ་བསྡུ་བ་བཞི། །ཉལ་ཉོལ་ལ་སོགས་གང་རུང་བཞི། །ཆེན་པོར་བཅས་པས་ཁ་འགེངས་ཞེས། །མཁསམཆོག་མཁྱེན་གཏེར་ཅན་དེས་གསུངས། །འདིར་ནི་བྱམས་པ་སྙིང་རྗེ་དང་། །དགའ་བ་བཏང་སྙོམས་ཆེ་བསྣན་བརྒྱད། །དམ་པས་བཞེད་བཞིན་རང་ལུགས་བཞག །གཞན་ཡང་མདོ་དང་རྒྱུད་སྡེ་ནས། །གྲངས་གཞན་རྣམས་གྲངས་མི་འདྲ་བ། །ཇི་སྙེད་གསུངས་ལས་ཅུང་ཟད་གཅིག །ཤེས་བྱའི་ཆེད་དུ་འདིར་བརྗོད་ན། །ཐེག་ཆེན་རྒྱ་ཆེ་རོལ་པའི་མདོར། །བདག་ཅག་སྟོན་པ་གཞོན་ནུ་ཡི། །རོལ་རྩེད་སྐབས་སུ་རྩིས་མཁན་ཆེ། །སྲིད་སྒྲུབ་ཞེས་པར་བཀའ་སྩལ་གྲངས། །བྱེ་བ་ཐེར་འབུམ་ཁྲག་ཁྲིག་དང་། །གཏམ་དང་དཀྲིགས་དང་མི་འཁྲུགས་པ། །ཁྱད་འབྱིན་ཕང་སྟེང་མདའ་འཛིན་དང་། །གླང་པོའི་སྟོབསདང་ངོག་ཐོབ་དང་། །རྣམ་པར་བཞག་གདགས་རྒྱུ་རིག་པ། །ལག་སྦྱིན་རྒྱུད་དབང་རྫོགས་ཐོབ་དང་། །བསྒྲངས་རྟོགས་སྒྲིབ་པ་དང་ནི་སྟོབས། །ཀུན་སྟོབས་རྣམ་པར་བརྡའ་ཤེས་ལྡན། །བརྡའ་ཀུན་ཤེས་དང་རྣམ་པར་འབྱུང་། །དེ་ཡི་མཚན་ཉིད་ཅེས་བྱ་སྟེ། །དེ་ལྟར་གྲངས་གནས་ཉི་ཤུ་བཞི། །བྱེ་བ་བརྒྱ་ནི་ཐེར་འབུམ་སྟེ། །དེ་བཞིན་བརྒྱ་ཡི་གོང་དུ་བསྒྲེས། །དེ་ཡི་མཚན་ཉིད་ཅེས་བྱའི་རྩིས། །འདི་ནི་རི་ཡི་རྒྱལ་པོ་གང་། །རྩིས་གཞིར་བྱས་ཀྱང་ཆོད་པར་བྱེད། །དེ་ཡི་མཚན་ཉིད་གོང་དུ་ནི། །རྒྱལ་མཚན་རྩེ་མོ་ནོར་བུའི་གྲངས། །དེས་ནི་གངྒཱ་ཀླུང་དག་ནི། །བྱེད་སྙེད་རྩིས་གཞིར་བྱས་ཀྱང་གཅོད། །དེ་ཡི་གོང་ནའང་རིམ་པ་བཞིན། །རྒྱལ་མཚན་རྩེ་མོ་ངེས་སྒྲོགས་དང་། །དེད་འདྲེན་གདགས་པ་གཏན་ལ་འབེབས། །གཅོད་རྟོགས་གཅོད་རྟོགས་ལྡན་པ་རྣམས། །ཐམས་ཅད་རྣམ་པར་འབྱེད་ཞེས་ཏེ། །དེས་ནི་གངྒཱ་ཀླུང་བཅུ་ཡི། །བྱེ་མ་རྩིས་གཞིར་བྱས་ཀྱང་ཆོད། །དེ་གོང་སྙིང་པོ་མཆོག་ཤེས་གྲངས། །དེས་ནི་གངྒཱ་ཀླུང་བྱེ་བ། །ཕྲག་བརྒྱའི་བྱེ་མའང་རྩིས་གཞིར་གཅོད། །དེ་ཡི་གོང་ན་རྡུལ་ཕྲ་རགས། །འཇུག་པའི་རྗེས་སུ་སོང་བ་ཞེས། །གྲངས་དེ་ས་བཅུ་རྒྱུན་མཐའ་བའི། །སྤྱོད་ཡུལ་ཁོ་ནར་གསུངས་པ་དང་། །རྒྱལ་མཚན་རྩེ་མོའི་ནོར་བུ་ནས། །ཕྲ་རགས་ལ་འཇུག་རྗེས་སོང་བར། །གནས་བརྒྱད་བསྒྲོས་ཚད་མ་གསུངས་པས། །གོང་གི་བརྒྱ་འགྱུར་རིག་པ་ཡི། །བཟུང་ཡུལ་མིན་པར་ཁོ་བོས་རྟོགས། །གཞན་དཀའི་གྲངས་ཀྱི་བརྡར་ཤེས་སོ། །གཞན་ཡང་ཐེག་ཆེན་སྔགས་ཀྱི་རྒྱུད། །འཇམ་དཔལ་རྩ་བའི་ཆོ་ག་རུ། །དེ་བཞིན་གཤེགས་པ་ཤཱཀ་ཐུབ་ཀྱི། །འཇམ་དཔལ་ལ་གསུང་གྲངས་རྩིས་ནི། །འདི་ལྟར་གཅིག་བཅུ་བརྒྱ་སྟོང་ཁྲི། །འབུམ་ཕྲག་བྱེ་བ་ས་ཡ་དང་། །དུང་ཕྱུར་རྣམས་ནི་བསྐྱང་པ་སྟེ། །དེ་ནས་ཐེར་འབུམ་ཆེ་ཆུང་གཉིས། །ཤུ་རྔོག་མཆོག་ཉལ་རེ་རེའོ། །ཡང་ནི་རྐྱང་ཕྱེད་ཁྱད་འབྱིན་དང་། །སྒྱུ་མ་མཚོ་ཡས་རྣམས་དང་ནི། །དུག་ཆེན་རྒྱ་མཚོའི་བར་དུ་ནི། །ཀུན་ཀྱང་ཆེན་པོའི་ཟླ་བཅས་ཡིན། །མཆོག་བྱས་བན་བུན་རེ་རེའོ། །དེ་ནས་མ་ལུས་ཆེ་ཆུང་གཉིས། །དེ་ཡི་འོག་ཏུ་གྲངས་མེད་དེ། །དེ་ལྟར་གྲངས་མེད་བཅུ་དཔག་མེད། །དཔག་མེད་སྟོང་མེད་འཇིག་རྟེན་ཞེས། །འཇིག་རྟེན་བཅུ་ནི་འཇིག་རྟེན་ཆེ། །དེ་འོག་མུན་པ་སྐྱང་བའི་གྲངས། །སྣང་བ་ཕུང་པོ་ཆེ་བཅས་གཉིས། །ཕུང་པོ་ཆེ་བཅུ་ཟབ་པར་བརྗོད། །དེ་ནས་རིམ་བཞིན་བསྟེན་པ་དང་། །རབ་བརྟན་གྲངས་མང་ལྡན་རེ་རེ། །ཡང་ནི་གནས་དང་གནས་ཆེན་པོ། །དཔག་དང་དཔག་མེད་ཆེན་པོ་དང་། །དོན་ཆེན་རབ་འབྱོར་རྒྱ་མཚོ་ཆེ། །ཕན་པ་མཆོག་དང་གཙོ་བོ་ཁྱིམ། །དེ་མཐར་བསམ་མི་ཁྱབ་ཏུ་བརྗོད། །དེ་ནས་ཡང་ནི་མི་ཟད་གཟུགས། །རྒྱལ་ཐབས་འདོད་དང་དགེ་བ་རྣམས། །ཟླ་དང་བྲལ་བ་རེ་རེའོ། །དེ་ལས་སེམས་ལས་འབྱུང་ཆེ་ཆུང་། །སེམས་རྣམས་དབྱིངས་དང་བརྗོད་པ་དང་། །བརྗོད་མེད་རྣམས་ནི་རེ་རེའོ། །བསྙད་ཡས་དང་ནི་ཕྱར་ཕྱུར། །ཤུ་རྔོག་རྣམས་ནི་ཆེ་བཅས་ཉིད། །དེ་ནས་དགེ་ཞིང་ཞི་བ་ཞེས། །རྩིས་ཀྱི་ཕར་ཕྱིན་གནས་སུ་གསུངས། །དེ་ནས་ཡང་ནི་ཆུ་འབྱུང་དང་། །སེམས་སྐྱོད་དཔག་དང་དམ་པ་དང་། །སངས་རྒྱུ་ཡུལ་དང་འཕེལ་བྱེད་པ། །དེ་ཡི་མཐར་ནི་སངས་རྒྱས་ཀྱི། །གོ་འཕང་དང་ནི་སྤྱོད་ཡུལ་ལོ། །དེ་ཡང་སངས་རྒྱས་ཞིང་གངྒཱའི། །བྱེ་སྙེད་ཀུན་བསྡུས་རྡུལ་ཕྲ་རགས། །མ་ལུས་བསིལ་བ་གྲངས་རྩིས་དཔེར། །འདུལ་མཁས་རྒྱལ་བ་མཆོག་དེས་གསུངས། །དོན་དུ་ནམ་མཁའི་མཐའ་ཅི་ཙམ། །ཆེས་ཕྲའི་རྡུལ་ཕྲན་ཆར་སིལ་གྲངས། །སངས་རྒྱས་ཀྱིས་མཁྱེན་གཞན་གྱིས་མིན། །དེར་བསམ་དད་པས་འདུད་ཕྱག་འཚལ། །རྒྱུད་འདིར་གཅིག་ནས་འཕེལ་བྱེད་པར། །གྲངས་གནས་བདུན་ཅུ་རྩ་གཅིག་ལས། །ཟབ་པ་ཡན་ཆད་འཇིག་རྟེན་ཆུང་། །མ་རྟོགས་གཞན་ཀུན་བཅུ་འགྱུར་གསུངས། །དེ་ལྷག་གྲངས་གཞན་གནས་གྱུར་པའི། །སུམ་ཅུ་རྩ་བཞིའི་བསྒྲེས་བྱེད་ཚད། །གཞུང་ལས་གསལ་བར་མ་གསུངས་པས། །འདིར་ཡང་རྟོགས་པར་མི་ནུས་སོ། །གཞན་ཡང་འཇམ་དཔལ་རྩ་རྒྱུད་འདིར། །འཇིག་རྟེན་ལུགས་ཀྱི་གྲངས་རྩིས་ཞེས། །སྔོན་དུས་འཕགས་ཡུལ་སྤྱིར་གྲགས་སམ། །ཡང་ན་རིག་བྱེད་གཞུང་ཉིད་དམ། །དེ་ཡི་རིགས་སྔགས་དག་གི་རྒྱུད། །ཕལ་པ་དག་ཏུ་བརྟན་གྱུར་གྲངས། །གཅིག་བཅུ་བརྒྱ་སྟོང་ཁྲི་འབུམ་དང་། །ས་ཡ་བྱེ་བ་དུང་ཕྱུར་དང་། །ཐེར་འབུམ་ཤུགས་རྔོག་མཆོག་ཉལ་དང་། །སྐྱེ་འཕྱིས་བྱེ་མ་ནབ་ནུབ་དང་། །མཚོ་ལས་ལྟབས་ཕྱོ་རྫི་ཞེ་གནས། །བཅོ་བརྒྱ་གོང་དུ་བསྡུ་འགྱུར་བསྒྲེ། །དེ་ལྟར་འདིར་ནི་རྣམ་གྲངས་ཚུལ། །ཐེག་ཆེན་མདོ་དང་སྔགས་རྒྱུད་ནས། །བཤད་པའི་གྲངས་རྩིས་རིགས་གསུམ་དང་། །མངོན་པ་དང་བཅས་བཞི་ཡིན་ལ། །གཞན་ནི་རྒྱས་པའི་མདོ་ཕལ་ཆེན། །བྱང་ཆུབ་སེམས་གནས་ལེའུ་རུ། །འཕགས་པ་སེམས་ཀྱི་རྒྱལ་པོ་ལ། །བདག་ཅག་སྟོན་པས་བཀའ་སྩལ་གྲངས། །བརྒྱ་སྟོང་ཕྲག་བརྒྱ་ནི་བྱེ་བ། །དེ་བཞིན་རིམ་པར་བསྒྲངས་བ་ཡི། །ཤིན་ཏུ་བརྟན་པ་ཞེས་བྱའི་བར། །གྲངས་གནས་བརྒྱ་དང་སུམ་ཅུ་དང་། །དེ་བཞིན་རྒྱས་པའི་མདོ་ཆེན་དེའི། །སྡོང་པོ་བཀོད་པའི་ལེའུ་རུ། །བྱང་སེམས་ཚོང་དཔོན་ནོར་བཟང་ལ། །ལྷ་མོ་དགེ་བསྙེན་ཡིད་བཞིན་གྱི། །བཤད་པ་བྱང་ཆུབ་སེམས་དཔའི་རྩིས། །གཅིག་ནས་བརྗོད་མེད་བརྗོད་མེད་པ། །བསྒྲེས་པར་གྲངས་ནས་བརྒྱ་ཕྲག་ལྷག །བཞི་བཅུ་རྩ་བཞི་ཡོད་པ་དང་། །དེ་བཞིན་བྱང་སེམས་ཁྱེའུ་གཟུང་། །དབང་པོའི་དབང་ཕྱུག་གིས་གསུངས་པ། །བརྒྱ་ནས་ཤིན་ཏུ་བརྟན་པའི་བར། །གྲངས་གནས་བརྒྱ་དང་སོ་གཅིག་དང་། །ཁྱིམ་བདག་འཕགས་པ་ནན་ཁུག་གི །བརྒྱ་ནས་བརྗོད་མེད་ཡང་བརྗོད་མེད། །བར་གྱི་གྲངས་གནས་སུམ་ཅུ་སོགས། །ཕལ་ཆེན་སྡོང་བཀོད་ནས་གསུང་ཞིང་། །དེ་ལྟར་བཀའ་ལས་གྲངས་རྣམས་བཞག །མང་ཉུང་ཇི་སྙེད་སྣང་གྱུར་དང་། །བསྟན་བཅོས་འདུས་བྱས་འདུས་མ་བྱས། །རྣམ་པར་ངེས་ལས་གྲངས་དྲུག་ཅུ། །གསུང་དང་འཆི་མེད་སེང་གེ་ཡི། །མངོན་བརྗོད་མཛོད་ལས་རིག་བྱེད་པའི། །ལུགས་བསྒྱུར་གཅིག་ནས་གྲངས་མེད་བར། །གྲངས་གནས་ཉི་ཤུ་རྩ་གཅིག་ཏུ། །བཤད་པ་སོགས་ནི་ཤེས་འདོད་ན། །རང་རང་གཞུང་དེར་བལྟ་བར་བྱོས། །ཉེར་མཁོ་གོང་བསྟན་གྱིས་རྟོགས་འཐུས། །འདིར་གཞན་ཞིབ་པར་མ་སྨོས་སོ། །གྲངས་འདིར་ས་ཡ་བྱེ་བ་ཞེས། །སྤྱིར་བཏང་ཀུན་ལ་དེ་ཡིན་ཡང་། །བོད་སྔགས་རྙིང་པའི་གཞུང་འགའ་རུ། །བྱེ་བ་ས་ཡ་ཞེས་པར་འདོད། །དེ་ནི་འཕགས་ཡུལ་བརྡའ་གཅིག་ལ། །བོད་སྐད་འགྱུར་ཁྱད་བྱུང་བར་སེམས། །དེ་ཚུལ་སྤྱི་ལྟ་ཡིན་སྙམ་ན། །ཞིབ་མོར་བཤད་ཀྱི་འཕགས་ཡུལ་དུ། །འབུམ་ཕྲག་སྐད་དོད་ལཀྵའི་མཐར། །འབུམ་ཕྲག་མིང་ནི་ཡུ་དྷ། །འབུམ་ཕྲག་བརྒྱ་ལ་ཀོ་ཊཱི་ཞེས། །རིམ་པར་གནས་ལ་འགྱུར་སྔ་མས། །ནི་ཡུ་དྷ་ནི་བྱེ་བར་མཛད། །ཕྱི་མས་ས་ཡ་ཞེས་སུ་བསྒྱུར། །དེ་བཞིན་ཀོ་ཊཱི་འགྱུར་སྔ་མས། །ས་ཡ་ཕྱི་མས་བྱེ་བར་བསྒྱུར། །འགྱུར་ཁྱད་དེ་ལྟ་ཡིན་པར་གྲུབ། །དེ་ཡང་བོད་རྙིང་གྲངས་གནས་ཀྱི། །རྒྱ་དཔེ་མཐོང་ན་དཔྱད་བྱ་སྟེ། །འོན་ཀྱང་འདིར་བརྗོད་ཉིད་ངེས་སྙམ། །སྤྱིར་ནི་ས་ཡ་བྱེ་བ་ལ། །སྐད་དོད་མང་ངོ་ཤེས་པར་གྱིས། །དེ་ཡང་གྲངས་རྩིས་མང་འདི་ཀུན། །འདོད་རྒྱལ་ཉིད་དུ་བརྟགས་པས་ན། །རྒྱུ་མཚན་བཤད་པར་མི་ནུས་ཞེས། །མཁས་པའི་གསུང་བཞིན་ལེགས་པར་རྟོགས། །ད་ནི་གསུམ་པ་གྲངས་ཀྱི་མིང་། །མངོན་པར་བརྗོད་པའི་བརྡའ་བསྟན་པ། །རང་བཞིན་ངོ་བོ་ཚུལ་དང་གཟུགས། །ཟླ་བ་རི་བོང་ཅན་རྣམས་གཅིག །ཕྱོགས་བསྒྲོད་མིག་ལག་ཟུང་ཁྲིག་གཉིས། །དུས་མེ་བསྲེག་ཟ་བརྣག་རྟེན་དང་། །ཡོན་ཏན་རྩེ་མོ་ཅན་རྣམས་གསུམ། །ཆུ་གཏེར་རིག་བྱེད་དུས་མཚོ་བཞི། །མདའ་དང་དབང་པོ་འབྱུང་བ་ལྔ། །དུས་དང་འོད་ཟེར་རོ་ནི་དྲུག །ཐུབ་པ་གཟའ་ཡི་ས་འཛིན་བདུན། །ནོར་ལྷ་ཀླུ་དང་ལྟོ་འགྲོ་དང་། །ལག་འགྲོ་གདེངས་ཅན་རྣམས་ནི་བརྒྱད། །གཟའ་བུག་སྲིན་པོ་དགུ་རུ་གྲགས། །ཕྱོགས་ནི་བཅུ་ངེས་སྐབས་འགའ་རུ། །བུག་པ་གཟའ་ཡང་བཅུར་འཇུག་མཐོང་། །དྲག་པོ་འཕྲོག་བྱེད་བདེ་བྱེད་དང་། །དབང་ཕྱུག་ལ་སོགས་བཅུ་གཅིག་མིང་། །ཉི་མ་ཉིན་བྱེད་ཁྱིམ་བཅུ་གཉིས། །མྱོས་བྱེད་འདོད་པ་བཅུ་གསུམ་མོ། །སྲིད་པ་མ་ནུ་ཡིད་བཅུ་བཞི། །ཚེས་དང་ཉིན་ཞག་བཅོ་ལྔའོ། །མི་བདག་རྒྱལ་པོ་བཅུ་དྲུག་འཇུག །ཉེས་པ་སྐྱོན་ནི་བཅོ་བརྒྱད་དོ། །རྒྱལ་དབང་རྒྱལ་བ་ཉེར་བཞི་ཡིན། །ཉེར་ལྔ་ལ་ནི་དེ་ཉིད་བརྗོད། །སྐར་མ་འཁོར་ལོ་ཉེར་བདུན་ནོ ། །སོ་ནི་སུམ་ཅུ་རྩ་གཉིས་དྲན། །མིང་དེ་རྣམས་ནི་བསྡུས་པའི་རྒྱུད། །རྩ་འགྲེལ་ལས་གསུང་མདོ་ཙམ་སྟེ། །གཞན་ནི་འཕགས་ཡུལ་ལས་བྱུང་བ། །རིག་བྱེད་མངོན་བརྗོད་གཞུང་རྣམས་ལས། །གྲགས་པ་གང་ཡིན་དེར་རྟོགས་བྱ། །ཆ་ཤས་གཞན་དུ་བརྗོད་ཀྱང་འདོད། །ཕྱིས་འབྱུང་བོད་བློ་གསར་བཞག་བརྡའ། །མང་མཐོང་འདིར་ནི་བཏང་སྙོམས་སོ། །དེ་སྙད་ཚེ་ལྡན་ཡིད་ཀྱི་དབང་གསལ་ཞིང་། །རིག་པ་འདིར་འཇུག་འདོད་པ་གཞུ་ལོ། །གྲངས་རྩིས་ནོར་བུའི་འཕྲེང་བ་བསྒྲངས་བཞིན་འདི། །སྤེལ་མཐུས་ཀུན་མཁྱེན་རྒྱལ་བའི་གནས་ཐོབ་ཤོག །ཅེས་རིག་པ་རྩིས་ཀྱི་འཇུག་སྒོ་གྲངས་རྩིས་ཀྱི་གནས་གསལ་བར་བསྟན་པའི་སྐབས་དེ་གཉིས་པའོ། །དེ་ནས་བྱེ་བྲག་སྐར་རྩིས་ཀྱི། །རྩི་བྱ་ཡང་ནི་རྩི་བའི་གཞི། །ལོ་ཟླ་དུས་ཟེར་ཁྱིམ་སྐྱེས་ཞིང་། །དབུགས་སྲང་དབྱུག་ཞག་གཟའ་དང་ཚེས། །སྐར་སྦྱོར་བྱེད་འཕྲོད་སྟོབས་དུས་སྦྱོར། །རྟེན་འབྲེལ་དེ་རྣམས་འཕྲོས་བཅས་དང་། །ཕྱི་ནང་སྦྱོར་བའི་ཚུལ་ཅུང་ཟད། །མཚོན་པ་ཙམ་ཡང་བཤད་པ་སྟེ། །དེ་ལ་དང་པོ་ལོའི་ཐ་སྙད། །ཉི་མས་བཅུ་གཉིས་ཁྱིམ་བསྒྲོད་ཅིང་། །ཟླ་བ་ཡར་མར་ངོ་ཉེར་བཞི། །དབྱར་དགུན་སྟོན་དཔྱིད་དུས་བཞི་པོ། །ཚང་ལ་ཀུན་ཏུ་ལོ་རུ་གྲགས། །ལེགས་སྦྱར་སྐད་དུ་ཝབཏྤཪྵ་ཞེས། །ངེས་ཚིག་ཡོངས་བགྲངས་དང་བགྲངས་གཞི། །འགྲོ་འོང་དང་ནི་འདོར་བྱེད་ཞེས། །འཆི་མེད་མཛོད་ལས་ལེགས་པར་བཤད། །དེ་ལྟར་ལོ་ལ་བྱེ་བྲག་མིང་། །འཕགས་ཡུལ་ཕྱི་རོལ་བྱེད་ཀུན་ལ། །ཉི་མ་ལྟར་གྲགས་རབ་བྱུང་སོགས། །བཅོམ་ལྡན་གསང་བའི་བདག་པོ་ཡི། །བདེ་མཆོག་འགྲེལ་པར་བསྟན་པ་ནི། །རབ་བྱུང་རྣམ་བྱུང་དཀར་པོ་དང་། །རབ་མྱོས་སྐྱེས་བདག་ཨངྐི་ར། །དཔལ་ཞལ་དངོས་པོ་ལང་ཚོ་ལྡན། །འཛིན་བྱེད་དབང་ཕྱུག་འབྲུ་མང་པོ། །བག་ལྡན་རྣམ་གནོན་ཁྱུ་མཆོག་དང་། །སྣ་ཚོགས་ཉི་མ་ཉི་སྒྲོལ་བྱེད། །ས་སྐྱོང་མི་ཟད་ཐམས་ཅད་འདུལ། །ཀུན་འཛིན་དཔའ་བདག་རྣམ་འགྱུར་དང་། །བོང་བུ་དགའ་བ་རྣམ་རྒྱལ་བ། །རྒྱལ་བ་མྱོས་བྱེད་གདོང་ངན་པ། །གསེར་འཕྱང་གནམ་འཕྱང་བསྒྱུར་བྱེད་དང་། །ཀུན་ལྡན་འཕར་བ་དགེ་བྱེད་པ། །མཛེས་བྱེད་ཁྲོ་མོ་སྣ་ཚོགས་དབྱིག །ཟིལ་གནོན་སྤྲེའུ་ཕུར་བུ་དང་། །ཞི་བ་ཐུན་མོང་འགལ་བྱེད་དང་། །ཡོངས་འཛིན་བག་བྲལ་ཀུན་དགའ་དང་། །སྲིན་པོ་ཨ་ན་ལ་དམར་སེར། །དུས་ཀྱི་ཕོ་ཉ་དོན་གྲུབ་གྲག །བློ་དཀའ་རྔ་སྒྲ་དམར་འགྲོ་དང་། །འདོད་དབང་ཁྲོ་བོ་ཟད་པའོ། །དེ་ལྟར་དྲུག་ཅུ་ལོ་ཡི་མིང་། །འདི་ལ་ལོ་ཙཱ་སྔ་ཕྱི་ཡིས། །འགྱུར་ཁྱད་རབ་བྱུང་རྣམ་བྱུང་ལ། །རབ་སྐྱེས་འབྱོར་པ་ཞེས་སུ་འདོན། །དེ་སོགས་འདྲ་མིན་མཆིས་ལས་འདིར། །ཅུང་ཟད་མཛེས་པའི་ཆ་བསྡུས་བྱས། །དེ་ལྟར་འཕགས་ཡུལ་ལོ་ཡི་མིང་། །མ་ཧཱ་ཙི་ནའི་གཙུག་ལག་ལས། །ཕོ་མོ་ཟུང་སྡེབ་ལོ་བཅུ་གཉིས། །བྱི་གླང་སྟག་ཡོས་འབྲུག་སྦྲུལ་དང་། །རྟ་ལུག་སྤྲེལ་བྱ་ཁྱི་ཕག་རྣམས། །ལྔས་བསྒྱུར་ལོ་རྒན་དྲུག་ཅུའོ། །རྒྱ་ནག་རིག་བྱེད་འབྱུང་ལྔའི་བརྡའ། །ཀེག་ཇི་ཀུང་གཤང་འུ་ཞེས་པ། །ཤིང་མེ་ས་ལྕགས་ཆུ་ཁམས་ཏེ། །འདི་ནི་འཕགས་ཡུལ་དབྱངས་ཡིག་བཞིན། །རྒྱ་ཡུལ་ཚིག་གི་སྡེབ་སྦྱོར་བཞི། །མཐའ་དག་འདི་ལ་བརྟེན་པར་སྣང་། །ལོ་ཡི་དང་པོ་ཤིང་བྱི་ལ། །དྲུག་ཅུའི་ཐ་མ་ཆུ་ཕག་འདོད། །འདིར་ནི་རབ་བྱུང་མེ་ཡོས་སྦྱར། །ཟད་པ་མེ་སྟག་མཐའ་ཡིན་ཞེས། །བོད་འདིར་སྔོན་གྱི་མཁས་པ་འགས། །གསུང་ལྟར་ཀུན་གྱི་འཕྱམ་བརྡལ་སྒྲོགས། །ད་ལྟའི་དུས་སུ་འཕགས་ཡུལ་ལྷོ། །འབིགས་བྱེད་ཁོངས་སུ་དེ་མཐུན་འདོད། །འབིགས་བྱེད་བྱང་ཕྱོགས་རྒྱ་བལ་ཀུན། །རབ་བྱུང་མེ་སྦྲུལ་ནས་བརྩམ་སྦྱོར། །འདོད་ཚུལ་དེ་ལྟ་ཕྱིན་ཆད་དུ། །ཤེས་ཀུན་ཡི་གེ་འདི་འཐུས་སོ། །གཞན་ཡང་བདེ་མཁས་ཁ་ཅིག་གི །རབ་བྱུང་ཤིང་བྱིར་སྦྱོར་བའང་ཡོད། །དེ་ལྟར་རྒྱ་ནག་འབྱུང་ལྔ་ཤིང་། །ལུགས་གཞན་རླུང་དང་གནད་གཅིག་ཅིང་། །ལྕགས་ནི་རྡོ་སྟེ་ས་ཡི་ཁམས། །ལྷག་མ་རྣམས་ནི་མཐུན་པ་ཉིད། །དེ་ནས་གཉིས་པ་ཟླ་བ་ཡི། །ངེས་པ་ཡར་དམར་ངོ་དཀར་ནག །ཆ་ཤས་བཅོ་ལྔ་གཉིས་རྫོགས་པར། །བཞག་སྟེ་ལེགས་སྦྱར་སྐར་མ་སཱ། །དེ་མིང་བྱེ་བྲག་རྒྱ་ནག་ཏུ། །འབྱུང་པོའི་མིང་དང་དུས་ཀྱི་མཐའ། །ཆེན་པོ་ཧོར་གྱི་ཟླ་གྲངས་དང་། །བོད་ཀྱི་བསྟན་བཅོས་ཆེན་པོའི་ལུགས། །རྒྱ་གར་སྤྱིར་གྲགས་རིག་བྱེད་ལས། །ཟླ་བའི་ཉ་སྐར་ཉི་མའི་ཁྱིམ། །ཁྱད་འཕགས་རྒྱལ་བས་རྒྱུད་རྣམས་སུ། །རྟེན་འབྲེལ་ཉིད་དང་མིང་བྱེ་བྲག །དེ་ལྟར་རྣམ་གྲངས་བརྒྱད་པོ་ཉིད། །གོ་རིམ་བཞིན་དུ་བཤད་བྱ་སྟེ། །དེ་ཡང་ལོ་མགོ་ཟླ་བའི་དབུ། །འཛིན་ཚུལ་མི་གཅིག་མང་ན་ཡང་། །གཟའ་རྣམས་རྟག་པའི་ལོངས་སྤྱོད་ནི། །ཐོག་མ་ལུག་ཁྱིམ་ནས་བརྩམ་པས། །དེས་ན་སྐར་རྩིས་ཟླ་བའི་དབུ། །ནག་པ་ནས་བརྩམ་དེ་བཞིན་འཆད། །རྒྱ་ནག་སྦྲུལ་ཟླ་དབྱར་ར་བ། །ཧོར་ཟླ་གསུམ་པ་དཔྱིད་ཟླ་འབྲིང་། །འཕགས་ཡུལ་ནག་ཟླ་ལུག་གི་ཁྱིམ། །རྒྱུད་ནས་མིང་གཟུགས་ཁྱུ་མཆོག་ཟླ། །རྒྱ་ནག་རྟ་ཟླ་དབྱར་འབྲིང་པོ། །ཧོར་ཟླ་བཞི་པ་དཔྱིད་ཐ་ཆུང་། །འཕགས་ཡུལ་ས་ག་གླིང་གི་ཁྱིམ། །རྒྱུད་ནས་སྐྱེ་མཆེད་རུས་སྦལ་ཟླ། །དེ་བཞིན་ལུག་ཟླ་དབྱར་ཐ་ཆུང་། །ཧོར་ཟླ་ལྔ་པ་དབྱར་ར་བ། །སྣྲོན་གྱི་ཟླ་བ་འཁྲིག་པའི་ཁྱིམ། །རྟེན་འབྲེལ་རེག་དང་ཆུ་སྲིན་ཟླ། །དབང་ཆེན་སྤྲེའུ་ཟླ་སྟོན་ར་བ། །ཧོར་ཟླ་དྲུག་པ་དབྱར་འབྲིང་པོ། །ཆུ་སྟོད་ཟླ་བ་སྦལ་པའི་ཁྱིམ། །ཚོར་བ་དང་ནི་ཡུགས་སའོ། །བྱ་ཟླ་སྟོན་ཟླ་འབྲིང་པོ་དང་། །ཧོར་ཟླ་བདུན་པ་དབྱར་ཐ་ཆུང་། །གྲོ་ཞུན་ཟླ་བ་སེང་གེའི་ཁྱིམ། །སྲེད་དང་རྨེ་བའི་ཟླ་བའོ། །ཁྱི་སྟེ་སྟོན་ཟླ་ཐ་ཆུང་ཉིད། །ཧོར་ཟླ་བརྒྱད་པ་སྟོན་ར་བ། །ཁྲུམས་ཟླ་བུ་མོའི་ཁྱིམ་ཞེས་བྱ། །ལེབ་པའི་ཟླ་བ་འབུག་པའོ། །ཕག་གི་ཟླ་བ་དགུན་ར་བ། །ཧོར་ཟླ་དགུ་པ་སྟོན་འབྲིང་པོ། །དབྱུག་དགུའི་ཉ་བ་སྲང་གི་ཁྱིམ། །སྲིད་དང་འཕྱོ་བའི་ཟླ་བའོ། །བྱི་བ་དགུན་ཟླ་འབྲིང་པོ་ནི། །ཧོར་ཟླ་བཅུ་པ་སྟོན་ཐ་ཆུང་། །སྨིན་དྲུག་ཟླ་བ་སྡིག་པའི་ཁྱིམ། །སྐྱེ་བ་དང་ནི་རྨི་ལམ་མོ། །གླང་ཟླ་དགུན་ཐ་ཟླ་འཁོར་མཐའ། །ཧོར་ཟླ་བཅུ་གཅིག་དགུན་ར་སྟེ། །དེ་ནི་མགོ་ཟླ་གཞུ་ཡི་ཁྱིམ། །རྒ་ཤི་ས་ཡི་དབང་ཕྱུག་གོ །ཟླ་བའི་རྒྱལ་པོ་སྟག་དཔྱིད་ར། །ཧོར་ཟླ་བཅུ་གཉིས་དགུན་འབྲིང་པོ། །ཟླ་དང་རྒྱལ་འཛོམ་ཆུ་སྲིན་ཁྱིམ། །རྟེན་འབྲེལ་མ་རིག་ཟླ་འཕེལ་བ། །ཡོས་ཀྱི་ཟླ་བ་དཔྱིད་འབྲིང་པོ། །ཧོར་ཟླ་དང་པོ་དགུན་ཐ་ཆུང་། །མཆུ་ཡི་ཟླ་བ་བུམ་པའི་ཁྱིམ། །འདུ་བྱེད་ཟླ་བ་གཏི་མུག་གོ །འབྲུག་གི་ཟླ་བ་དཔྱིད་ཐ་ཆུང་། །ཧོར་ཟླ་གཉིས་པ་དཔྱིད་ར་བ། །སྦོ་ཡི་ཟླ་བ་ཉ་ཡི་ཁྱིམ། །རྣམ་ཤེས་དང་ནི་བཟང་པོའོ། །དེ་ལྟར་ཟླ་མིང་སྡེ་ཚན་དུ། །སྡེབ་ནས་གོ་བདེར་མདོར་སྤེལ་བྱས། །རྒྱ་ནག་སྐད་དུ་ཟླ་བའི་མིང་། །ཡོལ་ཞེས་བོད་ཀྱི་སྔོན་རྣམས་སྨྲ། །རྒྱ་ནག་ལི་ཐུར་ཡྭད་ཞེས་པ། །ཡོད་ཞེས་ཤིན་ཏུ་མཁས་པས་ཏེ། །དེས་གསུང་རྒྱ་ནག་ལི་ཐུ་ལྟར། །ཧོར་ཟླ་གཅིག་ནས་བཅུ་གཉིས་བར། །ཅིན་ཡྭད་ཨོ་ཡྭད་གསན་ཡྭད་དང་། །གསི་ཡྭད་འུ་ཡྭད་ལིའུ་ཡྭད། །ཚེ་ཡྭད་པཱ་ཡྭད་ཅིའུ་ཡྭད། །ཤི་ཡྭད་ཧོར་ཟླ་བཅུ་པ་ཡིན། །ཤི་ཡི་ཡྭད་ནི་བཅུ་གཅིག་པ། །ཤི་ཨོ་ཡྭད་ནི་བཅུ་གཉིས་སོ། །དེ་བཞིན་སེམས་ཅན་མིང་གིས་བརྡས། །བཞག་པ་སྟག་ལ་ཡིན་ཞེས་བྱ། །ཡོས་ལ་མོ་འབྲུག་ལ་ཤནྟ། །གསི་སྦྲུལ་འུ་རྟ་ལུག་ལ་ཟའི། །ཞ་སྤྲེལ་ཡེའུ་བྱ་ཟུའི་ཁྱི། །ཧའི་ཕག་མགོ་བྱི་བར་ཙི། །ཆའོ་གླང་སྟེ་ཀུན་གྱི་མཐར། །ཡྭད་སྦྱར་དེ་དེའི་ཟླ་བར་ཤེས། །གཞན་ཡང་རྡོ་རྗེ་གདན་བཞི་དང་། །རྡོ་རྗེ་མཁའ་འགྲོ་ནས་གསུང་པའི། །ཟླ་མིང་ཁྱུ་མཆོག་ལ་སོགས་པ། །ལེགས་སྦྱར་སྐད་དུ་སྨོས་པ་ན། །རི་ཥྲ་བ་དང་ཀུརྨ་དང་། །མ་ཀ་ར་ཧ་རཱཎྜ་དང་། །ཀ་ཡི་ར་དང་བྷི་བྲྀ་ཀ །བྱཱ་ཀུ་ལི་དང་སྭ་སྣ་དང་། །ཀཱ་མ་ཎ་དང་རོ་ཧི་ཏ། །མོ་ཧི་ཏ་དང་བྷ་དྲའོ། །གསུམ་པ་དུས་ནི་སྤྱིར་བསྐལ་པ། །ཆགས་གནས་འཇིག་སྟོང་ཆེན་པོ་བཞི། །གཞན་ནི་རྫོགས་ལྡན་གསུམ་ལྡན་དང་། །གཉིས་ལྡན་རྩོད་ལྡན་དུས་བཞི་སྟེ། །དེ་ལ་ཚེ་དཔལ་འབྱོར་པ་དང་། །སངས་རྒྱས་བསྟན་པའི་དུས་བཞི་དང་། །རིགས་ལྡན་རྒྱལ་པོའི་དུས་བཞིར་དབྱེ། །དུས་ཚོད་ལོ་ཟླའི་ཕུང་པོ་བཅས། །གཟའ་དགུ་ལྷག་གཅིག་ངེས་སྐྱེས་ནས། །ལྷན་ཅིག་ཁྱིམ་རྫོགས་མཐར་སྤྱོད་པ། །སྟོང་འཇུག་ཞེས་གདགས་དེར་དུས་བཞི། །དུས་ཕྱིས་མཁས་འགའ་རྟོག་པས་བཞག །འཕྲོས་དོན་དུས་རྩིས་མཛོད་སོགས་ནས། །སེ་གོལ་གཅིག་ལ་དྲུག་ཅུ་བཞི། །ཕྱེས་ཆ་དུས་མཐའི་སྐད་ཅིག་ལ། །དེ་བརྒྱ་ཉི་ཤུ་དེའི་སྐད་ཅིག །དེ་འདྲ་དྲུག་ཅུར་ཐེངས་གཅིག་སྟེ། །སུམ་ཅུའི་ཡུད་ཙམ་དེ་སུམ་ཅུའི། །ཉིན་ཞག་གང་དེ་སུམ་ཅུའི་ཟླ། །བཅུ་གཉིས་ཟླ་བས་ལོ་གཅིག་འགྱུར། །དེ་བཞིན་སྟག་སྣའི་མདོ་ལས་ནི། །བལ་མཁན་མཁས་པས་རལ་བལ་གྱི། །ལྭ་བ་རིང་ཐུང་སྙོམས་པ་ཞིག །འདྲེན་པའི་ཡུན་ནི་སྐད་ཅིག་ཐུང་། །དེ་བརྒྱ་ཉི་ཤུ་སྐད་ཅིག་རིང་། །དེ་དྲུག་ཐེངས་གཅིག་དེ་སུམ་ཅུ། །ཡུད་ཙམ་པ་སྟེ་དེ་སུམ་ཅུ། །ཉིན་ཞག་གཅིག་ཏུ་ཡང་དག་བཤད། །ཡང་ནི་མིག་འཛུམ་གཉིས་ཐང་གཅིག །དེ་བཞི་མཆོག་དཀའ་དེ་བཅུ་དྲུག །དུས་ཚོད་གཅིག་སྟེ་རེ་རེ་བཞིན། །ཡུད་ཙམ་གཅིག་སྟེ་དེ་ལྷག་མཚུངས། །འདི་ལ་ཉིན་མོའི་ཡུད་ཙམ་ཆ། །བཅོ་ལྔ་གྲིབ་ཚད་ལ་བརྟེན་ཅིང་། །མཚན་མོ་ཐུན་གྱི་ཆ་ལ་བརྟེན། །མིང་ཡང་སོ་སོར་གསུང་བ་མཐོང་། །གཞན་ཡང་འཆི་མེད་མཛོད་དང་ནི། །ཚིག་གི་གཏེར་ལས་འདི་སྐད་ཅེས། །མིག་འཛུམ་བཅོ་བརྒད་མཐར་གནས་དེ། །སུམ་ཅུ་ཆ་ཤས་དེ་སུམ་ཅུ། །སྐད་ཅིག་ཡིན་ཏེ་དེ་བཅུ་གཉིས། །ཡུད་ཙམ་ཞེས་གྲགས་དེ་སུམ་ཅུ། །ཉིན་ཞག་གཅིག་སྟེ་དེ་བཅོ་ལྔ། །ཕྱོགས་ཏེ་ཕྱོགས་གཉིས་ཟླ་བ་གཅིག །དེ་གཉིས་དུས་ཚིགས་དེ་གསུམ་ལ། །བསྒྲོད་གཅིག་དེ་གཉིས་ལོ་རུ་བཤད། །དུས་ཀྱི་མཚན་ཉིད་ཆ་ཤས་གང་། །རྣམ་གྲངས་ཐ་སྙད་དེ་ལྟར་བསྟན། །འདི་རུ་བཤད་བྱ་ལོ་གཅིག་གི །དུས་ཀྱི་ངེས་པ་བསྟན་པ་དེ། །དཔལ་མཆོག་དང་པོའི་སངས་རྒྱས་རྒྱུད། །དུས་ཀྱི་འཁོར་ལོ་འཇིག་རྟེན་ཁམས། །ལེའུ་ཉིད་ལས་བསྟན་པ་དང་། །གཞན་ཡང་བཀའ་དང་བསྟན་བཅོས་ཆེར། །དུས་དྲུག་དུས་ལྔ་དུས་བཞི་དང་། །གསུམ་དང་གཉིས་སུ་བཞག་པ་གང་། །དང་པོ་གསོ་བྱེད་ཡན་ལག་བརྒྱད། །འདུལ་ལུང་མྱང་འདས་མདོ་ནས་བསྟན། །ནག་ཟླ་ས་ག་དཔྱིད་གཉིས་ཡིན། །སྣྲོན་དང་ཆུ་ཚོད་ས་ག་གཉིས། །གྲོ་ཞུན་ཁྲུམས་ནི་དབྱར་ཟླ་གཉིས། །དབྱུ་གུ་སྨིན་དྲུག་སྟོན་ཟླ་གཉིས། །མགོ་ཟླ་རྒྱལ་ཟླ་དགུན་སྟོད་དེ། །མཆུ་ཟླ་སྦོ་ཟླ་དགུན་སྨད་དོ། །འོན་ཀྱང་འདུལ་ལས་མར་ངོ་སྔོན། །འགྲོ་བས་སྦོ་ཟླའི་བཅུ་དྲུག་ནས། །ནག་པ་ཟླ་སྟེ་དཔྱིད་ཟིན་ཅིང་། །ཚུལ་དེས་ལྷག་རྣམས་མཚུངས་རིམ་སྦྱོར། །གཉིས་པ་འདུལ་ལས་དུས་ཚིགས་ལྔ། །འདི་ནི་མར་ངོ་སྔོན་འགྲོ་བས། །ཚེས་དབུ་བཅུ་དྲུག་དེ་ཕྱི་མའི། །བཅོ་ལྔ་ཟླ་བའི་རྫོགས་མཚམས་བཞག །ཡར་ངོ་སྔོན་འགྲོའི་སྔོན་ཟླ་ཕྱེད། །ནུར་གྱུར་ཟླ་བའི་མིང་དེ་བཞིན། །དེས་ཤེས་སྤྱིར་བཏང་སྨིན་དྲུག་ཟླའི། །བཅུ་དྲུག་ནས་བརྩམས་སྦོ་ཟླ་ཡི། །བཅོ་ལྔའི་བར་གྱི་ཟླ་བ་བཞི། །དགུན་གྱི་ཟླ་བ་བཞི་རུ་བཞག །སྦོ་ཟླའི་དེ་ནས་ཆུ་སྟོད་དེའི། །བར་གྱི་ཟླ་བཞི་དཔྱིད་དུ་གྲགས། །དེ་ནས་གྲོ་ཞུན་བཅོ་ལྔའི་བར། །ཟླ་གཅིག་དབྱར་གྱི་དུས་སུ་ངེས། །དེ་མཐར་ཚེས་པ་བཅུ་དྲུག་པ། །ཉིན་ཞག་གཅིག་སྟེ་དབྱར་ཐུང་ངུ་། །དེའི་སང་ཉིན་བཅུ་བདུན་ནས། །སྨིན་དྲུག་ཟླ་བའི་བཅོ་ལྔའི་བར། །ཞག་གཅིག་མ་ཚང་ཟླ་བ་གསུམ། །རིང་པོ་དབྱར་ཞེས་གསུང་པ་ཡིན། །གསུམ་པ་སྨན་དཔྱད་གཞུང་དང་ནི། །འདུལ་བཏུས་མདོ་རྩ་སོ་ཐར་མདོ། །ཉི་སྙིང་གསེར་འོད་དམ་པ་དང་། །མྱང་འདས་རྒྱ་ནག་འགྱུར་རྣམས་ལས། །དགུན་དཔྱིད་དབྱར་སྟོན་དུས་བཞི་ལ། །ཟླ་བ་གསུམ་གསུམ་ཉིད་དུ་བརྟན། །བཞི་པ་འདུལ་བའི་མེ་ཏོག་འཕྲེང་། །མངོན་པ་རྩ་འགྲེལ་ལས་དཔྱིད་དབྱར། །དགུན་སྟེ་དུས་ཚིགས་གསུམ་དུ་མཛད། །སོས་སྟོན་དཔྱིད་དང་དབྱར་ཁོངས་བསྡུས། །སངས་རྒྱས་པ་རྣམས་དུས་དང་པོ། །དགུན་ནས་བརྩམ་སྟེ་ཡིན་ཞེས་གསུངས། །དེ་རྣམས་དུས་བཞི་ལས་གཞན་པ། །ནག་ཟླ་ནས་བརྩམ་དཔྱིད་བྱེད་མཐུན། །དུས་བཞི་ལོ་མགོ་ཐ་དད་པས། །དཔྱིད་རར་མགོ་རྒྱལ་མཆུ་རིམ་སྦྱོར། །རྒྱ་ནག་ཡུལ་དུ་ད་ལྟའི་བར། །དཔྱིད་ར་མཐུ་ཟླར་བཞག་པར་སྣང་། །འཇིག་རྟེན་དབང་ཕྱུག་སྤྲུལ་པའི་སྐུ། །བོད་རྗེ་མེས་དབོན་སྐབས་སུ་ནི། །ལོ་གསར་དཔྱིད་ར་རྒྱལ་ཟླར་མཛད། །རྒྱལ་ནག་གཙུག་ལག་གཞུང་མཐུན་མིན། །དགོངས་པ་ཡང་ནི་དེར་ངེས་ཞེས། །དམ་པ་ཆེ་གྱུར་མང་པོས་གསུངས། །གང་ལྟར་དཔལ་མཆོག་དུས་འཁོར་ལོ། །གདན་བཞི་མཁའ་འགྲོ་རྒྱ་མཚོ་སོགས། །མཐུན་པར་རྟེན་འབྲེལ་ཟླ་བ་ཡི། །ཐོག་མ་རྒྱལ་ཡིན་ཐེ་ཚོམ་མེད། །འཇིག་རྟེན་མིག་གྱུར་སྔོན་ཆེན་པོས། །སྦོ་ཟླར་དཔྱིད་རར་བརྡའ་ཆད་མཛད། །སྤྱིར་ནི་དཔྱིད་ར་སོགས་འཕགས་ཡུལ། །སྐད་དུ་དཀོན་མདོ་ཉ་སྐར་མིང་། །འབྱུང་བ་ལོ་ཙཱས་བོད་ཡུལ་གྱི། །བརྡའ་མཐུན་བསྒྱུར་བ་མང་རྟོགས་སོ། །ལྔ་པ་དུས་གཉིས་ཉི་མ་ཡི། །ལྷོ་བྱང་བསྒྲོད་པ་ལས་གདགས་ཏེ། །རྒྱ་གར་ཤར་ཕྱོགས་སོགས་ཡུལ་འགར། །བགྲོད་དེ་ལོ་རུ་འདོད་ཀྱང་སྣང་། །དེ་ཚེ་མགོ་ཟླ་ལོ་གསར་ཉིད། །འཆི་མེད་སེང་གེའི་མཛོད་ལས་ཀྱང་། །རི་དྭགས་མགོ་དང་ལྷན་ཅིག་པ། །ཟླ་བ་ལོ་ཡི་དང་པོ་ཡིན། །བཤད་དེ་རིག་བྱེད་སྨྲ་བའི་ལུགས། །ལོ་ཡི་ཐོག་མ་མགོ་ཟླ་རུ། །འདོད་མོད་སྟག་ཟླ་དང་དཔྱིད་རར། །ནམ་ཡང་འཁྲུལ་པར་མི་བྱའོ། །དེ་ལྟར་ལོ་གཅིག་བྱེ་བྲག་གི །དུས་ཀྱི་རྣམ་དབྱེ་མདོར་བསྟན་བྱས། །བཞི་པ་དུས་དེ་རྣམས་ཀྱི་གཟེར། །མཐར་ཐུག་མཉམ་ཉིད་མདོར་བཤད་པ། །གོ་ལའི་འགྲོས་དང་ས་ཚིགས་དབང་། །གཅིག་ཏུ་ངེས་པ་མ་ཡིན་ཀྱང་། །བོད་ཡུལ་དབུས་འགྱུར་ཉི་ལྡོག་དང་། །མཐུན་པར་མཁས་རྣམས་མྱོང་རྩིས་མཛད། །དེ་ཡང་མི་འདྲ་དུ་མར་མཐོང་། །སྐབས་འདིར་སྔོན་རབས་མཁས་གསུང་རབ། །རིམ་བརྒྱུད་མ་ཉམས་ལག་མྱོང་རྩིས། །བདག་གི་རིག་གནས་སློབ་དཔོན་ཆེ། །ཀྱེ་རེའི་མཁས་མཆོག་འཇིག་རྟེན་མིག །བཞེད་པ་ཉི་བར་ཆ་ཅན་གང་། །སྐར་འབྱུང་དབྱུག་ཚེས་ཤར་བ་ན། །འཁྲིག་ཁྱིམ་སུམ་གཅིག་ཉིན་རིང་མཐའ། །སྐར་སྐྱོན་དབྱུ་གུར་དབང་མཚོ་ཤར། །གཞུ་ཁྱིམ་སྐར་མདུན་མཐར་མཚན་རིང་། །ཡང་ནི་སྐར་དྲུག་དབྱུག་ཞེས་ལྔ། །བྱང་མཐའ་ལ་བསྣམ་སྟོན་མཉམ་དང་། །དེར་བསྣན་ལྷོ་མཐའ་དེར་བསྣན་དཔྱིད། །མཉམ་དང་དེར་བསྣན་ཉིན་རིང་འཆར། །སྤྱིར་ནི་བཤོལ་མེད་དབྱར་ཟློག་ནས། །ཁྱིམ་ཞག་དགུ་བཅུ་རྫོགས་སྟོན་མཉམ། །དེ་ནས་རིམ་བཞིན་དགུ་བཅུའི་མཚམས། །དགུན་ལྡོག་དཔྱིད་མཉམ་སླར་དབྱར་ལྡོག །འོན་ཀྱང་ཉི་ལྡོག་ནུར་དང་རྟག །འདོད་སོགས་མཁས་གོང་མན་ངག་བཞིན། །ཞིབ་མོ་ལག་རྫིས་རི་མོས་ཏེ། །འདིར་ནི་ཆར་ཚད་མཚོན་ཙམ་མོ། །ཉི་མས་ལྡོག་བྱང་བསྒྲོད་བཞིན་དུ། །ཟླ་རང་དེ་ལྡོག་མཐར་ཐུག་པ། །མཉམ་དུས་ཉི་མའི་ཤུལ་ཉིད་དུ། །ཟླ་རང་ཡང་ནི་མངོན་པར་འཇུག །དེ་ལྟར་མཐོང་བ་ཡང་ཤེས་བྱ། །ཞིབ་པར་འགོད་པའི་ཆ་ལ་སོགས། །ཁོ་བོས་དཔྱད་གཞི་བྱས་བཞིན་དུ། །ཡི་གེ་དང་ནི་ངག་ལས་སོ། །མཉམ་པའི་དུས་སུ་འཆར་བའི་གཟའ། །བསྟན་པ་དང་ནི་རི་ཥི་སྟེ། །དེ་ཉིད་འཆར་ནུབ་ཞག་དབུས་སུ། །མཉམ་པའི་དུས་ཉིད་འབྱུང་བ་ཡིན། །དཔྱིད་མཉམ་ལ་ནི་བསྟན་པ་སྟེ། །དེ་ནི་གོ་ལའི་བྱང་མཐར་མངོན། །སྟོན་མཉམ་ནི་རི་ཥི་གང་། །གོ་ལའི་ལྷོ་མཐར་འཆར་ནུབ་བྱེད། །རི་ཥི་འཆར་སྐབས་ཞག་བདུན་ཅུ། །ནད་སེལ་བརྒྱད་ལྡན་འགྱུར་བར་གྲགས། ཁ་ཅིག་རྨེ་བདུན་བརྟན་པར་འདོད། །དེ་ནི་མུན་སྤྲུལ་ཉིད་དུ་ངེས། །བརྟན་པ་སྐར་མ་འབྲིང་པོའི་ཚད། ཁ་དོག་སེར་ཤས་ཆེ་བ་རུ། །ཡོད་ཅེས་འཕགས་ཆེན་རྒྱལ་བའི་སྲས། །ཀུན་མཁྱེན་བླ་མའི་གསུང་ལས་སོ། །ལྔ་པ་སྐར་གནས་གཟའ་སྤྱོད་ཡུལ། །ཁྱིམ་གྱི་རིམ་པ་གང་ཞེ་ན། །རྒྱུ་སྐར་རེ་ལ་རྐང་པ་བཞི། །རྐང་རེ་ཆུ་ཚོད་བཅོ་ལྔ་རུ། །ཁྱིམ་རེ་རྐང་པ་དགུ་ཡི་ཚད། །རིམ་པ་དེ་ཡི་བསྒྲོད་པ་སྟེ། །ལུག་ཁྱིམ་ཐ་སྐར་བྲ་ཉེ་དང་། །སྨིན་དྲུག་རྐང་པ་དང་པོར་སྤྱོད། །གླང་ཁྱིམ་སྨིན་དྲུག་རྐང་གསུམ་དང་། །རྣར་མ་མགོ་ཡི་རྐང་གཉིས་ཡིན། །འཁྲིག་ཁྱིམ་མགོ་ཕྱེད་ལག་རྫོགས་པ། །ནབ་སོའི་རྐང་པ་གསུམ་ཡིན་ནོ། །ཀརྐཊ་ནི་ནབ་སོའི་མཐའ། །རྒྱལ་དང་ཀག་ནི་ཚང་བའོ། །སེང་གེ་ལ་ནི་ཆུ་བྲ་རྫོགས། །སྦོ་ཡི་རྐང་པ་གཅིག་ཡིན་ནོ། །བུ་མོ་སྦོ་ཡི་ལྷག་གསུམ་དང་། །མེ་བཞི་ནག་པོའི་ཕྱེ་ཡན་སྤྱོད། །སྲང་ཁྱིམ་མེ་བཞིའི་ལྷག་གཉིས་དང་། །ས་རི་ས་གའི་རྐང་པ་གསུམ། །སྡིག་པར་ས་གའི་རྐང་པ་མཐའ། །ལྷ་མཚམས་དང་ནི་སྣྲོན་རྫོགས་པ། །གཞུ་ཁྱིམ་སྣུབ་དང་ཆུ་ཚོད་ཚང་། །ཆུ་སྨད་རྐང་པ་དང་པོར་ལྡན། །ཆུ་སྲིན་ཆུ་སྨད་རྐང་གསུམ་དང་། །གྲོ་ཞུན་མོན་དྲེ་ཕྱེད་ཡན་ནོ། །བུམ་པར་མོན་དྲེའི་ཕྱེ་མན་དང་། །མོན་གྲུ་ཁྲུམས་སྟོད་རྐང་གསུམ་ཡིན། །ཉ་ལ་ཁྲུམས་སྟོད་རྐང་ལྷག་གཅིག །ཁྲུམས་སྨད་ནམ་གྲུ་ཡོངས་སུ་རྫོགས། །དེ་ལྟར་ཁྱིམ་གྱི་ཆུ་ཚོད་ཀུན། །སྡོམ་པས་སྟོང་དང་བརྒྱ་ཕྲག་དྲུག །ཉི་ཤུ་ཐམ་པར་གྱུར་པ་སྟེ། །ཡུལ་གྱི་ལོངས་སྤྱོད་ཞེས་སུ་གྲགས། །ལུག་སོགས་བཅུ་གཉིས་ཁྱིམ་གྱི་མིང་། །ལེགས་སྦྱར་སྐད་བརྗོད་ལུག་མི་ཥཱ། །བྲྀ་ཥྲ་བྷཿགླང་མེ་ཐུ་ན། །འཁྲུག་སྟེ་ཀརྐཊ་སྦལ་པ། །སིངྷ་སེང་གེ་ཀ་ནྱཱ་ཞེས། །བུ་མོ་རུ་ལ་སྲང་ཡིན་ནོ། །བྲྀཥྩཀ་སྡིག་དྷཱ་ནུ་གཞུ། །ཆུ་སྲིན་མ་ག་ར་བུམ་པ། །ཀུམྦྷ་ཉ་ལ་མཱི་ནའོ། །ཁྱིམ་ལ་རཱ་སི་ཞེས་སུ་བརྗོད། །དེ་ནས་དྲུག་པ་ཁྱིམ་ཚོགས་དེར། །གཟའ་རྣམས་ལེགས་སྐྱེས་སྐར་དུས་ཚད། །བསོད་ནམས་སྟོབས་དང་ལྡན་པའི་གཟའ། །སྒྲ་གཅན་གདོང་པ་སྲང་གི་ཁྱིམ། །འཆར་བའི་ཐོག་མ་ཉིད་དུ་སྐྱེས། །མཇུག་མེ་ཉ་ཡི་མཐའ་རུའོ། །ཉི་མ་ཀརྐཊ་ནབ་སོའི། །རྐང་པ་བཞི་པའི་ཐོག་མར་སྐྱེས། །ཁ་ཅིག་སྐྱེ་སྐར་མེ་བཞི་ཟེར། །གོང་ཉིད་རྒྱུད་དགོངས་འཁྲུལ་པ་མེད། །དེས་ནི་ཁག་གི་ཟླ་བ་ཡང་། །སྲང་ཁྱིམ་ཐ་སྐར་མཚན་མཉམ་དུས། །སྐྱེས་ནས་དེ་ཕྲལ་ཆ་བྲི་བས། །འདུལ་སོགས་མར་ངོ་སྔོན་འགྲོ་དང་། །སྨིན་དྲུག་ཟླ་བ་ལོ་མགོ་རུ། །བཞག་པ་དོན་དེས་ཡིན་སྐད་ཀྱང་། །དུས་འཁོར་གཞུང་འགྲེལ་ལས་ལུག་ཁྱིམ། །ཐ་སྐར་རྐང་དབུ་ཚེས་གཅིག་ལ། །ཟླ་སྐྱེས་ཡར་ངོ་སྔོན་འགྲོ་དང་། །ཟླ་མགོ་ཡིན་གསུང་དེ་ཉིད་བཟུང་། །དེ་བཞིན་སེང་ཁྱིམ་མཆུ་ཡི་དབུས། །མིག་དམར་སྐྱེས་ཤིང་སྡིག་པའི་ཁྱིམ། །ལྷག་མཚམས་རྐང་པ་གཉིས་རྫོགས་མཚམས། །ལྷག་པ་སྐྱེས་ཤིང་བུ་མོའི་ཁྱིམ། །སྦོ་རྐང་རྫོགས་མཚམས་ཕུར་བུ་སྐྱེས། །འཁྲིག་ཁྱིམ་ལག་རྫོགས་པ་སངས་སྐྱེས། །གཞུ་ཁྱིམ་ཐོག་མར་སྤེན་པ་སྐྱེས། །གཞུ་རྫོགས་ཐ་མར་གདེངས་ཅན་སྐྱེས། །དེ་བཞིན་བུམ་པར་རི་བྱི་དང་། །གླང་དུ་བརྟན་པ་སྐྱེས་པར་གསུང་། །དེ་ལྟར་གཟའ་སྐྱེས་ཁྱིམ་ཡེ་ལེ། །སྐར་ཚད་ཁམས་ལེའི་དོན་བཞིན་དུ། །བདུན་པ་ཁྱིམ་གྱི་ཞིང་བདག་ནི། །ལུག་སྡིག་དམར་པོ་གླང་སྲང་དཀར། །འཁྲིག་པ་བུ་མོ་སྔོན་པོའོ། །སྦལ་པ་ཟླ་བ་སེང་ཉི་མ། །གཞུ་དང་ཉ་ལ་ཕུར་བུ་ཉིད། །ཆུ་སྲིན་བུམ་པ་ནག་པོའོ། །ཁྱིམ་བཞིན་ཏཏྐལ་འཆར་བ་ཡི། །བདག་པོ་ཡང་ནི་དེ་ཁོ་ན། །རང་ཁྱིམ་ཁམས་མི་མཐུན་པའི་གཟའ། །ཞུགས་ཚེ་དེ་དང་རྩོད་པར་གསུངས། །དེ་ཡང་དམར་པོ་སྔོ་སངས་རྩོད། །དེ་བཞིན་ཕུར་བུ་དཀར་པོ་དང་། །ནག་པོ་དང་ནི་ཀེ་རུའོ། །ཉི་མའི་ཞིང་དུ་ཀེ་རུ་དང་། །ཟླ་བའི་ཞིང་དུ་ནག་པོ་ཞུགས། །དེ་གཉིས་ཕན་ཚུན་རྩོད་པར་གྲགས། །བརྒྱད་པ་དེ་ལྟར་ལོ་ཟླ་ཞག །ཀུན་གྱི་རྩ་བ་སྲོག་ཅེས་དབུགས། །དེ་ཡང་དགེ་དང་དགེ་མིན་གྱི། །ལས་ཀྱི་ནུས་པས་ཚེ་ཡི་ཚད། །ཇི་བཞིན་དབུགས་ཀྱང་ཐུང་ངུ་རིང་། །བར་མ་ཉིད་དུ་རྣམ་པར་བཞག །དེ་ཡང་མི་ཡི་སྐྱེས་བུ་གང་། །དར་བབ་ནད་མེད་རང་བཞིན་དབུགས། །དབྱུང་གནས་རྔུབ་པ་གཅིག་བྱས་པ། །དེ་ཉིད་རྩི་གཞི་རྩ་བར་བཟུང་། །དེ་ལྟར་མི་ཡི་དབུགས་གཅིག་ལ། །ཉིས་ཁྲི་ཆིག་སྟོང་དྲུག་བརྒྱ་རུ། །ཕྱེས་པའི་ཆ་གཅིག་ལུས་སྐྱེས་ཞེས། །ཤིག་སོགས་ཕྲ་མོའི་དབུགས་གཅིག་གྱུར། །དེས་མཚན་མི་ཡི་དབུགས་གཅིག་ནི། །ཕྲ་རྣམས་ཞག་གཅིག་ཉིད་དུ་གྲུབ། །མི་ཡི་སུམ་ཅུའི་དབུགས་ནི་དྷྲུ། །ཡི་དྭགས་ཀྱི་ནི་དབུགས་གཅིག་ཡིན། །དཀར་ནག་ཕྱོགས་གཉིས་མིའི་ཟླ་གཅིག །ཡི་དྭགས་ཚུན་གྱི་ཞག་གཅིག་གོ །མི་ཡི་ཆུ་ཚོད་གཅིག་གི་དབུགས། །ལྷ་ཡི་དབུགས་ནི་གཅིག་ཏུ་འགྱུར། །ཚུལ་དེས་མི་ཡི་ལོ་གཅིག་ནི། །ལྷ་དེ་རྣམས་ཀྱི་ཞག་གཅིག་གྱུར། །འདིར་གསུངས་མཚུན་དང་ལྷ་ཡི་ཞག །འདི་ནི་ཕྱི་རོལ་པའི་གྲུབ་མཐའ། །རིག་བྱེད་ལམ་པས་བཞག་པ་དང་། །མཚུངས་པ་ཉིད་དུ་ཁོ་བོས་མཐོང་། །མི་ཡི་ཉིན་ཞག་གཅིག་གི་དབུགས། །ལྷ་མ་ཡིན་གྱི་དབུགས་གཅིག་གསུང་། །དེས་ན་རག་རྩིས་མི་ཡི་ལོ། །བཅུ་གཉིས་ལྷ་མིན་ཞག་གཅིག་གོ །ནུས་པའི་དབུགས་ནི་མི་ཡི་ལོ། །གཅིག་དང་མཚུངས་པ་ཉིད་དུ་ལྡན། །ཉི་ཁྲི་ཆིག་སྟོང་དྲུག་བརྒྱའི་ལོ། །གཙོ་བོ་ཡི་ནི་དབུགས་གཅིག་བཞེད། །སྐབས་འདིར་ནུས་དང་གཙོ་བོ་ཞེས། །གཟུགས་ཁམས་མཆོག་དང་གཟུགས་མེད་མཆོག །སྐྱེས་བུའི་མིང་ནི་རྣམ་འགྱུར་དུ། །ཡིན་པར་འཇིག་རྟེན་མགོན་དེས་བཤད། །འོན་ཀྱང་སྲིད་པ་སུམ་ཅུ་གཅིག །གསུང་པའི་སྐབས་ཀྱི་ཚེ་ཚད་དང་། །དབུགས་ཀྱི་སྐབས་འདིར་གསུང་པ་གང་། །དངོས་སུ་མཐུན་པར་མ་གྱུར་པས། །འདིར་ནི་རིག་བྱེད་སྨྲ་དྲང་ཆེད། །དེ་མཐུན་རྣམ་གྲངས་ཅན་གསུངས་པར། །བདག་གི་རྣམ་རྟོག་ཉིད་དུ་ཤར། །རྒྱས་དཔྱད་གཞན་དུ་སྨྲ་བར་བྱ། །དེ་ལྟར་འཕྲོས་དོན་བཅས་བཤད་ནས། །འདི་རུ་བཟུང་བྱའི་སྙིང་པོ་ནི། །འཛམ་གླིང་མི་ཡི་སྐྱེ་དགུའི་དབུགས། །དུས་རྩིས་ཀུན་གྱི་རྩ་བ་ཉིད། །དེ་ཡང་ཉིན་ཞག་ཕྲུགས་གཅིག་ལ། །ཉི་ཁྲི་ཆིག་སྟོང་དྲུག་བརྒྱ་རྒྱུ། །ཆུ་སྲང་ཆུ་ཚོད་ཐ་དག་པ། །འདི་ལས་རྣམ་པར་འབྱུང་ཤེས་བྱོས། །ད་ནི་དགུ་པ་ཆུ་སྲང་དང་། །ཆུ་ཚོད་མཚན་ཉིད་བཤད་བྱ་སྟེ། །བདག་ཅག་སྟོན་པ་རྡོ་རྗེ་ཅན། །གང་གི་ཐུན་མོང་མ་ཡིན་པའི། །དགོངས་པ་བླ་མེད་སྔགས་ཀྱི་རྒྱུད། །བཅོམ་ལྡན་དགྱེས་པ་རྡོ་རྗེ་ལས། །ཆུ་ཚོད་སུམ་ཅུ་སོ་གཉིས་དང་། །དབྱུ་གུ་དྲུག་ཅུ་རྩ་བཞིར་གསུང་། །བདེ་མཆོག་སྡོམ་པ་འབྱུང་བ་ལས། །ཐུན་བརྒྱུད་ཕོ་བ་བཅུ་དྲུག་དང་། །ཆུ་ཚོད་སུམ་ཅུ་རྩ་གཉིས་ལ། །དབྱུ་གུ་དྲུག་ཅུ་རྩ་བཞིར་དྲན། །རྒྱུད་ཆེན་རྡོ་རྗེ་མཁའ་འགྲོ་ལས། །མིག་འཛུམ་དྲུག་ནི་ཆ་ཤས་གཅིག །རིམ་པས་དྲུག་གྱུར་སྐད་ཅིག་ལ། །ཐེངས་གཅིག་དང་ནི་ཆུད་ཟང་འགྱུར། །ཆུད་ཟང་སུམ་ཅུ་ཡིག་ལྕི་དུས། །དེ་བཅུ་སྟོང་གཅིག་དེ་ཉེར་དྲུག །ཆུ་སྲང་གཅིག་གི་ཚད་དུ་བཞེད། །ཆུ་སྲང་དྲུག་ཅུ་ཆུ་ཚོད་དོ། །ཆུ་ཚོད་བརྒྱ་ནི་ཐུན་གཅིག་ཡིན། །ཐུན་བརྒྱད་ཉིན་ཞག་གཅིག་ཏུ་འགྱུར། །ཆུ་ཚོད་དེ་ཡི་གཞལ་ཚད་ཀྱང་། །རྒྱུད་དེ་ཉིད་ལས་འདི་སྐད་གསུངས། །ཟངས་མ་སྲང་ནི་བཅུ་གཉིས་ལས། །སྣོད་ནི་དཔང་དུ་སོར་བརྒྱད་དང་། །རྒྱར་ནི་སོར་མོ་བཅུ་གཉིས་ལས། །ལེགས་པ་ཉིད་དུ་བརྡུང་བར་འགྱུར། །གསེར་ནི་འོས་༼རྒྱ་དཀར་གྱི་རྩ་འབྲས་མ་རུ་མགོ་ནག་གི་མིང་༽སེ་སུམ་ཅུ་ལ། །སོར་དྲུག་པ་ཡི་ཚད་དག་ཏུ། །ཐུར་མ་ལེགས་པར་བརྡུང་ནས་སུ། །ཐུར་མ་དེ་ཡི་བུ་ག་ནི། །ཟངས་མའི་གནད་ལ་དབུག་པར་བྱ། །ཆུ་ནི་སྙོག་མ་མེད་པ་ལས། །སྲང་ནི་དྲུག་ཅུའི་ཚད་དུ་བྱ། །སྲང་འདིའི་ཆུ་ཚོད་ཚད་ཡིན་ནོ། །ཞེས་གསུང་རྒྱ་གར་རྒྱལ་པོ་རྣམས། །ཚུལ་དེ་ལྟ་བུའི་དུས་བརྟག་ཅིང་། །ཆུ་སྲང་སྣོད་ལ་རི་མོ་བགོ །ཆུ་སྣོད་ཁེངས་མཛད་ཆུ་ཚོད་བཞག །དེ་མཚམས་དབྱུ་གུའི་བརྡའ་ཡི་བསྣུན། །ཐུན་ཆེན་རྔ་བོ་ཆེས་མཚམས་འཛིན། །དེས་ན་ཆུ་ཚོད་དབྱུ་གུ་ཞེས། །མིང་ཡང་དོན་དེས་བཏགས་པ་ཟད། །མ་ཧཱ་ཙི་ནར་ཉིན་མཚན་ཡུན། །ཟ་མ་དགུ་བཅུ་རྩ་དྲུག་བཤད། །ཟ་མ་རེ་ལ་ཆུ་སྲང་ནི། །ཕྱེད་བཅས་སུམ་ཅུ་སོ་བརྒྱད་ཡིན། །དབུགས་སུ་སིལ་ན་ཟ་མ་རེར། །ཉིས་བརྒྱ་ཉི་ཤུ་རྩ་ལྔར་འགྱུར། །ཉིན་མཚན་མཉམ་པའི་དུས་སུ་ནི། །སོ་སོར་ཟ་མ་ཞེ་བརྒྱད་འཆར། །གཞན་ཡང་སྟག་སྣའི་མདོ་ལ་སོགས། །བཀའ་དང་བསྟན་བཅོས་འགའ་ཞིག་ཏུ། །ཆུ་ཚོད་རྣམ་གྲངས་ལག་ལེན་ཆ། །འདྲ་མིན་ཙམ་ལས་དོན་གཅིག་གྲུབ། །འདིར་ནི་ཀུན་ལ་གྲགས་ཆེ་གསལ། །དཔལ་མཆོག་དུས་འཁོར་རྒྱུད་ཆེན་དང་། །དེ་བཞིན་རྣལ་འབྱོར་མ་དབྱུག་གམ། །གདན་བཞིའི་རྒྱུད་ནས་བསྟན་པ་དང་། །འབྱུང་པོའི་བདག་པོ་དབང་ལྡན་གང་། །མིག་གསུམ་འཆང་བའི་སྟོབས་པོ་ཆེ། །རྒྱུད་ཀྱི་མིང་ཅན་དབྱངས་འཆར་མས། །བཤད་བཅས་མཚུངས་པར་ལྡན་པ་ཉིད། །རང་གཞན་སྙོམས་པའི་དབུགས་གཅིག་ནས། །དྲུག་རྫོགས་རང་འཁོར་ནས་བུད་སྲང་། །ཆུ་སྲང་ལྔ་ལ་དབུགས་སུམ་ཅུ། །དབུགས་བརྒྱ་བརྒྱད་ཅུ་སྲང་སུམ་ཅུ། །ཆུ་སྲང་དྲུག་ཅུ་རང་འཁོར་ཚད། །རྫོགས་འཕྲལ་ཆུ་ཚོད་ཉིད་དུ་འཕོ། །སྤྱིར་ནི་སུམ་བརྒྱ་དྲུག་ཅུའི་དབུགས། །ཆུ་ཚོད་གཅིག་གི་ཡུན་ཚད་སྟེ། །ཆུ་ཚོད་འཁོར་ལོ་ཚད་དྲུག་ཅུ། །དེ་ལ་སུམ་སྟོང་དྲུག་བརྒྱ་སྲང་། །ཉི་ཁྲི་ཆིག་སྟོང་དྲུག་བརྒྱ་དབུགས། །ཉིན་ཞག་གཅིག་མཚུངས་རིང་ཐུང་མེད། །འདི་ལ་དུས་ཀྱི་ཆུ་ཚོད་ཞེས། །དུས་རྣམས་ཀུན་གྱི་གཞི་རུ་དྲན། །ལྷག་མ་ཡུལ་ཚེས་དབྱུ་གུ་ཡང་། །འདི་ལ་བལྟོས་ནས་བཏགས་པར་ཤེས། །འདི་རུ་འཕྲོས་སུ་ལྔ་བསྡུས་སྐབས། །དབུགས་གཅིག་ལྡང་ཚད་ལ་བཞག་པའི། །ཆ་ཤས་རྗེས་སུ་གྲགས་པ་གང་། །དབུགས་ཆ་བགོ་ཚུལ་མདོར་བསྟན་ན། །དཔེར་ན་འདོད་ཆ་ལྟ་བུར་མཚོན། །སེ་གོལ་མྱུར་རྟོགས་བཅུ་གསུམ་ཡུན། །དབུགས་གཅིག་རྒྱུ་བའི་ཚད་དང་མཉམ། །དེས་ན་ཆ་གཅིག་སེ་གོལ་གཅིག །གང་ཞིག་རི་རོ་ལྟ་བུ་ཡང་། །སྦལ་མཁན་མི་ཡི་རབ་དྲངས་འཕང་། །འཁོར་ལོ་རྟག་འཁོར་དྲུག་ཅུ་བདུན། །སྐྱེས་བུའི་དབུགས་ཡུན་གཅིག་དང་སྦྱར། །དེ་བཞིན་རི་མཁའ་རི་ཆ་ཡང་། །འཕང་རྩལ་ལྡན་པས་མཚམས་པའི་མདའ། །བསྒྱུར་བའི་གོམས་པ་བདུན་བརྒྱ་བདུན། །བགྲོད་ཡུན་དབུགས་ཀྱི་ལྡན་ཚད་གཅིག །གོམ་རེ་དབུགས་ཀྱི་ཆ་དང་སྦྱར། །ཚུལ་དེས་གཞན་ཡང་ཤེས་པར་བྱ། །འདི་ལ་ད་དུང་སྤྲོར་མོད་ཀྱང་། །ཉེར་མཁོ་མཚོན་བྱེད་དེ་ཙམ་མོ། །མཁས་པར་གྱུར་པ་འགའ་ཞིག་གི །རྟག་པའི་ལོངས་སྤྱོད་གནས་བཞིར་མཛད། །དེ་ཚེ་ཆུ་སྲང་གཅིག་གི་ཆ། །རི་མཁའ་རི་དང་རི་དུས་དབྱེ། །གནས་ལྔས་སྒྲུབ་དང་གནས་བཞི་གང་། །སྲང་ཡན་གཏད་ནས་ཁྱད་མི་འབྱུང་། །གནས་བཞིར་སྐབས་རེ་ཆ་ལྷག་ཀྱང་། །ལྷག་མའི་གཟུགས་ཉིད་མཚུངས་པར་འཆར། །གཞན་ཡང་གནས་གསུམ་གནས་དྲུག་སོགས། །ཆུ་ཚོད་ཡན་ཆད་སྐྱོན་མེད་ཉིད། །ཕལ་ཆེ་གཅིག་ཏུ་འགྲུབ་འགྱུར་ཏེ། །དེ་ཚུལ་ཞིབ་མོ་ཤེས་ཀྱང་བྱ། །དེ་ནས་བཅུ་པ་ཞག་མཚན་ཉིད། །ཁྱིམ་ཞག་ཉིན་ཞག་ཚེས་ཞག་སྟེ། །རྒྱས་པ་ཞག་གསུམ་རྣམ་དབྱེའི་སྐབས། །ཞིབ་མོར་བསྟན་མོད་འདིར་མདོ་ཙམ། །དེ་ཡང་ལོ་གཅིག་རྣམ་པར་བཞག །དེ་ལ་ཞག་གསུམ་དབྱེ་བ་ཡིན། །ཁྱིམ་ཞག་སུམ་བརྒྱ་དྲུག་ཅུ་ལ། །ཉིན་ཞག་གསུམ་བརྒྱ་རེ་ལྔ་དང་། །ཚེས་ཞག་སུམ་བརྒྱ་དོན་གཅིག་ཡོད། །རིམ་པས་ཞག་ཚད་རིང་འབྲིང་ཐུང་། །ཁྱིམ་ཞག་ཉི་མ་བར་པ་ཡི། །ཆུ་ཚོད་དྲུག་ཅུ་སྲང་ང་གཉིས། །དབུགས་བཞི་ཆ་ཤས་བརྒྱ་རེ་བརྒྱད། །ཞག་རེ་སྤྱོད་དེ་དེ་སུམ་ཅུ། །ཁྱིམ་རེར་གནས་པས་ཁྱིམ་ཞག་ཞེས། །བསྟོས་ཆེ་ལས་ལེགས་པར་བཞག །ཉིན་ཞག་འཇིག་རྟེན་ཡོངས་གྲགས་བཞིན། །འཕོ་མཚམས་ནམ་ལངས་ནས་ནམ་ལངས། །དེ་སྲིད་ཆུ་ཚོད་དྲུག་སྟེ། །ལྷག་ཆད་མེད་པར་རྟག་ཏུ་སྤྱོད། །དེ་ལྟར་ཁྱིམ་ཞག་ཉིན་ཞག་ནི། །ཉི་མ་རྒྱུ་སྐར་འཁོར་ལོ་གཅིག །ཡོངས་སུ་སྤྱོད་དེ་རྐང་པ་ཡི། །འགྲོས་བཞི་རྫོགས་པའི་ཚད་ཀྱི་སྟེ། །འགྲོས་བཞི་འཁོར་ཕྱེད་མ་དོར་བའི། །སྔ་རྐང་ཤར་ལ་ཕྱི་རྐང་ལྷོ། །འཁོར་ཕྱེད་དོར་གྱུར་སྔ་རྐང་ནུབ། །ཕྱི་རྐང་བྱང་དུ་རྣམ་པར་བཞག །ཚེས་ཞག་ཟླ་བའི་དཀར་ནག་ཆ། །བཅོ་ལྔ་འཕེལ་དང་སྒྲིབ་པ་ཡི། །ཡུན་ཚད་རེ་ལ་དབྱུག་ང་དགུ །སྲང་གསུམ་དབྱུགས་བཞི་ཆ་བཅུ་དྲུག །རྣམ་ཀུན་བར་མཚམས་མེད་སྤྱོད་ཀྱང་། །རེས་འགའ་རྐང་པ་འཕེལ་འགྲིབ་དང་། །ཉིན་ཞག་ལྷག་ཆད་བཏགས་པ་བ། །སྟོན་ཡང་ཚེས་ཞག་ལྷག་ཆད་མེད། །ཟླ་བས་ཚེས་ཞག་ཉེར་བདུན་ལ། །རྒྱུ་སྐར་འཁོར་ལོ་སྤྱོད་ཡུན་གང་། །ཉིན་ཞག་ཉེར་བདུན་མ་ལང་ཙམ། །དེ་ལ་རྐང་པའི་འགྲོས་བཞི་རྫོགས། །འགྲོས་བཞི་རིལ་པོར་ཚེས་བསྲེས་ཏེ། །བཅུ་བཞི་བགོས་པས་ཐོབ་པའི་ནོར། །མཉམ་ཚེ་སྔ་རྐང་བདུན་སྤྱོད་ཤར། །ཕྱི་རྐང་བདུན་གྱི་ལྷོ་རུ་བརྟག །ཐོབ་ནོར་མི་མཉམ་སྔ་རྐང་ནུབ། །ཕྱི་རྐང་བྱང་དུ་བརྗོད་པ་ཡིན། །ཟླ་ཉིའི་འགྲོས་ལ་གཟའ་ལྔ་བཞིན། །དངོས་སུ་ཕྱིར་ལྡོག་སོགས་མེད་ཀྱང་། །བཤོལ་འཆར་ཕྱིར་ལྡོག་རྗེས་མཐུན་དུ། །མཁས་མཆོག་བུས་གསུངས་ལེགས་བཤད་རྟོགས། །སྤྱིར་ནི་དུས་རྩིས་ཀུན་རྩ་བ། །ཉི་མ་ཡིན་ཏེ་གྲིབ་མའི་གཟུགས། །རིང་ཐུང་མཐར་ཐུག་དང་མཉམ་གཉིས། །ས་ཚིགས་གཅིག་ཏུ་འཆར་ནུབ་ཡུལ། །ཐ་དད་མངོན་སུམ་གྱུར་པས་ན། །འདོད་དང་དབང་དུས་ཡུན་ངེས་བཟུངས། །རྐང་པའི་མཚན་ཉིད་ཤིང་གྲིབ་ཀྱི། །ངེས་པ་མ་རྙེད་རྩིས་མཁན་ཞེས། །མིང་ལ་གཟུགས་བརྙན་ཙམ་དུ་བས། །ཚུལ་འདི་ནན་ཏན་རྟོགས་བྱའོ། །སྐབས་འདིར་ཁྱིམ་ཉི་ཚེས་ཀྱི་ཞག །རིང་ཐུང་བར་ཁྱད་ཞག་པ་གང་། །དེ་ཡང་ཟླ་བ་མ་ལང་བར། །ཉིན་ཞག་གཙོ་བོར་བཟུང་བ་ཡིན། །ཟླ་བ་ལང་ནས་ཚེས་ཞག་གཙོ། །ཉིན་ཞག་སུམ་ཅུར་མ་ལང་ཡང་། །ཟླ་བ་ཉ་ནས་ཉ་ཡི་བར། །ཚེས་ཞག་སུམ་ཅུའི་ཟླ་བ་རྫོགས། །དེ་ཕྱིར་འདུལ་མངོན་རྗེས་འབྲང་རྣམས། །རགས་རྩིས་ལོ་རེར་ཞག་དྲུག་འདོར། །ཞིབ་པར་ཞག་ལྔ་དེ་རེ་རེར། །རྗེས་འབྲང་དབྱུག་གུ་ཞེ་བརྒྱད་དང་། །ཆུང་ཆུང་ཉེར་གཉིས་ཞག་མི་ཐུབ། །དོར་ཏེ་ཤེལ་ཟླའི་རྒྱུ་འདི་ཡིན། །ལོར་ལང་ཉིན་ཞག་ཚེས་ཞག་ལས། །ཁྱིམ་ཞག་ཁོ་ན་གཙོ་བོར་འགྱུར། །ཅི་ཕྱིར་ཁྱིམ་ཞག་མ་ཐིམ་བར། །ལོ་ཡང་རྫོགས་པར་ནུས་པ་ཡིན། །ལོ་གཅིག་སུམ་བརྒྱ་དྲུག་ཅུའི་ཞག །འཇིག་རྟེན་པ་དང་བསྟན་བཅོས་ལས། །གྲགས་ཆེའི་ཞག་ཀྱང་དོན་དེས་བསྟན། །སྐར་རྩིས་རི་མོའི་གནད་མཐའ་དག །ཞག་གསུམ་རྣམ་དབྱེ་ལས་འབྱུང་བས། །ཇི་བཞིན་ཤེས་བྱ་དམ་པ་ཡིན། །འཕྲོས་འབྱུང་གཟའ་རྣམས་ཀྱི་ནི་ཞག །དཔལ་མཆོག་རྒྱུད་ནས་གསུངས་པ་གང་། །ཟླ་བ་ཡི་ནི་ཞག་བཅོ་ལྔ། །ལྷག་སངས་ཉི་གསུམ་ཟླ་བ་དྲུག །མིག་དམར་ཟླ་དགུ་ཕུར་བུའི་ལོ། །དྲུག་དང་སྤེན་པའི་ལོ་བཅོ་ལྔ། །སྒྲ་གཅན་དགུ་སྟེ་ལོ་ཟླ་ཞག །དེ་རྣམས་སྡོམ་པས་མི་ཡི་ལོ། །སོ་དང་ཕྱེད་བཅས་ཟླ་བ་གསུམ། །གཟའ་རྣམས་ཀྱི་ནི་ཉིན་ཞག་ཕྱེད། །ཞག་དེ་གསུམ་བསྒྱུར་ཕྱེད་བཅས་པའི། །ཟླ་བཅུ་ལྷག་པའི་ལོ་གོ་དྲུག །དེ་ལ་བུ་ལོན་ལོ་གསུམ་དང་། །ཕྱོགས་གསུམ་བསྣན་པས་མི་ལོ་བརྒྱ། །ཕྱེད་གཉིས་ཞག་སྟེ་ལོ་ཉིས་བརྒྱ། །ཞག་གསུམ་ཉིས་སྟོང་ཟླ་བ་གཅིག །བཅུ་གཉིས་ཟླ་ལོ་དེས་ལོ་བརྒྱ། །མི་ལོ་བཞི་འབུམ་ས་ཡ་གཉིས། །གནས་གཉིས་འོག་མ་བཅུས་བགོས་ནོར། །སྟེང་གི་ཕུང་པོར་སྦྱངས་བའི་ལྷག །ལོ་གྲངས་འབུམ་ཕྲག་ཉེར་གཅིག་དང་། །དྲུག་ཁྲིའི་དུས་ཀྱི་ཕྱེད་དུ་གསུངས། །དེ་ནི་གཙོ་དབུགས་སྟོང་བརྒྱད་བརྒྱ། །དབུགས་རེར་ཆིག་སྟོང་ཉིས་བརྒྱ་ལོ། །འཕོ་ཆེན་གཅིག་ལ་ལྔས་བགོས་ནོར། །དེ་སྙེད་མི་ལོ་རྩོད་ལྡན་དུས། །ནོར་དེ་གཉིས་གསུམ་བཞིས་བསྒྱུར་བ། །གཉིས་ལྡན་གསུམ་ལྡན་རྫོགས་ལྡན་ཚད། །ལོ་རྫོགས་དེ་རྣམས་ཀྱིས་ནི་མཐར། །གཟའ་རྣམས་སྟོང་པ་ལ་ཞུགས་ཤིང་། །སླར་ཡང་ངེས་པ་སྐྱེ་བ་ཞེས། །འཇིག་རྟེན་མཁྱེན་པ་དེ་ཡི་གསུངས། །དེ་ཡང་གཟའ་རྣམས་ཀྱིས་ནི་ཞག །རང་རང་དཀྱིལ་འཁོར་ཚད་ཡིན་ཏེ། །དེའི་ཕྱེད་ལ་ཞག་ཕྱེད་ཞེས། །རགས་པས་འདུལ་རྣམས་དྲངས་ཕྱིར་དགོངས། །ཞིབ་མོ་ཡང་ནི་རྒྱུད་ཉིད་ལས། །ཉི་མས་ཁྱིམ་ཞག་ཟླ་བས་ཚེས། །སྒྲ་གཅན་གྱི་ནི་ཚེས་ཟླ་དང་། །གཟའ་ལྔ་ཡི་ནི་ཉིན་ཞག་གི །དཀྱིལ་འཁོར་ཡང་དག་གསུངས་པ་ཉིད། །ཞག་ཟླ་ལོ་ཡི་གྲངས་དྲིལ་བས། །མ་ནོར་ཇི་བཞིན་བདེ་བླག་ཏུ། །རྟོགས་པར་འགྱུར་བས་དེས་ཤེས་བྱ། །དེ་ནས་བཅུ་གཅིག་རེས་ཀྱི་གཟའ། །བདུན་དང་ལྷག་བཅས་མིང་རྣམ་གྲངས། །ཉི་མ་སྡུ་ར་དང་ར་བིཿ འོད་གཟུགས་ཉིན་བྱེད་འོད་སྟོང་འཛིན། །འོད་ཀྱི་སྒྲ་གཅན་མེས་སྦྱིན་སྐྱེས། །དབྱིག་གི་ཁུ་བ་རྟ་བདུན་པ། །ཟླ་བ་ཙནྡྲ་དང་པོ་མོ། །ཚེས་བདག་རྒྱུ་སྐར་བདག་ཆ་གཏེར། །རྒྱུ་སྐར་མུ་ཁྱུད་གསུམ་འགའ་དང་། །ཤར་གྱི་ཐིག་ལེ་ཀུ་མུད་གཉེན། །མིག་དམར་ལ་ནི་མངྒ་ལ། །ལུས་དམར་ས་སྐྱེས་ས་ལྷའི་བུ། །རྩིབ་ལྡན་འོད་ཟེར་དགུ་པ་དང་། །འཁྱོག་པ་དང་ནི་བཀྲ་ཤིས་སོ། །ལྷག་པ་བུ་སྣ་ཞེས་སུ་གྲགས། །ཟླ་བའི་བུ་དང་ཐོད་ལྡན་སྐྱེས། །ལུས་གཅིག་གསེར་ལྡན་ཚིམ་བྱེད་སྐྱེས། །རྒྱལ་བའི་བུ་དང་རབ་དགའ་འོ། །ཕུར་བུ་བྲྀ་ཧསྶ་ཏི་སྟེ། །འཕར་ལྡན་ལྷ་ཡི་སློབ་དཔོན། །རྩུབ་ལྡན་ཤིན་ཏུ་གསལ་བའི་ཅུང་། །ཤེས་ལྡན་ཚིག་བདག་འཚོ་བྱེད་དོ། །པ་སངས་བཱུ་ཀྲི་ཡ་ཞེས་བྱ། །ལྷ་མིན་བླ་མ་ངན་སྤོང་བུ། །སྦྱིན་བྱེད་ཁུ་བ་སྙན་ངག་མཁན། །བཅུ་དྲུག་འོད་ལྡན་ཚིག་བརྒྱའི་དབང་། །སྤེན་པ་ཤ་ནཻཤྩ་ར་སྟེ། །འོད་ཟེར་བདུན་པ་ཉི་མའི་བུ། །དལ་རྒྱུ་ཚངས་སྐྱེས་མི་ཟད་མིག །གཤིན་རྗེའི་བ་དན་ཞི་འགྲོའོ། །གཞན་ཡང་ཉི་ནས་སྤེན་པའི་བར། །རྟ་དམར་རྟ་དཀར་ཅན་དམར་པོ། །སྔོན་པོ་སྣ་ཚོགས་གཙུག་ཕུད་སྐྱེས། །དཀར་པོ་ནག་པོ་ཞེས་ཀྱང་གྲགས། །སྒྲ་གཅན་ལ་ནི་རཱ་ཧཱུ་ལ། །མགོ་བཟླུམ་སེང་གེ་མོ་ཡི་བུ། །ཁམས་གསུམ་རྣམ་རྒྱལ་ཉེ་འཕར་འགྲོ། །མུན་ཅན་སྤྱང་ཉི་སྤྲིན་ལས་རྒྱལ། །མཇུག་མ་ལ་ནི་ཨ་ན་ལ། །མེ་དང་དུས་མེ་ཞེས་བྱའོ། །ཀེ་ཏུཿལ་ནི་མཇུག་ཕོད་དང་། །དུ་བ་མཇུག་རིང་སྦྲུལ་ཅན་དང་། །གཙུག་ཕུད་ཅན་དང་སྐྲ་གཉིས་པ། །སྟེང་འགྲོ་གདེངས་ཀ་ཅན་ཞེས་སོ། །བརྟན་པ་ལ་ནི་བརྟན་གནས་དང་། །དྷྲུ་བ་དང་ནི་རྐང་སྟེང་བུ། །ཨཽཏྟཱ་ན་ས་དི་ཞེས་བྱ། །དུ་བ་མཇུག་རིང་། དེ་བས་རྣམ་གྲངས་གཞན་མ་མཐོང་། །རི་བྱི་རི་ཥི་ཨ་གསྟྱ། །བུམ་པ་སྐྱེས་དང་མཛའ་བོའི་བུ། །རླུང་ཐོབ་ཟོས་དང་སར་ལྡན་བཅོམ། །རྒྱ་མཚོ་ཧུབ་གཅིག་བདུད་རྩིས་སྦྱིན། །རི་བོ་འཕེན་དང་ལྷོ་མཐར་རྒྱུ། །ཆུ་ལྷའི་སྲས་པོ་བདེན་ཚིག་གྲུབ། །ཀེ་ཏ་ཀ་ཡི་ཁྱིམ་བདག་དང་། །ཆོས་ཅན་བདག་པོ་ཞེས་བྱའོ། །གཞན་ཡང་གཟའ་རྣམས་སྐྱེས་སྐར་ལས། །མེ་བཞི་སྐྱེས་སོགས་ཡང་ཤེས་བྱ། །དེ་ལྟར་གཟའ་རྣམས་སོ་སོའི་མིང་། །དུས་ཉི་ཟླ་བརྟན་རི་ཥི་ལས། །གཞན་ཡང་རིང་གི་རྣམ་གྲངས་བརྒྱད། །ལྷག་བཅས་སྐབས་འདིར་མདོར་བརྟན་བྱས། །རེས་གཟའ་བདུན་པོ་ཨིའི་བརྡར། །གཅིག་ནས་དྲུག་བར་ཉི་བར་ནས། །པ་སངས་བར་ཡིན་བདུན་པ་ཐིག །སྤེན་པའི་རི་མོར་ཡོངས་སུ་གྲགས། །རེས་གཟའ་ཞེས་པའི་མིང་དོན་ནི། །ཚེས་སམ་ཉིན་ཞག་ལ་རེས་མོས། །ལྷག་ཆད་བར་མཚམས་མེད་པ་རུ། །དབང་བྱེད་པས་ན་རེས་གཟའ་གྲགས། །རེས་གཟའ་བདུན་པོ་ཁ་ཅིག་གི །སངས་རྒྱས་རབ་བདུན་སྤྲུལ་པར་སྨྲ། །སྤྱིར་ནི་བོད་འདིར་གཟའ་ཕོའི་མཚམས། །བཞེད་ཚུལ་མི་འདྲ་མ་བྱུང་བས། །མཁས་པའི་མཁས་པ་སྔོན་རྣམས་ཀྱི། །རེས་གཟའ་ཉིན་ཞག་སྤྱོད་པའི་ལུགས། །གཟའ་གནས་རི་མོའི་དེ་འདས་པ། །ཕྱི་མ་རྣམས་ཀྱི་ད་ལྟར་མཛད། །འོན་ཀྱང་ཕུལ་བྱུང་ལེགས་བཤད་ཅན། །གང་ཡིན་དེ་ཡི་རྗེས་འབྲང་ནས། །དེ་ནས་སྤྱི་དོན་བཅུ་གཉིས་པ། །ཚེས་ཀྱི་ངེས་པ་བཤད་བྱ་སྟེ། །དེ་ཡང་མདོར་བསྟན་གྲངས་མིང་དབྱངས། །ཁམས་དང་འདོན་ཡོན་ན་ཚོད་དོ། །གྲངས་ནི་དཀར་དམར་ཕྱོགས་གཉིས་ལ། །ཡོན་ཏན་དབང་གིས་ལྔ་གསུམ་ངེས། །མིང་ནི་དགའ་བཟང་རྒྱལ་སྟོང་ཐོས། །ཕྱོགས་རེ་ལྔ་གསུམ་བཅོ་ལྔ་འཁོར། །དབྱངས་ནི་ཨ་ཨི་རྀ་ཨུ་ལྀ། །ཕྱོགས་རེར་དགའ་དང་མཚུངས་པར་ལྡན། །ཁམས་ནི་མཁའ་རླུང་མེ་ཆུ་ས། །དབྱངས་ཀྱི་རྗེས་སུ་འགྲོ་བ་ཉིད། །འདོད་ཡོན་སྒྲ་རེག་རོ་གཟུགས་དྲི། །གཅིག་ནས་ཉ་བར་ལན་གསུམ་འགྱུར། །ན་ཚོད་གང་འཆར་དབྱངས་ཀྱི་སྦ། །ལྷག་རིམ་གཞོན་དར་རྒན་ནུབ་འགྱུར། །ཞིབ་པར་དཀར་ཕྱོགས་བཅོ་ལྔ་ལ། །དབྱངས་ཡིག་མཐར་གནས་ཧ་བཅས་དང་། །ནག་ཕྱོགས་བཅོ་ལྔར་གོང་དེ་ཉིད། །རིང་པོར་བྱས་ནས་འཆར་བ་དང་། །གཞན་ཡང་ཀརྐཊ་ནས་བརྩམ། །མཚན་མོ་འཕེལ་བ་ཟླ་དྲུག་ལ། །དེ་བཞིན་ཀ་སྡེ་ཙ་ཊ་པ། །ཏ་སྡེ་པ་ཀྤ་ཥ་ཤ་ཐྐ། །གསལ་བྱེད་མཐའ་ནས་ལུགས་ལྡོག་པར། །དབྱངས་ཐུང་དྲུག་པོ་ལུགས་འབྱུང་ཉིད། །ཨ་ཨི་རྀ་ཨུ་ལྀ་ཨཾ་རྣམས། །གསལ་བྱེད་ཡི་གེ་རེར་རིམ་ཞུགས། །ཆུ་སྲིན་ནས་ཙམ་ཉིན་རིང་བ། །དྲུག་ལ་པཱ་ཀྤཱ་ཎཱ་ཤཱཐྐ། །དེ་ནས་རིམ་པར་ཏྟྲ་པྤ་ཊཱ། །ཙྩ་ཀྐཱ་སྡེ་ཚན་ལུགས་འབྱུང་ཉིད། །མཐུག་པོར་དབྱངས་རིང་ལུགས་ལྡོག་དྲུག །ཨཿལཱྀ་ཨཱུ་རཱྀ་ཨཱི་ཨཱ་སྦྱོར། །འདི་ལའང་ན་ཚོད་བྱིས་སྦ་སོགས། །གོང་དུ་བཤད་བཞིན་རིམ་པར་སྦྱོར། །ཚུལ་འདི་བསྡུས་རྒྱུད་རྩ་འགྲེལ་ལས། །གསལ་གསུང་འདི་རུ་མདོ་ཙམ་བསྟན། །དེས་ཀྱང་ཅི་རིགས་མཚོན་ནུས་མོད། །ཞིབ་པར་གཞན་དུ་རྟོགས་པར་བྱ། །འཕྲལ་མཁོ་ཚེས་ཞག་ལོངས་སྤྱོད་ནི། །རེས་གཟའ་བདུན་གྱི་ཨངྐིའི་འོག །གནས་པའི་ཆུ་ཚོད་སྲང་སོགས་ལ། །ཚེས་ལོང་ཞེས་སུ་ངོས་འཛིན་ནོ། །འཕྲོས་བྱུང་ཚེས་ཀྱི་ལྷག་ཆད་ཞེས། །བརྗོད་པར་རྐང་པ་འཕེལ་འགྲིབ་སྐབས། །རྩ་བ་ཚེས་ཞག་གཅིག་ལོངས་སྤྱོད། །ཆུ་ཚོད་ང་དགུ་ཆུ་སྲང་གསུམ། །དབུགས་བཞི་ཆ་ཤས་བཅུ་དྲུག་སྟེ། །དེ་ལ་རྐང་པ་འཕེལ་བ་ཡི། །དཔེར་ན་ཚེས་གཅིག་ལྷག་བརྗོད་སྐབས། །འཕེལ་རྐང་དབྱུག་ལྔ་རྩ་ལང་ལ། །བསྣན་པས་དབྱུ་གུ་རེ་བཞིར་འགྱུར། །དྲུག་ཅུའི་ཉིན་ཞག་ཆུ་ཚོད་རྫོགས། །དབྱུག་བཞི་ལུས་ལ་ལྷག་ཞེས་བརྗོད། །དེས་ན་ཚེས་གཅིག་སྔ་མ་དངོས། །ཕྱི་མ་ཆུ་ཚོད་བཞི་རྫོགས་མཚམས། །ཚེས་གཉིས་སླེབ་ཀྱང་གཅིག་ཞག་ཤེས། །ཚེས་གྲངས་ཆད་ཚེ་རྐང་འགྲིབ་པ། །དཔེར་ན་ཚེས་གཉིས་ཆད་པའི་ཚེ། །ཚེས་གཅིག་ཆུ་ཚོད་གཉིས་ལྟ་བུར། །རྩ་ལང་དབྱུག་གུ་ལྔས་བྲི་བའི། །ང་བཞི་བསྣན་ཡང་ཉིན་ཞག་ཚད། །དབྱུ་གུ་དྲུག་ཅུ་མ་ལྡང་བས། །ཚེས་གསུམ་ལོངས་སྤྱོད་ནས་དབྱུག་བཞི། །བསྣན་པས་ཚེས་གཉིས་ཆད་ཞེས་གྲགས། །དོན་དུ་ཚེས་ཀྱི་ངོ་བོ་ནི། །ལྷག་དང་ཆད་པ་མེད་ཞེས་བྱ། །དེ་ནས་བཅུ་གསུམ་རྒྱུ་སྐར་གྱི། །རྣམ་གྲངས་འདི་རུ་བཤད་བྱ་ན། །དེ་ཡང་ཡོངས་སུ་གྲགས་པ་ཡི། །རྒྱུ་སྐར་ཉི་ཤུ་བརྒྱད་དུ་ངེས། །དེ་མིང་བོད་འདིར་སྔོན་དུས་སུ། །རྒྱ་ནག་ནས་འགྱུར་བརྡར་བཞག་པར། །སྨིན་དྲུག་སྣར་མ་མགོ་དང་ལག །ནབས་སོ་རྒྱལ་ཀཀ་ཤར་སྐར་བདུན། །མཆུ་བྲ་སྦོ་དང་མེ་བཞི་དང་། །ནག་པ་ས་ག་ས་རི་ལྷོ། །ལྷ་མཚམས་སྣྲོན་སྣུབ་ཆུ་སྟོད་སྨད། །བྱི་ཞུན་གྲོ་ཞུན་ནུབ་སྐར་ཡིན། །མོན་བྲ་མོན་གྲུ་ཁྲུམས་སྟོད་སྨད། །ནམ་གྲུ་ཐ་སྐར་བྲ་ཉེ་བྱང་། །ཁ་ཅིག་གྲོ་ཞུན་བྱི་ཞུན་ཞེས། །འདོན་མདོ་འདི་ནི་སྣང་བརྒྱད་ནས། །གསུང་བཞིན་པ་སྟེ་མདོ་དེ་ནི། །རྒྱལ་བའི་སྨོན་ལམ་མཐུའི་བྱུང་ཤེས། །དེ་ཡང་དུད་ཀྱི་འཁོར་ལོ་ལས། །ཕྱི་དང་ནང་གི་གནས་གཉིས་ཀར། །རྒྱུ་སྐར་ཉེར་བརྒྱད་ཡང་ཡང་གསུང་། །འོན་ཀྱང་ལག་རྩིས་སྐབས་ཀུན་ཏུ། །བྱི་ཞུན་གྲོ་ཞུན་ཁོངས་སུ་བསྡུས། །རྒྱུ་སྐར་འཁོར་ལོ་ཉེར་བདུན་ངེས། །འཁོར་ལོའི་ཐོག་མ་ཐ་སྐར་དང་། །ཐ་མ་ནམ་གྲུར་ཡོངས་སུ་བཞག །དེ་རྣམས་སྐར་རྩིས་ཨངྐིའི་བརྡའ། །གནས་ལུགས་རི་མོ་དེ་ལྟར་ཡང་། །ད་ལྟ་ལག་རྩིས་ལག་ལེན་དུ། །གཅིག་ནི་བྲ་ཉེ་གཉིས་སྨིན་དྲུག །རིམ་བགྲངས་ཐིག་ནི་དབྱུག་གུ་ཡིན། །ཅི་ཕྱིར་སྔོན་དུས་ཡན་ལག་ལྔའི། །རེས་གཟའ་སྐར་མ་འདས་མར་བཞེད། །གཟའ་ལ་གཟའ་བདུན་རྩོན་འཛིན་སོགས། །མི་ཤེས་པའམ་མ་བྱས་པས། །དཔང་པོ་མེད་པས་འདོད་མ་འཆམ། །ཕྱི་དུས་རེས་གཟའ་ད་ལྟར་གྱུར། །སྐར་མ་མིག་ཤེལ་དབང་པོའི་ཡུལ། །མ་འཁྲུལ་རེ་འགྲོགས་ཟླ་སྐར་ལ། །སྒོམ་མ་ནུས་པས་ད་ལྟའི་བར། །འདས་པ་ཉིད་དུ་གནས་པས་ན། །གཅིག་པ་ཐ་སྐར་ཐིག་ལེ་ལ། །ངོས་འཛིན་བྱེད་པ་གནད་དེས་ཡིན། །རྒྱུ་སྐར་དེ་རྣམས་མིང་འཕགས་ཡུལ། །ལེགས་སྦྱར་སྐད་ཀྱིས་བརྗོད་པ་ན། །ཐོག་མ་དབྱུ་གུ་ཨཱཤྩི་ན། །དེ་ནས་རིམ་བཞིན་བྷ་ར་ཎ། །ཀཱརྐི་ཀ་དང་རཽ་ཧི་ཎཱི། །མཱརྒ་ཤིཪྵ་དང་ཨ་ཏྲ། །སུནྦར་དང་སཽཋྱ་དང་། །ཨི་ཤྱེ་ཎ་དང་མཱ་གྷ་དང་། །པཱུརྦ་ཕལ་གུ་ནི་ཞེས་དང་། །ཨུརྟ་ར་ཕལྒུ་ནི་དང་། །པྲཀྥལ་དགུ་ནི་དང་ཙཻཏྲ། །སྭཱ་ཏིཿདང་ནི་བཻ་ཤ་ཥ། །ཨུ་ནུ་ར་དྷཱ་དང་ཛྱཻཎ། །མུ་ལ་སུརྦཱ་ཥ་དྷ་དང་། །ཨུཏྟ་རཱ་ཥ་ཌྷ་ཞེས་དང་། །ཨ་བྷི་ཛི་ཏ་བྱི་ཞུན་སྟེ། །བྷྲཱ་ཝ་ཎ་ཞེས་གྲོ་ཞུན་ནོ། །གཞང་རོམ་བཞིན་དྷ་ནིཥྛ། །ཤཱ་ཏ་བྷི་ཥ་ཞེས་བྱ་དང་། །པུརྦ་བྷཱ་དྲ་པཱ་ད་དང་། །ཨུཏྟ་ར་བྷཱ་དྲ་སཱ་ད། །ཧེ་ཝ་ཏི་ཞེས་ནམ་གྲུའོ། །དེ་ལྟར་རྒྱུ་སྐར་ཉེར་བདུན་མིང་། །བོད་ཀྱི་ཡུལ་གྲུ་ཐ་དད་ཀྱི། །འདྲ་མིན་བརྡའ་རུ་བཞག་པ་གང་། །དགོས་པ་སྤང་ཕྱིར་འདིར་བརྗོད་ན། །ཐ་སྐར་ལ་ནི་དབྱུ་གུ་དང་། །བྲ་ཉེ་སྒྱིད་བུ་སྣར་བིའུ་རྫི། །མགོ་ལ་སྨལ་པོ་ལག་པའང་ཟེར། །ནམ་སོ་རྒྱལ་སྟོད་རྒྱལ་རྒྱལ་སྨད། །སྐག་ཝ་མཆུ་བྲར་སྟྭ་ཆེ་ཆུང་། །རྟ་པ་རྟའུ་ཞེས་ཀྱང་ངོས། །སྦོ་ཁྲ་མེ་བཞིར་བྱ་མ་དང་། །ནག་པར་བྱ་བུ་བྱིའུའོ། །ས་གཉིས་གནམ་ཐོང་གོང་དང་འགོ །ལྷ་མཚམས་ལག་སོར་སྣྲོན་ལྡེག་གུ །སྣུབ་ལ་སོགས་པ་གྲུ་སོགས་དང་། །གཡང་སོགས་ཡང་སྟེ་ཆུ་གཉིས་ལ། །བྲ་བྲ་དང་ནི་བྲ་ཕུལ་ཡང་། །བྱི་ཞུན་བྱ་ཟེའམ་བྱ་ཆུ། །གྲོ་ཞུན་བྱ་སྦོ་མོན་དྲེ་ལ། །བྱ་གཞུག་མོན་དྲེར་སྒྲོག་ཞེས་བྱ། །ཁྲུམས་གཉིས་ཤེས་པ་ཡས་མས་ཟུར། །ཕྱི་རྩེ་ལུག་གུ་སྨི་ཡང་སྐད། །ནམ་གྲུར་ཞེས་པ་དེ་རྣམས་ནི། །གཙང་དང་མངའ་རིས་ཡུལ་སྐད་ཡིན། །བོད་ཆེན་མདོ་ཁམས་བྱང་འབྲོག་པས། །འདྲ་མིན་ཐ་སྙད་བྲ་ཉེ་ལ། །སྤུན་གསུམ་མཆུ་བ་སྦོ་ཕུ་རོན། །མེ་བཞི་ནག་པར་ཁྲ་བྱ་རོག །ས་གཉིས་སྒོ་ང་སྒོང་སྐོག་དང་། །ལྷ་མཚམས་དར་དང་སྣྲོན་གདུབ་བུ། །སྣམ་གྲུ་ཆུ་སྨད་ལ་སྐྱལ་ས། །ཞུན་གཉིས་མོན་གཉིས་ལ་གསལ་ཞིང་། །བོན་སྤུར་སྒྲོག་གྲགས་ཁ་ཅིག་ཏུ། །མོན་གཉིས་སྒྲོག་སྟོད་སྒྲོག་སྨད་དང་། །ཁྲུམས་གཉིས་སེ་སྟོད་སེ་སྨད་གྲགས། །ནམ་གྲུའི་མིང་ལ་སྲབ་མདའ་འདོད། །དེ་དག་ཡུལ་སྐད་ཐ་སྙད་དེ། །འཕགས་ཡུལ་མཁས་པས་བྱས་པའི་མིང་། །མངོན་པར་བརྗོད་པའི་གཞུང་རྣམས་སུ། །ལེགས་པར་ལྟས་ནས་ཤེས་པར་བྱ། །གཞན་ཡང་སྐར་ཆེན་ཉེར་བརྒྱད་ཀྱི། །ཐུན་མཚམས་དབང་བྱེད་སྐར་ཆུང་རེ། །ཡོད་ཞེས་འཕྲུལ་རྩིས་ལུགས་མཐུན་པའི། །བསྟན་བཅོས་མཆོག་ལས་འབྱུང་ཡང་མཐོང་། །སྐར་ཆེན་རྣམས་ཀྱང་ཤུགས་ཆེ་ཆུང་། །ཡོད་པས་ཟླ་བ་དང་ཕྲད་ཚེ། །འགྲོགས་ཡུན་རིང་ཐུང་འབྱུང་ངོ་ཞེས། །རྒན་དག་རིམ་པས་རྒྱུད་ལས་འོང་། །དེ་ནས་བཅུ་བཞི་སྦྱོར་བ་ཞེས། །ཉི་ཟླ་དག་པའི་རི་མོ་གཉིས། །བསྲེས་ལ་སྦྱོར་བ་ཞེས་གསུངས་ཏེ། །དཀྱིལ་འཁོར་ཚད་གང་ཉི་ཤུ་བདུན། །དེ་སྐད་མིང་གི་རྣམ་གྲངས་ནི། །རྣམ་སེལ་མཛའ་བོ་ཚེ་ལྡན་དང་། །བསྐལ་བཟང་བཟང་པོ་ཤིན་ཏུ་བསྐྲང་། །ལས་བཟང་འཛིན་པ་ཟུག་ངུ་དང་། །སྐྲང་པ་འཕེལ་བ་ངེས་པ་དང་། །ཀུན་འཇོམས་དགའ་བ་རྡོ་རྗེ་དང་། །དངོས་གྲུབ་ཤིན་བཏུང་མཆོག་གམ་དཔའ། །ཡོངས་འཇོམས་ཞི་དང་གྲུབ་པ་དང་། །བསྒྲུབ་པ་དགེ་བ་དཀར་པོ་དང་། །ཚངས་པ་དབང་པོ་འཁོན་འཛིན་ནོ། །དེ་དག་ལེགས་སྦྱར་སྐད་དུ་ནི། །རྣམ་སེལ་ནས་ནི་ཁོན་འཛིན་བར། །སུ་ད་ན་དང་ཨསྟ་དང་། །ཨ་ཡུཥྨ་དང་སུ་དྷ་ཀ །བྷ་དྲ་ཨ་ཀཎྜ་ཀ་དང་། །ཀཪྨ་པུ་དང་དྷ་ར་དང་། །ཤ་ལྱ་གཎྜ་པྲྀཏྟ་དང་། །ནི་ཡར་སརྦ་དཱ་ར་ཎ། །ཨ་ནན་ད་དང་བཛྲ་དང་། །སིནྡྷི་ཨཱ་པཏྟ་བཱི་ར། །པྲ་མརྡེ་ན་ཤིནྟི་དང་། །སིདྡྷི་སཱ་དྷ་ཤུ་བྷ་དང་། །པི་ཏ་བྲཧྨ་ཨིནྡྲ། །ཨ་རཏ་ཞེས་སུ་རིམ་ཤེས་བྱ། །སྐད་དོད་རྒྱ་དཔེ་ཐ་དད་པར། །ཅུང་ཟད་འདྲ་མིན་ཡོད་པར་མངོན། །སྦྱོར་བ་ཉེར་བདུན་ཨངྐི་ནི། །ཐིག་ནི་སེལ་བ་གཅིག་མཛའ་བོ། །རིམ་དེས་ཉེར་དྲུག་འཁོན་འཛིན་དུ། །ཤིན་ཏུ་མཁས་པ་རྣམས་ཀྱི་བཞེད། །འགའ་ཞིག་གཅིག་ལ་རྣམ་སེལ་དང་། །ཐིག་ལེ་འཁོན་འཛིན་ཉིད་བརྗོད་དེ། །དེ་ཡང་འདས་དང་ད་ལྟའི་བར། །རྒྱུ་སྐར་སྐབས་བཞིན་ཤེས་པར་བྱ། །དེ་ལྟར་སྦྱོར་བར་གྲགས་དེ་དག །ངོ་བོའི་ངོས་འཛིན་མཁས་རྣམས་ཀྱི། །བཞེད་པ་མི་འདྲ་མང་མཐོང་ཡང་། །དེ་ལས་ཐ་དད་ཆ་བཟུང་བ། །ཉི་ཟླ་གཉིས་ཀྱི་རྒྱུ་སྐར་ཆ། །ཟུང་གཅིག་ཕྱོགས་དུས་སྤྱོད་པ་མི། །ཕན་ཚུན་ནང་གི་ཕྲོད་ཉིད་ལ། །སྦྱོར་བ་ཞེས་སུ་གདགས་གསུང་བ། །འདི་ལ་འགལ་བའི་ཆ་མང་པོ། །མ་མཐོང་རེ་ཞིག་དེ་ལྟར་བཟུང་། །དེ་ནས་བཅོ་ལྔ་བྱེད་པ་ལ། །འཕོ་དང་མི་འཕོ་སྡོམ་པ་ཡི། །དཀྱིལ་འཁོར་བཅུ་གཅིག་མཆིས་ན་ཡང་། །འཕོ་བྱེད་བདུན་གྱི་རི་མོར་མཛད། །འཕོ་བའི་བྱེད་པ་བདུན་གྱི་མིང་། །པ་བཾ་བ་མ་པཾ་ཀཽལྤཾ། །ཏཻ་ཏི་ལཾ་དང་གི་ཧ་ཛམ། །པཱ་ནི་ཛཾ་དང་བིཥྚི་སྟེ། །ལེགས་སྦྱར་སྐད་ཡིན་བོད་སྐད་དུ། །གདབ་པ་བྱི་སྦ་རིགས་ཅན་དང་། །ཏིལ་བསྡུང་ཁྱིམ་སྐྱེས་དཔུན་པ་དང་། །བིཥྚི་མཇུག་ཕོད་ཞེས་བྱའོ། །ཨིངྐའི་རི་མོར་གཅིག་ལ་ནི། །གདབ་པ་གཉིས་ལ་བྱིས་སྦ་ཡིན། །རིམ་དེས་དྲུག་པ་ལ་སྤུན་མ། །བདུན་པ་ཐིག་ལེ་བི་ཊི་སྟེ། །དེ་རྣམས་ཚེས་རེས་ཆ་གཉིས་བྱས། །ཆ་རེ་བྱེད་པ་རེས་སྤྱོད་དེ། །དཀར་ནག་ཚེས་གཅིག་ཆ་ཕྱི་མ། །གདབ་པ་གཉིས་སྔ་བྱིས་སྦས་སྤྱོད། །གཉིས་ཕྱི་རིགས་ཅན་གསུམ་གྱི་སྔ། །ཏིལ་བསྡུང་ཕྱི་ཆ་ཁྱིམ་སྐྱེས་སོ། །བཞི་ལྔ་དཔུན་མ་བཞིའི་ཕྱི་ཆ། །བིཥྚི་རྒྱུ་བའི་སྐབས་ཡིན་ཏེ། །དེ་བཞིན་ཚེས་ལྔའི་ལྔ་ཆ་ནས། །ནག་པོའི་བཅུ་བཞིའི་སྔ་ཆའི་བར། །དཀར་ནག་ཕྱོགས་རེར་ལན་བཞི་སྟེ། །ཟླ་གཅིག་ཕྱོགས་གཉིས་ལན་བརྒྱད་འཁོར། །མི་འཕོ་རྟག་པའི་བྱེད་པ་བཞི། །ལེགས་སྦྱར་སྐད་དུ་ཤངྐུ་ནི། །སཱ་ད་ཙཱ་ཏུཿདང་ན་ག །ཀིཾ་སཱུ་གྷྲི་ཎི་ཞེས་བྱ་བ། །བོད་སྐད་ཕུར་བུ་རྐང་བཞི་ཀླུ། །མི་སྡུག་པ་སྟེ་གོ་རིམ་བཞིན། །ནག་པོའི་བཅུ་བཞི་ཕྱི་ཆ་དང་། །བཅོ་ལྔའི་སྔ་ཕྱི་དཀར་པོ་ཡི། །ཚེས་གཅིག་སྔ་ཆ་རྣམས་ལ་སྟེ། །འཕོ་མེད་ཟླ་རེ་ལན་རེ་འཆར། །བིཥྚི་ཀིང་ཀང་རྒྱུ་དུས་དང་། །ཆ་མཐུན་པས་ན་གཉན་པ་ཡིན། །དེ་ལྟར་གཟའ་ཚེས་སྐར་མ་དང་། །སྦྱོར་བ་དང་ན་བྱེད་པ་ལ། །ལེགས་སྦྱར་སྐད་དུ་རིམ་པ་བཞིན། །གྲ་ཧ་ཅེས་དང་རི་ཐི་དང་། །ནགྵ་ཅེས་དང་ཡོ་ག་དང་། །ཀ་ར་ཎ་ཞེས་བྱ་བ་སྟེ། །ཡན་ལག་ལྔ་རུ་ཡོངས་གྲགས་ཤིང་། །ལྔ་བསྡུས་ཞེས་ཀྱང་བརྗོད་པ་ཡིན། །དེ་ལ་ཡང་ནི་ཕྲལ་འཁོག་བའི། །གོ་དོན་ཁ་ཤས་བཤད་བྱ་སྟེ། །དེང་སང་ལག་རྩིས་ཉིད་ཀྱི་སྐབས། །གཟའ་ཡི་ཨངྐིའི་འོག་དབྱུ་གུ །ཚེས་ལངས་གྲགས་པའི་རི་མོ་དེ། །ནམ་ལངས་ནས་སྤྱོད་ད་ལྟ་བ། །ལོངས་སྤྱོད་དེས་རྫོགས་ཚེས་ཀྱང་འཕོ། །ཚུལ་དེ་གསལ་བར་ལྟ་བ་ན། །མཁའ་རོར་ཚེས་ལོངས་སྔ་མའི་དབྲི། །དེ་ལྷག་ད་ལྟ་ལོངས་སྤྱད་བྱ། །ད་ལྟ་འདས་བསྲེས་ཚེས་གང་དེའི། །ལོངས་སྤྱོད་ཚད་ཀུན་ཚངས་བྱ་སྟེ། །དེ་རྫོགས་དེ་མ་ཐག་པར་མེད། །ཕྱི་མའི་ཚེས་ལོངས་ཚུགས་པ་ཡིན། །དེ་ལྟའི་ཡུན་དུ་ཚེས་ཉིད་ལ། །འཆར་བའི་རིགས་དང་འབྱུང་པོའི་ཚོགས། །ཚེས་ལ་རྒྱུ་བར་ངེས་རྣམས་སྦྱར། །འོན་ཀྱང་དུས་ཚོད་རྒྱུ་བ་ཡི། །འབྱུང་པོའི་ཚེས་ལ་མི་སྦྱོར་ཏེ། །དེ་ནི་ཉིན་ཞག་རྗེས་འབྲང་མང་། །དེ་ཕྱིར་ཞག་དེའི་དུས་ལ་ངེས། །དེང་སང་དེ་འདྲ་ཁ་ཅིག་གིས། །ཚེས་ལ་སྦྱོར་བ་བབ་ཆོལ་ཡིན། །དཔེར་ན་ལག་གཡས་ལྤགས་པ་རུ། །གཡོན་གྱི་ཤ་རུས་འགྲིག་མིན་ལྟར། །འདྲ་རུང་ཁུངས་སྲོལ་ཐ་དད་པར། །གཅིག་ཏུ་ངེས་པར་བསྲེ་མ་དགོས། །དེས་ན་སོ་སོའི་གཞུང་ལུགས་དག །མ་འཁྲུལ་སྤྱད་པ་ཉིད་ཤེས་བྱ། །དེ་ཡང་བྱེད་རྩིས་ཚེས་ལོངས་ནས། །འདས་ལོ་མང་བཞིན་ཉུང་སྐྱོན་འབྱུང་། །དེ་ལ་མན་ངག་བཞིན་དབྱུག་བསྣན། །དེ་བཞིན་བྱེད་རྩིས་ཉི་མ་ལ། །མང་ཆ་ཡོད་པས་དབྲི་བར་བྱ། །སྐར་མ་ལ་ནི་ཟླ་སྐར་དང་། །ཉི་སྐར་དག་སྟེ་ཟླ་སྐར་ལ། །ཞག་རེ་དབྱུ་གུ་མཚོ་དབང་དང་། །ཉི་མའི་ཞག་གཅིག་ལོངས་སྤྱོད་བཅས། །དེ་ལ་རྐང་དག་རེ་གཟའ་ཡི། །ལོངས་སྤྱོད་ཀྱིས་དམན་རེས་འགྲོགས་ཏེ། །དེ་ཡང་ཉི་མའི་ཞག་གཅིག་ཚད། །ཆུ་ཚོད་བཞི་དང་སྲང་ཉེར་གཅིག །དབུགས་ལྔ་རི་དུས་ཆ་ཞེས་གསུམ། །ཚེས་ཀྱི་དཀྱིལ་འཁོར་ཉིད་ལའོ། །ཚེས་འཁྱུད་སྒྲ་གཅན་འཇུག་པ་བརྟག །རེས་འགྲོགས་ཚེས་ཀྱི་སྐར་མ་ནི། །འཕྲལ་དུ་བརྩི་བྱའི་གཙོ་བོ་སྟེ། །རེས་གཟའི་འཕྲོད་ཆེན་ཉེར་བརྒྱད་དང་། །འགྲུབ་སྦྱོར་བསྲེགས་སྦོ་འཆི་སྦྱོར་དང་། །ཟུང་སྦྱོར་དང་ནི་བཀྲ་ཤིས་ནི། །མཐུན་ཉི་སྦྱོར་ཉི་འཕེལ་ཉི་དང་། །འཇིགས་ཉི་རྩུབ་ཉི་མི་འཕྲོད་ཉི། །གཏན་སྤང་ཆུད་རྒྱལ་བདུད་རྩི་རྣམས། །ཟླ་སྐར་ལོངས་སྤྱོད་གནས་ཀྱི་སྟོན། །ཉི་མའི་སྐར་མས་དུས་སྦྱོར་དང་། །དུས་བཞི་དུས་ཕྲན་མཐའ་དག་སྟེ། །ཟླ་སྐར་བཞི་དང་ཉི་ཉིད་ཀྱི། །མཆེ་གདོང་མཐོང་བ་ཤེས་པ་དང་། །གཟའ་ལྔ་ཀེ་རུ་སྒྲ་གཅན་དག །འཆར་ནུབ་འགྲོས་ཕྱོགས་འཇུག་ཐེབས་ཡང་། །ཉི་མས་སྤྱོད་པའི་སྐར་མ་ལ། །བརྟགས་ནས་འགྲུབ་པ་འབའ་ཞིག་དང་། །དབྱངས་འཆར་ནས་གསུངས་འཁོར་ལོའི་རིགས། །ཕལ་ཆེ་ཡང་ནི་འདི་ལ་བརྟེན། །དེས་ན་དུས་རྩིས་ཀུན་གྱི་གཙོ། །ཟླ་ནིའི་སྐར་མར་ཡོངས་ཤེས་བྱ། །དེ་ལྟར་ཟླ་ཡི་སྐར་མ་ཡི། །དབྱུག་སྲང་དབུགས་དང་ཆ་ཤས་གང་། །ལོངས་སྤྱོད་རི་མོ་འདས་པར་འདོད། །ལྷག་མ་ད་ལྟ་ཉིད་སྤྱོད་རྒྱུ། །གསལ་བརྟགས་སྐར་མའི་ལོངས་སྤྱོད་དེས། །མཁའ་རོར་འཕྲིན་ལྷག་ད་ལྟ་འཆར། །ད་ལྟ་འདས་བསྲེས་སྐར་མ་གཅིག །ལོངས་སྤྱོད་ཚེས་ཀྱི་ཡུན་ཚད་ཡིན། །ཚེས་འཁྱུད་རྩིང་པོས་ད་ལྟར་རློམས། །ཞིབ་མོས་རབ་ཏུ་འདས་པ་རྟོགས། །སྦྱོར་བ་དག་གི་ལོངས་སྤྱོད་གང་། །འཆར་ནུབ་འདས་དང་ད་ལྟ་བ། །ཡུན་ཚད་གསལ་བར་བལྟ་ཚུལ་བཅས། །སྐར་མའི་ལོངས་སྤྱོད་ཚུལ་དང་མཐུན། །འོན་ཀྱང་སྦྱོར་བའི་ཚུལ་ཞག་རེར། །ཆུ་ཚོད་རེ་གཉིས་སྲང་ཞེ་གསུམ། །དབུགས་ལྔ་རི་དུས་ཆ་བཅུ་དགུ །སྤྱོད་ཞེས་སློབ་དཔོན་དམ་པས་གསུངས། །སྦྱོར་བ་ཀུན་འཇོམས་ཤིན་ཏུ་བཏུང་། །འཁོན་འཛིན་གསུམ་ནི་ཡོངས་སུ་རྩུབ། །སེལ་བ་གསུམ་དང་ཟུང་ངུར་ཞི། །ཤིན་ཏུ་སྐྲང་དང་སྐྲང་ལ་དྲུག །རང་རང་ལོངས་སྤྱོད་ཐོག་མའི་གནས། །ཡུན་དེའི་ཆུ་ཚོད་རྩུབ་པ་ཡིན། །འཇམ་རྩུབ་དུས་རེར་སོ་སོ་ཡི། །ལས་དེ་ལ་ནི་ཤིས་པར་བཤད། །བྱེད་པའི་རི་མོ་དེ་ལྟ་ཞེས། །སྔ་ཕྱིའི་མཁས་པ་ཐམས་ཅད་མཐུན། །ཚེས་གྲངས་གཉིས་བསྒྱུར་ཐུབ་པ་བགོས། །ལྷག་གནས་གཅིག་འཕྲི་ཕྱི་བྱེད་འཆར། །དེ་ལ་གཅིག་བསྣན་ཚེས་ཕྱི་མའི། །སྔ་ཆའི་བྱེད་པ་ཉིད་འཆར་འགྱུར། །གསལ་བརྟགས་རེས་གཟའི་ཚེས་ལོངས་གཅིག །ད་ལྟ་འདས་བསྲེས་ཡོངས་རྫོགས་ཚད། །གཉིས་སུ་དབྱེས་པའི་ཕྱེད་ཆ་ལ། །བྱེད་པ་རེ་ཡི་སྤྱོད་པར་དྲན། །ལོངས་སྤྱོད་ལྔ་མར་བྱེད་པ་ལྔ། །ལྷག་མར་བྱེད་པས་ཕྱི་མས་སོ། །ཀུན་ལ་ཞིབ་མོར་ལོངས་སྤྱོད་ནི། །ཆུ་སྲང་དབུགས་ཆས་བསྲེ་དང་དབྲི། །རང་རང་འཁོར་ལོས་གཞལ་བ་ཡིས། །ཚད་ལ་གསལ་བར་བརྟགས་པའོ། །དེ་ལྟར་ལྔ་བསྡུས་ལོངས་སྤྱོད་ལ། །འདས་དང་ད་ལྟར་བཞག་པ་ནི། །ནམ་ལངས་ཕན་ཆད་འདས་པ་དང་། །ཚུན་ཆད་ད་ལྟར་ངེས་པར་བཟུང་། །སྔོན་དུས་མཁས་པ་ཆེ་ཁ་ཅིག །ཚེས་ལོངས་དབྱུ་གུ་འདས་པ་དང་། །ཉི་མའི་དབྱུ་གུ་ད་ལྟར་བ། །འདོད་པ་དག་ཀྱང་གསལ་བར་མཐོང་། །རི་མཐུ་བལྟ་དང་དོན་ལ་དཔྱད། །ཀུན་ལ་འདི་ནི་ཤེས་བྱའོ། །དེང་སང་རི་ཐུ་བརྗོད་པ་མང་། །སྔོན་གྱི་ཡི་གེར་ལི་ཐུ་ཡོད། །རྒྱ་ནག་སྐད་ཡིན་རྒྱལ་སྲིད་རེར། །ཚིག་ཟུར་མི་འདྲ་བསྒྱུར་བར་གྲགས། །དེ་ནས་བཅུ་དྲུག་འཕྲོད་བཤད་པ། །དང་པོ་གཟའ་སྐར་ཁམས་ཤེས་བྱ། །གཟའ་ལ་པ་སངས་སྤེན་པ་ས། །ཟླ་བ་དང་ནི་ལག་པ་ཆུ། །ཉི་མ་མིག་དམར་གཉིས་པོ་མེ། །ཕུར་བུ་སྒྲ་གཅན་རླུང་དུ་གྲགས། །ཁ་ཅིག་ཁུ་བ་དཀར་པོ་ཞེས། །པ་སངས་ཆུ་ཡི་ཁམས་ཡིན་གསུངས། །ཀརྨ་སྣར་མ་ལྷ་མཚམས་སྒྲོན། །ཆུ་སྨད་ཞུན་གཉིས་མོན་གྲེ་ས། །མོན་གྲུ་ནམ་གྲུ་ཁྲུམས་སྨད་དང་། །ཆུ་སྟོད་ལག་སྣུམ་སྐག་རྣམས་ཆུ། །སྨིན་དྲུག་བྲ་ཉེ་ས་ག་རྒྱལ། །མཆུ་བྲ་ཁྲུམས་སྟོད་བདུན་གྱི་ཆེ། །ཐ་སྐར་ས་རི་ནམ་སོ་མགོ། །མེ་ཞི་ནག་པོ་སྦོ་རྣམས་རླུང་། །དེ་ལྟར་གཟའ་སྐར་དུས་ཚེས་ཀྱི། །ཡུལ་དུས་ལྷན་ཅིག་འཇོམས་པའི་འཕྲོད། །སྤྱི་དང་བྱེ་བྲག་རྣམ་པ་གཉིས། །སྤྱི་ལ་གཟའ་སྐར་དག་གི་ཁམས། །ས་ནང་ཕྲད་པ་དངོས་གྲུབ་སྦྱོར། །ས་ཆུ་ལང་ཚོ་ས་མེ་བསྲེགས། །ས་རླུང་མི་མཐུན་སྦྱོར་བ་ངེས། །ཆུ་ནང་ཕྲད་པ་བདུད་རྩི་སྦྱོར། །མེ་ཆུ་འཆི་སྦྱོར་ཆུ་རླུང་ནི། །མི་འཕྲོད་པ་ཡི་སྦྱོར་བར་ཤེས། །མེ་ནང་ཕྲད་པ་འཕེལ་འགྱུར་སྦྱོར། །མེ་རླུང་སྟོབས་ལྡན་སྦྱོར་བར་འགྱུར། །རླུང་ནང་ཕྲད་པས་ཕུན་ཚོགས་ཏེ། །རགས་པའི་ཚུལ་དུ་དེ་ལྟར་བཤད། །བྱེ་བྲག་ཞིབ་པར་ཐུན་མོང་དང་། །ཐུན་མོང་མ་ཡིན་རྣམ་པ་གཉིས། །དང་པོ་དྲང་སྲོང་བདུན་གྱི་ལུགས། །འཕྲོད་ཆེན་ཉི་ཤུ་རྩ་བརྒྱད་མིང་། །གོ་རིམ་མ་ཆུག་འདི་ལྟར་སྟེ། །ཀུན་དགའ་དུས་དབྱུག་དུལ་བ་དང་། །སྐྱེ་རྒུའི་དག་དང་གཞོན་བྱ་རོག །རྒྱལ་མཚན་དཔལ་བེ་རྡོ་རྗེ་དང་། །འཆི་གདུང་གྲོགས་ཡིད་འདོད་འགལ་མེ། །རྩ་བཏོན་འཆི་བདག་མདའ་གྲུབ་མདུང་། །བདུད་རྩི་གཏུན་ཤིང་གླང་པོ་སྟག །ཟད་པ་གཡོ་བརྟན་འཕེལ་བའོ། །དེ་རྣམས་སྒྱུ་སྐར་ཞུན་གཉིས་ཕྱེས། །ཉེར་བརྒྱད་གྱུར་དང་རེས་གཟའ་བདུན། །འཕྲད་རིམ་འཕྲོད་ཉེར་བརྒྱད་ལན་བདུན། །ནང་གསེས་བརྒྱ་དང་གོ་དྲུག་འགྱུར། །དེ་ཡང་འཕྲོད་དང་ཀརྨའི་མིང་། །ཐོག་མཐའ་སྨོས་བཞིན་བར་གྱི་རྣམས། །གོ་རིམ་མ་ནོར་གྲང་བ་ཡི། །འཕྲོད་རྣམས་ལུགས་འབྱུང་ཉིད་དུ་སྟེ། །ཉི་མ་ཐ་སྐར་འཕྲད་ཀུན་དགའ། །བར་རྣམས་རིམ་ཤེས་ཐར་ནམ་གྲུ། །འཕྲད་ཚེ་འཕེལ་བ་ཉིད་དུ་རྫོགས། །ཚུལ་དེས་ལྷག་མ་ཤེས་བྱས་ནས། །མགོ་ནས་སྣར་མའི་བར་ཟླ་བ། །སྐག་ནས་རྒྱལ་བར་བཀྲ་ཤིས་འཕྲོད། །མེ་བཞི་སྦོ་བར་ལྷག་པ་དང་། །ལྷ་མཚམས་ས་གའི་བར་ཕུར་བུ། །ཆུ་སྨད་ཆུ་སྟོད་བར་དཀར་པོ། །མོན་གྲུ་མོན་གྲེ་སྤེན་པའོ། །ཉི་འཕྲོད་ཀུན་དགའ་ནས་ཟླ་འཕྲོད། །ཀུན་དགའི་བར་སྐར་བཞིའི་ཁྱད། །གཟའ་བདུན་བར་དུ་དེས་ལྟས་ཀྱང་། །ཚུལ་འདི་ཚེགས་མེད་ཉིད་ཤེས་འགྱུར། །གཞན་ནི་ཤོག་ཁྲ་དང་རི་མོས། །བསྟན་མོད་འདི་ནི་དེ་དག་ལ། །མ་ལྟོས་འཕྲོད་སྐར་མིང་གོ་རིམ། །ཤེས་པས་བདེ་བླག་རྟོགས་པར་བྱས། །བསྲེགས་སྦྱོར་སྐར་མ་མཆུ་ས་ག །ལག་སྣྲུབ་མོན་གྲེ་སྣར་ཆུ་སྟོད། །རེས་གཟའ་བདུན་དང་རིམ་འཕྲོད་པས། །དེར་འགྱུར་དྲང་སྲོང་གཞུང་ལས་སོ། །གཉིས་པ་ཐུན་མོང་མ་ཡིན་པ། །དཔལ་མཆོག་རྒྱུད་ནས་གསུང་པའི་འཕྲོད། །ཉི་མ་མེ་བཞི་ཟླ་གྲོ་ཞུན། །བཀྲ་ཤིས་དབྱུ་གུ་ལྷག་ལྷ་མཚམས། །རྒྱལ་ཕུར་སྤ་ཤེ་སྤེན་སྣར་མ། །འགྲུབ་སྦྱོར་བདུན་སྟེ་སྙིང་སྟོབས་མཚོན། །གཟའ་བདུན་རིམ་སྦྱོར་སྣར་མ་ནི། །ལྷ་མཚམས་སྨིན་དྲུག་མོན་གྲུ་དང་། །དབྱུ་གུ་མགོ་སྣར་མི་བཞི་རྣམས། །ཕྲད་པ་འཆི་སྦྱོར་བདུན་པའི་ཆ། །གཟའ་དང་ཚེས་འཛོམས་བསྲེག་སྦྱོར་ནི། །དཀར་ནག་ཕྱོགས་གཉིས་དག་གི་ཚེས། །བཅུ་གཉིས་བཅུ་གཅིག་བཅུ་ཚེས་གསུམ། །དྲུག་གཉིས་ཚེས་བདུན་གོ་རིམ་བཞིན། །ཉི་ཟླ་མིག་ལྷག་ཕུར་སངས་སྤེན། །འཕྲད་པས་བསྲེགས་ཚེས་རྡུལ་དུ་གོ །གཞན་ཡང་ཉིན་ཞག་རེས་གཟའ་དེས། །སྣ་དྲངས་དུས་སྦྱོར་ཕྱེད་རེར་གཟའ། །འཆར་འགྱུར་ཉིན་ཐུན་བཅུ་གཉིས་ལ། །ཐོད་རྒལ་ཚུལ་དུ་དྲུག་མཚམས་བསྐོར། །མཚན་མོ་ལྔ་མཚམས་བསྐོར་བས་སྤྱོད། །འཆར་རིམ་ངག་འདིའི་བདེ་བླག་ཉིད། །དེ་ལྟར་ཐུན་ཕྱེད་གཟའ་འཕྲོད་མིང་། །བར་སྐབས་ཕུག་སློབ་འཆི་མེད་པས། །དགེ་ལ་བདུད་རྩིའི་ཐུན་མཚམས་སུ། །བསྒྲགས་ཀྱང་རྩ་བའི་ཁུང་གི་གསལ། །དེང་དུས་ཀུན་གཟིགས་དམ་པ་ཆེ། །གཙུག་ལག་སྣང་བས་བྲམ་ཟེ་ཡི། །རྩིས་གཞུང་རྒྱ་དཔེ་དངོས་གཟིགས་པར། །ཐུན་མཚམས་ཐ་དད་མ་འཁྲུལ་མིང་། །ཉི་འཆར་ཟླ་བ་བདུད་རྩི་ཉིད། །མིག་དམར་ནད་དང་ལག་རྐེད་པ། །ཕུར་བུ་དགེ་བ་སྤ་སངས་གཡོ། །སྤེན་པ་ངེས་པར་དུས་ཞེས་ཏེ། །དཔལ་མཆོག་དང་པོའི་རྒྱུད་ཆེན་ལས། །གཟའ་བརྒྱད་ཀླུ་བརྒྱད་མཉམ་སྦྱོར་བ། །ཅེས་རྩུབ་སྒྲ་གཅན་རིགས་ལྡན་གང་། །གཞན་དུས་འཆར་དང་རང་དུས་འཆར། །གཞན་དུས་ཐུན་ཕྱེད་སྤེན་པ་ཡི། །ཆུ་སྲང་ཚད་ནས་འཆར་བ་དང་། །རང་དུས་ཉིན་བརྒྱད་མཚན་ཐུན་བརྒྱད། །ཐུན་ལ་རེས་གཟའ་སྣ་དྲང་སྟེ། །གོ་རིམ་བཞིན་འཆར་སྤེན་པའི་མཐར། །ཐུན་གཅིག་རིགས་ལྡན་སྒྲ་གཅན་དུས། །དེ་ཚེ་བཟའ་བཏུང་གྱིས་སྟོན་མོ། །ཁྱད་པར་སྨན་དཔྱད་བྱ་བ་སྤང་། །སྤྱིར་ནི་དྲག་གཟར་དགེ་མིན་ལས། །ཞི་གཟར་དགེ་བའི་ལས་གྲུབ་བཤད། །རྒྱུད་ལས་རིགས་ལྡན་དངོས་བསྟན་པའི། །ཤུགས་ཀྱི་ཐུན་མཚམས་དུས་སྦྱོར་ཕྱེད། །ཕྲོད་གཟའ་གསལ་བསྟེན་དེས་ན་འདིར། །བླང་དོར་མི་ནོར་ཆེད་དུ་སྨྲས། །དེ་རྣམས་དཔལ་མཆོག་རྒྱུད་ནས་ཏེ། །གཞན་གྱུར་སྔགས་རྒྱུད་ཁ་ཡར་དང་། །འབྱུང་རྩིས་གཞུང་ནས་མང་འབྱུང་བ། །འདིར་སྨོས་མ་ལང་གཞན་དུ་བརྟག །འོན་ཀྱང་ཕྲལ་མཁོ་ཙི་ནའི་གཞུང་། །ལོ་དང་ཟླ་བའི་འཕྲོད་ལ་བརྟེན། །ཟླ་ནག་གྲགས་པ་ཟླ་བའི་མགོ། །འཛིན་ཚུལ་མི་མཐུན་པ་ཡི་ནི། །ལག་རྩིས་འདོད་པ་ཐ་དད་སྣང་། །འདིར་རུ་ལུགས་མང་མི་འཁྲུལ་ཕྱིར། །ངོས་འཛིན་ཚུལ་ཉིད་གསལ་བཤད་ན། །དཔེར་ན་གནམ་ལོ་བྱི་རྟ་ཤར། །དེ་ཚེ་རང་ཟླ་བྱི་རྟ་ཟླའི། །གོང་གི་གསུམ་པ་ཕུང་ཟླ་དང་། །མས་ཀྱི་གསུམ་པ་རབ་ཆད་དེ། །དེས་ན་བྱ་ཡོས་ཟླ་བ་ནག །དེ་བཞིན་རིགས་འགྲེ་གླང་ལུག་ལོར། །ཁྱི་དང་འབྲུག་གི་ཟླ་བ་ནག །སྟག་སྤྲེལ་ལོ་ལ་ཕག་སྦྲུལ་ཟླ། །བྱ་ཡོས་ལོ་ལ་བྱི་རྟའི་ཟླ། །ཁྱི་འབྲུག་ལོ་ལ་གླང་ལུག་ཟླ། །ཕག་སྦྲུལ་ལོ་ལ་སྟག་སྤྲེའུ་ཡི། །ཟླ་བ་ནག་སྟེ་དེ་ལ་ཡང་། །ར་བ་བཞིའི་སྟོད་འབྲིང་བཞིའི་སྒང་། །ཐ་ཆུང་བཞི་ཡི་ཟླ་བ་སྨད། །ཁྱད་པར་དུ་ནི་ནག་པ་ཡིན། །ཚུལ་འདི་རྩིས་མཁན་གསར་བུ་པ། །ཁ་ཅིག་ལོ་མགོ་བཟུང་ཚུལ་གནད། །མ་ཤེས་གཅིག་ལ་གཅིག་འཁྲུལ་བ། །མཐོང་བས་དེ་རྣམས་རྨོངས་གསལ་ཕྱིར། །སྐབས་འདིར་ཧ་ཅང་འཇུག་མིན་ཡང་། །ལྷག་བསམ་དག་པ་ཁོ་ནས་བཀོད། །གཞན་ནི་གནམ་ལོ་རྨེ་འཕྲད་ཀྱི། །ལོ་ནག་ཞེས་ཀྱང་བརྗོད་པ་ཡོད། །སྐར་རྩིས་ལ་ནི་ཚེས་ལྷག་ཆད། །སྤང་བར་བཀྲ་ཤིས་ཟླ་བར་གྲགས། །སྤྱིར་བཏང་རྟེན་འབྲེལ་ཚོགས་པ་ཀུན། །འཕྲོད་དམ་སྦྱོར་སྒྲར་བཞག་རུང་བས། །ཚིག་ཡང་དོན་མང་འཇུག་མོད་འདིར། །ལག་རྩིས་སྐབས་གྲགས་མཚོན་ཙམ་མོ། །དེ་ནས་བཅུ་བདུན་སྟོབས་ཁྱད་ནི། །རེས་ཀྱི་གཟའ་དང་རྒྱུ་སྐར་གཉིས། །དབང་ལྡན་བདག་པོའི་བསྟན་བཅོས་ལས། །རེས་འགྲོགས་རྒྱུ་སྐར་སྟོབས་ཆེ་གྲགས། །དེ་ཕྱིར་རིག་བྱེད་འཛིན་རྣམས་ཀྱི། །ཚེས་ལ་ཡོན་ཏན་གཅིག་གིས་བརྒྱན། །གཟའ་བཞི་རྒྱུ་སྐར་ཡོན་ཏན་བརྒྱད། །དུས་སྦྱོར་ཡོན་ཏན་བྱེ་བར་འདོད། །ད་ལྟ་ལག་ལེན་བྱེད་པ་ཀུན། །རེས་གཟའ་གཙོ་རུ་འཛིན་པར་མཛད། །འོན་ཀྱང་གཟའ་སྐར་སྟོབས་མཐུན་ཤེས། །ཚེས་སྐར་སྐར་མ་སྟོབས་ཆེ་ཞིང་། །སྦྱོར་བ་བྱེད་པ་བྱེད་པ་གཉན། །ཁྱད་པར་བིཥྚི་སྒྲ་གཅན་རིགས། །དེ་རྣམས་ཡན་ལག་ལྔ་སྤྱིར་བཏང་། །སྟོབས་ཀྱི་ཁྱད་པར་དབྱེ་བ་སྟེ། །ཁ་ཅིག་ཀིང་ཀང་རཱ་ཧཱུ་ལ། །གཟའ་དང་སྐར་མ་དུས་ཚོད་ཚེས། །བྱེད་པ་སྦྱོར་བ་ཉི་མ་རྣམས། །གོ་རིམ་བཞིན་གོང་སྟོབས་ཆེ་ཞིང་། །འོག་མ་ནུས་པ་ཆུང་ཞེས་སྨྲ། །དེ་ཚེ་ཀིང་ཀང་རཱ་ཧཱུ་གཙོ། །དཔལ་མཆོག་རྒྱུད་ལས་རྣམ་པ་གཞན། །ཞི་དྲག་གཟའ་རྣམས་ཕྱོགས་གནས་སྟོབས། །རྣལ་འབྱོར་མ་དང་དྲག་པོ་དང་། །བིཥྚི་གང་དུ་རྒྱུ་བའི་སྟོབས། །ཤུགས་བསྟན་རླུང་དང་ཐུན་ཕྱེད་དངོས། །སྒྲ་གཅན་ཕྱོགས་སུ་འཆར་བའི་སྟོབས། །རྩ་བའི་སྒྲ་གཅན་རྒྱུ་སྐར་ལ། །བཀོད་པ་ལྟོ་དང་ལྟ་ཕྱོགས་སྟོབས། །དེ་སོགས་གཡུལ་དང་རྒྱལ་རིགས་ཆེད། །རྒྱལ་བས་སྒྱུ་མའི་ལྟར་གསུངས་ཤིང་། །དེ་རྣམས་ལས་ནི་རྩ་བ་ཡི། །སྒྲ་གཅན་ཕྱོགས་སྟོབས་ཀྱི་མཆོག་ཏུ་བཤད། །དེས་ན་སྒྲ་གཅན་འཁྱུད་སྐར་དང་། །དེ་ཡི་སྔ་ཕྱི་གདོང་ཚུགས་སོགས། །སྐར་རྩིས་གཞུང་ལ་འདི་གཉན་པས། །བླང་དོར་མ་འཁྲུལ་ངེས་པར་གཅེས། །ཚུལ་དེས་གཟའ་ལྔའི་འཁྱུད་པ་དང་། །མཆེ་བ་གདེང་ཚུགས་མཐོང་བ་སོགས། །ཕྱོགས་ཆ་གནོད་པ་ཡོད་མེད་པ། །མཁས་པའི་གསུང་པའི་གཞུང་ལ་འཇུག །གཞན་ཡང་དབང་ཕྱུག་ཆེན་པོ་ཡི། །ལེགས་གསུང་དབྱངས་འཆར་གཞུང་ལས་ཀྱང་། །ཁྱིམ་དང་གཟའ་སོགས་སྟོབས་རྣམ་གྲངས། །དུ་མ་གསུངས་པ་ཡང་ཤེས་བྱ། །འདིར་ནི་མིང་ཙམ་ཁོ་ན་སྟེ། །རྒྱས་པར་གཞུང་དང་ངག་ལས་བླང་། །གཞན་ནི་དུས་ཚོད་མཚོན་ཆའི་སོ། །དུས་སྦྱོར་མཆོག་ཏུ་སྟོབས་ཆེ་གསུང་། །དེ་སོགས་སྟོབས་ཁྱད་སྤྱི་མིག་གསལ། །ལས་དང་བསྟུན་ཏེ་ཤེས་བྱའོ། །ད་ནི་བཅོ་བརྒྱད་དུས་སྦྱོར་གྱི། །གོ་དོན་མདོ་ཙམ་ཉིད་བཤད་ན། །རྣམ་གྲངས་གཞན་དུ་རྒྱུད་རྒྱལ་པོ། །དཔལ་ལྡན་རྡོ་རྗེ་འཕྲེང་བ་དང་། །དགོངས་པ་ལུང་སྟོན་དང་སྡོམ་འབྱུང་། །རྣམས་ནས་ནང་གི་རྣལ་འབྱོར་མཚོན། །འཕོ་བ་ཞེས་པ་བརྡའ་ཡི་བསྟན། །དེ་ཡང་འཕོ་ཆེན་ཉི་ཤུ་བཞི། །ཉིན་དང་མཚན་མོ་མཉམ་པའི་དུས། །ཉིན་མོ་བཅུ་གཉིས་མཚན་བཅུ་གཉིས། །འཕོ་ཆེན་རེ་ལ་དབུགས་ཀྱི་གྲངས། །བརྒྱ་ཕྲག་དགུ་རེ་རྒྱུ་བ་ཡིན། །དེ་ལ་འཕོ་ཆུང་བཞི་རུ་དབྱེ། །ཉིས་བརྒྱ་ཉི་ཤུ་རྩ་ལྔའི་དབུགས། །འཕོ་ཆེན་རེ་ལ་མགོན་པོ་རེ། །ཉིན་གསུམ་མཚན་གསུམ་ཉིད་དུ་འཁོར། །མགོན་པོ་བཞི་ནི་གཡས་དང་གཡོན། །མཉམ་གྱུར་རྩུབ་དང་འཇམ་པོ་སྲོག །རིམ་བཞིན་པདྨ་མགོན་པོ་དང་། །ལས་དང་རིན་ཆེན་རྡོ་རྗེ་མགོན། །འཕོ་ཆུང་ལྷ་མོ་བཞི་ཡི་རླུང་། །སྟེང་ངོས་མཁུར་ཚོས་སྣ་དབུས་མཆུ། །རྒྱུ་རིམ་གོས་དཀར་སྒྲོལ་མ་དང་། །སྤྱན་མ་བདག་མོ་ཉིད་དུ་གསུང་། །འཕོ་ཆེན་ཉེར་བཞི་འཕོ་ཆུང་ནི། །དགུ་བཅུ་དྲུག་ཏུ་དབྱེ་བ་སྟེ། །དེ་ནི་ཉིན་ཞག་ཕྲུགས་གཅིག་ཚད། །ཉི་ཁྲི་ཆིག་སྟོང་བརྒྱ་དྲུག་སྲོག །དེ་ལྟར་འདུས་སོགས་དགོངས་པ་དང་། །རྣལ་འབྱོར་གསང་མཐའི་མན་ངག་ལས། །ཡུམ་ཆེན་ཉེར་བཞིའི་རྩ་ལ་རླུང་། །འཕོ་ཆེན་ཉེར་བཞིའི་ཉིད་དང་སྦྱོར། །དེ་ཡང་འཕོ་ཆེན་རེ་རེ་ལ། །དབང་དང་ལོངས་སྤྱོད་འཇུག་པ་གསུམ། །ཅིག་ཆར་ཉིད་དུ་འཆར་བ་སྟེ། །དེ་ལྟར་འཕོ་བའི་རྣམ་གྲངས་ནི། །དུ་མ་གསུང་པ་ཤེས་སླད་དུ། །སྐབས་འདིར་ཅུང་ཟད་འཕྲོས་པ་སྟེ། །དཔལ་ལྡན་དུས་ཀྱི་འཁོར་ལོ་ལས། །ཕྱི་ནང་གཞན་གསུམ་མཉམ་སྦྱོར་ཕྱིར། །དུས་སྦྱོར་བཅུ་གཉིས་ཕྱི་རོལ་ཏུ། །མཁའ་ལ་བཅུ་གཉིས་ཁྱིམ་འཁོར་ལོ། །ཉིན་ཞག་གཅིག་ལ་འཆར་ནུབ་དབང་། །ས་ལ་དུས་ཀྱི་སྦྱོར་བར་འགྱུར། །ཁྱིམ་གྱི་གནས་ལུགས་ངེས་པ་ཡི། །ཉི་མ་གང་ལ་ངེས་པའི་ཁྱིམ། །དེས་དྲངས་ལགྣཿཞེས་དུས་སྦྱོར། །བཅུ་གཉིས་ཏཏྐཱལ་རིམ་པར་འབྱུང་། །དེ་ཡང་ལུག་འཁྲིག་སེང་སྲང་གཞུ། །བུམ་པ་མི་མཉམ་དུས་སྦྱོར་དྲུག །སྣ་བུག་གཡོན་ནས་འབབ་པའི་རླུང་། །དབུས་སྟེང་སྣ་གཤོག་རྙ་བ་འོག །རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ་བསྐྱེད་རིམ། །མཁའ་རླུང་མེ་ཆུ་ས་རིམ་པ། །དེ་ལ་འཆར་གཟའ་སྒྲ་གཅན་ཟླ། །ལྷག་པ་པ་སངས་ཀེ་རུ་ཡིན། །གླང་བལ་བུ་མོ་སྡིག་ཆུ་སྲིན། །ཉ་ནི་མཉམ་པའི་དུས་སྦྱོར་ཏེ། །སྣ་བུག་གཡས་ནས་འབབ་པའི་རླུང་། །འོག་དང་རྐ་བ་འགྲམ་སྟེང་དབུས། །རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ་བསྡུད་རིམ། །ས་ཆུ་མེ་རླུང་ནམ་མཁའི་སྟེ། །དེ་ལ་འཆར་གཟའ་སྤེན་ཕུར་བུ། །མིག་དམར་ཉི་མ་དུས་མེའོ། །གཞན་ཡང་དུས་སྦྱོར་མཚན་ཉིད་ནི། །གཡོ་དང་བརྟན་དང་མཉམ་པ་གསུམ། །ལུག་དང་ཀཪྚ་སྲང་ཆུ་ཡིན། །གཡོ་བ་བཞི་ཡིན་བརྟན་པ་ནི། །གླང་དང་སེང་གེ་སྡིག་པ་བུམ། །གཉིས་མཉམ་བཞི་ནི་འཁྲིག་བུ་མོ། །གཞུ་དང་ཉ་རུ་ཀུན་ཏུ་གྲགས། །དེ་ལྟར་ཡོངས་སུ་ཤེས་བྱས་ནས། །ཕྱི་རུ་ཉིན་མཚམ་མཉམ་པའི་དུས། །དུས་སྦྱོར་ཉིན་དྲུག་མཚན་དྲུག་སྟེ།  །དུས་སྦྱོར་རེ་ཡི་ཡུན་ཚད་ནི། །རགས་པར་དབྱུ་གུ་ལྔ་ལྔ་ཡིན། །དུས་སྦྱོར་རེ་དང་འཕོ་ཆེན་རེ། །མཉམ་སྟེ་དབུགས་སྟོང་བརྒྱད་བརྒྱར་འགྱུར། །དབྱུ་གུ་འཕོ་ཆུང་ཚད་དུ་རྫོགས། །དེས་ན་སུམ་བརྒྱ་དྲུག་ཅུར་ངེས། །ད་དུང་ཅུང་ཟད་གསལ་བཤད་ན། །མཁའ་ལ་ཁྱིམ་གང་འཆར་བའི་ཡུན། །དེ་སྲིད་དེ་ཡི་དུས་སྦྱོར་ཡིན། །ཁྱིམ་རེ་ལ་ནི་རྐང་པ་དགུ །སྐར་མ་བཞི་ལ་སྐར་མ་གཅིག །རྐང་རེ་འཆར་ཡུན་དབུགས་ཉིས་བརྒྱ། །དེས་ན་སྐར་བར་གཅིག་རྫོགས་ཡུན། །རགས་རྩིས་དབུགས་ནི་བརྒྱ་ཕྲག་བརྒྱད། །དེ་ལྟར་འཕེལ་འགྲིབ་མེད་འཆར་ཡང་། །ཉིན་མཚན་རིང་ཐུང་སྐར་འགྲོས་དབང་། །ཉིན་མཚན་རིང་པོ་ཐུར་ཐག་ཚེ། །ཆུ་ཚོད་སུམ་ཅུ་རྩ་དྲུག་ཡུན། །དེ་ལ་དུས་སྦྱོར་བདུན་དང་ནི། །དབྱུ་གུ་གཅིག་གི་ལྷག་གྱུར་ཚད། །དེ་ཡི་ལྷག་མ་དུས་སྦྱོར་ལྔ། །དབྱུག་གུ་གཅིག་གི་དམན་པ་ཉིད། །དེ་ནི་མཚན་དང་ཉིན་མོར་སྟེ། །དབྱུག་གུ་ཉེར་བཞིའི་ཡུན་ལ་དམིགས། །གང་དེ་དབྱུག་ལྔའི་དབུགས་ཚད་ཀྱི། །རྣམ་པར་བརྟག་སྟེ་བཞག་པ་ཡིན། །འོན་ཀྱང་རྒྱུད་ལས་སྲང་ཚད་སྐབས། །ཉིན་མཚན་རིང་པོའི་ཐུར་ཐག་དུས། །ལྷག་ཆད་མེད་པར་དུས་སྦྱོར་དྲུག །གསལ་བར་བཞག་ཉིད་ངེས་པར་བྱ། །ཉི་མ་སྔ་ཕྱིའི་དུས་སྦྱོར་གྱི། །ཆུ་སྲང་མང་ཉུང་འབྱུང་བ་ཡང་། །གོ་ལའི་འགྲོས་ལམ་དབང་ལས་ཏེ། །རྣམ་པ་གཞན་དུ་སེམས་མ་འཁྲུག །དེ་ལྟར་སོ་དྲུག་ཉེར་བཞིའི་དབྱུག །གངས་ཅན་བྱང་ཕྱོགས་ཚད་ལ་སྟེ། །ལྷག་མ་ཀཻ་ལ་ཤ་དབུས་དང་། །ཤམྦྷ་ལ་དང་རྒྱ་ལི་བོད། །འཕགས་པའི་ཡུལ་གྱི་དབྱུ་གུའི་ཚད། །གོང་མ་ལ་ནི་རིམ་པ་བཞིན། །ཆུ་སྲང་སུམ་ཅུ་རེ་འཕྲོགས་པས། །ཡུལ་བདུན་ཉིན་མཚན་མཐུར་རག་ཚད། །བདེར་རྟོགས་འདི་ནི་རྒྱུད་འགྲེལ་ལས། །དངོས་དང་ཤུགས་ཀྱི་བརྟན་པར་སྣང་། །དེ་ཡང་ཁྱིམ་གྱི་འཁོར་ཤུགས་ནི། །བདུན་པའི་དབུ་ཤར་བདུན་དབུ་ཐིམ། །བདུན་ཕྱེད་ཤར་ཚེ་བདུན་ཕྱེད་ནུབ། །ཤར་ནས་བདུན་རྫོགས་ནུབ་བདུན་རྫོགས། །དེ་མཐར་སྡིག་སྐར་ཁྱིམ་དྲུག་རྫོགས། །དེ་འཕྲལ་བདུན་ཤར་གོང་བཞིན་འཁོར། །དཔེར་ན་ཐ་སྐར་ནུབ་མ་ཐག །ནག་པ་ཤར་ནས་ཐོན་པ་ཡིན། །ནབས་སོ་ནམ་མཁའི་གུང་དུ་གནས། །ལྷག་རྣམས་རིག་པ་དེ་ཡིས་བརྟག །དུས་སྦྱོར་སྐར་མ་མི་མཉམ་ཡང་། །རྐང་པ་མཉམ་པས་དེ་ལྟར་ཤེས། །སྤྱིར་ཡང་ནམ་མཁའ་གོ་ལའི་གནས། །ཉེར་བདུན་ཆ་བགོས་ཆ་རེ་ལ། །དུམ་བཞིར་ཆད་པའི་དབུས་ཉིད་དུ། །རྒྱུ་སྐར་གནས་ཏེ་དཔེར་བརྗོད་ན། །ནབས་སོ་ནས་ནི་རྒྱལ་བར་གྱི། །ནམ་མཁའ་དུམ་བཞི་སྔ་མ་གཉིས། །ནབས་སོས་དབང་དེ་ཕྱི་མ་གཉིས། །རྒྱལ་དབང་རྒྱལ་ནས་སྐག་གིས་བར། །སྔ་གཉིས་རྒྱལ་སྟེ་དུམ་བཞིར་རྫོགས། །མིག་སྐར་སོགས་ཀྱང་ཚུལ་དེ་ཡིས། །བརྟག་པར་བྱ་སྟེ་རེས་འགྲོས་ཟླ། །གཟའ་ལྔ་ཀུན་ལ་ཤེས་བྱ་ཡིན། །ཕྱིས་དུས་སྐར་རྩིས་ལུགས་གཉིས་ལ། །གསར་སྦྱོར་གཏམ་འགའ་མིང་ཙམ་ཉིད། །རྗེས་བཟློས་ལས་གཞན་མི་སྤྱོད་པ། །དེ་ལ་ཡང་འདི་ལེགས་བཤད་འགྱུར། །དེང་སང་ཁ་ཅིག་འབྱུང་རྩིས་ལུགས། །ཐོ་རེངས་ནམ་ལངས་སྟག་ཡོས་སོགས། །རིམ་པར་སྦྱར་བཞིན་དུས་སྦྱོར་ཡང་། །དེ་མཐུན་བསྒྲང་བར་བྱས་མོད་ཀྱང་། །ལན་གཅིག་ཕྱོགས་མཐུན་འགྲིགས་སྲིད་རུང་། །ཀུན་ཏུ་འགྲིགས་པ་མ་ཡིན་པས། །མཁས་པས་བྱས་པའི་རེའུ་མིག་གམ། །ལྷག་པར་རི་མོས་གཏན་ཕབ་གཅེས། །ཏཏྐཱལ་རི་མོས་རྩ་བ་ནི། །ཁ་ཅིག་ཉེ་བར་གཞན་ཉིད་དག །མཛད་མོད་དེ་དག་རི་མོའི་སྐབས། །ཤེས་ཕྱིར་འདི་རུ་མ་སྤྲོས་སོ། །ཏཏྐཱལ་ཞིང་དག་ཁྱིམ་བདག་མཚུངས། །དབྱངས་འཆར་རྒྱུད་ནས་དུས་སྦྱོར་གཅིག །དེ་ཕྱེད་སུམ་ཆ་དགུ་ཆ་དང་། །བཅུ་གཉིས་སུམ་ཅུའི་ཆར་སིལ་གང་། །སྟོབས་ཀྱི་རྣམ་གྲངས་མང་གསུང་པ། །གཞུང་དེ་ཉིད་ལས་རྟོགས་ཀྱང་བྱ། །འདིར་ནི་གོ་དོན་ཡིད་ཡུལ་དུ། །བཀོད་ཐབས་ཚིག་ཉུང་དོན་གསལ་གདམས། །དུས་སྦྱོར་ཡོན་ཏན་འབུམ་ཕྲག་ཞེས། །ཐུན་མོང་གཞུང་ནས་ཤིན་ཏུ་བསྔགས། །དེ་ལྟར་ཡོངས་གྲངས་གཙོ་བོ་ནི། །ཉི་མའི་དུས་སྦྱོར་ཉིད་ཡིན་ལ། །ཞོར་བྱུང་ཟླ་བའི་དུས་སྦྱོར་གང་། །ལྷ་ཆེན་བསྟན་བཅོས་དབྱངས་འཆར་ལས། །གསུངས་པ་དེང་སང་མཁས་པ་དག །ཟླ་སྙི་ཞེས་སུ་འདོན་དེ་སྟེ། །ཟླ་བ་བཅུ་གཉིས་ཁྱིམ་དཀར་ལ། །གང་ལ་གནས་པ་དེའི་དུས་སྦྱོར། །ཐ་དད་མིང་གིས་སྟོན་པ་ཡིན། །དེ་ཡང་ཟླ་བས་ལུག་གི་ཁྱིམ། །སྐར་མ་ཐ་མ་ནང་བྲ་ཉེ། །སྨིན་དྲུག་སྐར་མ་གཅིག་ཡན་ལ། །སྤྱོད་སྐབས་ཟླ་བའི་དུས་སྦྱོར་མིང་། །སྲ་ཁ་པིའམ་བྱེས་བསྒྲོད་ཟེར། །དེས་འགྲེ་གླང་ལ་རང་ཡུལ་གནས། །འཁྲིགས་ལ་འཆི་བ་སྦལ་པར་རྒོད། །བུ་མོར་འབར་བ་སྲང་དགེ་བ། །སྡིག་པ་མི་གནང་གཞི་མི་མཐུན། །ཆུ་སྲིན་བྱེད་པ་པུ་པ་ཏ། །བུམ་པ་ལའོ་ཉ་ཁྱིམ་ནི། །འབྱོར་པ་ཞེས་སུ་གདགས་པ་སྟེ། །དེ་ལྟར་མ་ནོར་ཤེས་པར་བྱ།། མདོར་དྲིལ་ཟླ་བའི་ཁྱིམ་རེ་ལ།། རགས་རྩིས་ཞག་གཉིས་ཆ་བཅས་བགྲོད།།འདི་ལ་ཟླ་ལྷག་ཞེས་པ་ནི།།ཅུང་ཟད་འགྱུར་མ་བདེ་བར་མངོན། །དེས་ན་ཟླ་བའི་དུས་སྦྱོར་ལ། །ཟླ་བའི་རིགས་ལྡན་བརྗོད་པ་འཐད། །དེ་ལྟར་དུས་སྦྱོར་ལས་འཕྲོས་གཏམ། །ཆ་ཤས་ཙམ་ཞིག་སྨོས་པ་སྟེ། །དེས་ནི་རྣམ་གྲངས་སློབ་པའི་མདོ། །དོན་ཚན་བཅོ་བརྒྱད་བསྟན་ཟིན་ནོ། །དེ་ནས་སངས་རྒྱས་པ་རྣམས་ཀྱི། །ཐུན་མོང་མ་ཡིན་པའི་གཞུང་། །ཀུན་མཁྱེན་མགོན་པོ་མཆོག་དེ་ཡི། །རྟེན་འབྲེལ་བཅུ་གཉིས་བརྡར་མཛད་དེ། །དེ་དང་སྦྱར་བའི་རིག་པ་རྩིས། །རྒྱལ་བ་ཉིད་ཀྱི་ཡང་དག་གསུང་། །དོན་ལྡན་དོན་ཆེན་རྟེན་འབྲེལ་མིང་། །གྲངས་ཀྱི་གོ་རིམ་འདི་ལྟ་སྟེ། །མ་རིག་འདུ་བྱེད་རྣམ་པར་ཤེས། །མིང་གཟུགས་སྐྱེ་མཆེད་རེག་པ་དང་། །ཚོར་བ་སྲེད་པ་ལེན་པ་དང་། །སྲིད་པ་སྐྱེ་བ་རྒ་ཤིའོ། །འདི་ལྟར་ལུགས་འབྱུང་འཁོར་བའི་ཆོས། །ལུགས་ལས་བཟློག་པ་མྱང་འདས་རྒྱུ། །དེ་ཉིད་ཕྱི་རོལ་ཁྱིམ་ཟླ་ཞག །དུས་དེ་རྣམས་ལ་སྦྱར་བ་སྟེ། །ཁྱིམ་ཟླར་འཆར་ཚུལ་ཟླ་བའི་སྐབས། །གོང་དུ་བསྟན་བཞིན་ངེས་པར་བྱ། །འདིར་ནི་ཞག་ལ་སྤྱོད་པའི་ཚུལ། །དེ་ཡང་མཉམ་དང་མི་མཉམ་ཟླ། །ཆུ་སྲིན་ལ་སོགས་མཉམ་ཟླ་དྲུག །སུམ་སོགས་མི་མཉམ་ཟླ་བ་དྲུག །མཉམ་ལ་ཡར་ངོ་གཡོན་སྐྱེ་བ། །ལུགས་འབྱུང་སྤྲོ་བ་སྲིད་རྟེན་འབྲེལ། །མར་ངོ་གཡས་པ་འཆི་བ་སྟེ། །ལུགས་བཟློག་བསྡུད་པ་ཞི་རྟེན་འབྲེལ། །མི་མཉམ་ལ་ནི་དེ་གོ་བཟློག །མར་ངོ་གཡས་དང་ཡར་ངོ་གཡོན། །ལུགས་འབྱུང་ལུགས་བཟློག་ཚུལ་དེ་ཡི། །ཞག་རེར་རྟེན་འབྲེལ་རེ་རེ་སྟེ། །དེ་ལ་འདི་ལྟར་མཚོན་པར་བྱ། །ལོ་མཚམས་ཟླ་བའི་དཀར་ཕྱོགས་ཀྱི། །ཚེས་གཅིག་མ་རིག་གཉིས་འདུ་ཤེས། །གསུམ་ལ་རྣམ་ཤེས་བཞི་མིང་གཟུགས། །ལྔ་ལ་སྐྱེ་མཆེད་དྲུག་རེག་པ། །བདུན་པ་ཚོར་བ་བརྒྱད་སྲེད་པ། །དགུ་ལེན་བཅུ་སྲིད་བཅུ་གཅིག་ནི། །སྐྱེ་དང་བཅུ་གཉིས་རྒ་ཤིའོ། །བཅུ་གསུམ་བཅུ་བཞི་བཅོ་ལྔ་ནི། །གང་དེའི་ཚེས་གསུམ་བཞི་ལྔ་ལ། །འཆར་བའི་རྟེན་འབྲེལ་དེ་ཇི་བཞིན། །སླར་ཡང་ལྡབ་སྟེ་བཀོད་པ་སྟེ། །དེས་ན་འདིར་ནི་རྣམ་ཤེས་དང་། །མིང་གཟུགས་སྐྱེ་མཆེད་དག་ཡིན་ནོ། །སྐབས་རེ་ཡར་ངོའི་ཞག་ལྷག་སྟེ། །བཅུ་དྲུག་བྱུང་ཚེ་རེག་པ་བསྣན། །ཆད་ནས་བཅུ་བཞིར་སོང་བ་ན། །བཅོ་ལྔ་བཏོན་ཤུལ་རེག་པ་སྦྱོར། །དེ་བཞིན་འོག་མ་ཀུན་ལ་ཡང་། །རིག་པ་འདི་ཡི་འགྲོ་ཤེས་བྱ། །སྤྱིར་བཏང་རྒྱལ་ཟླའི་དམར་ཕྱོགས་ཉིད། །མར་ངོ་སྔོན་འགྲོ་མཆུ་ཟླའི་དབུ། །རྒྱུད་ནས་རྒྱལ་མཆུའི་མཚམས་གསུངས་པ། །བཅུ་དྲུག་དམར་ཕྱོགས་ཚེས་གཅིག་ངེས། །དེ་ལ་རྟེན་འབྲེལ་མ་རིག་པ། །གཉིས་ལ་རྒ་ཤི་གསུམ་སྐྱེ་བ། །བཞི་སྲིད་ལྔ་ལེན་དྲུག་སྲེད་པ། །བདུན་ཚོར་བརྒྱད་རེག་དགུ་སྐྱེ་མཆེད། །བཅུ་པ་མིང་གཟུགས་བཅུ་གཅིག་ནི། །རྣམ་ཤེས་བཅུ་གཉིས་འདུ་བྱེད་དོ། །བཅུ་གསུམ་བཅུ་བཞི་བཅོ་ལྔ་ལ། །རང་ཚེས་གསུམ་བཞི་ལྔ་བཞིན་སྟེ། །འདིར་ནི་སྐྱེ་སྲིད་ལེན་པ་རྣམས། །རིམ་པ་བཞིན་དུ་སྦྱར་བ་ཡིན། །མར་ངོ་ལྷག་ཆད་ཚེ་གོང་བཞིན། །བསྣན་ནས་འབྲིད་ལ་སྲེད་པ་སྦྱོར། །དེ་ནས་ཆུ་ཟླའི་དཀར་དམར་གྱི། །ཚེས་གཅིག་གཉིས་ཀར་འདུ་བྱེད་ཉིད། །ལྷག་མ་དམར་ཕྱོགས་ཚེས་གཉིས་ལ། །མ་རིག་གསུམ་ལ་རྒ་ཤི་ཡིན། །བཞི་སྐྱེ་ལྔ་སྲིད་དྲུག་ལེན་པ། །བདུན་སྲེད་བརྒྱད་ཚོར་དགུ་རེག་པ། །བཅུ་ལ་སྐྱེ་མཆེད་བཅུ་གཅིག་པ། །མིང་གཟུགས་བཅུ་གཉིས་རྣམ་ཤེས་འགྱུར། །བཅུ་གསུམ་བཅུ་བཞི་བཅོ་ལྔ་པར། །མ་རིག་རྒ་ཤི་སྐྱེ་བའོ། །དཀར་ཕྱོགས་ལྷག་ཆད་གྱུར་པ་ན། །བསྣན་འཕྲི་གོང་འདྲ་མ་རིག་སྦྱོར། །ནག་པོའི་ཚེས་གཉིས་རྣམ་ཤེས་ཏེ། །གསུམ་ལ་མིང་གཟུགས་བཞི་སྐྱེ་མཆེད། །ལྔ་རེག་དྲུག་ཚོར་བདུན་སྲེད་པ། །བརྒྱད་ལེན་དགུ་སྲིད་བཅུ་སྐྱེ་བ། །བཅུ་གཅིག་རྒ་ཤི་བཅུ་གཉིས་པ། །མ་རིག་པ་རུ་འགྱུར་བ་ཡིན། །བཅུ་གསུམ་བཅུ་བཞི་བཅོ་ལྔ་ནི། །མིང་གཟུགས་སྐྱེ་མཆེད་རེག་པའོ། །དམར་ཕྱོགས་ལྷག་ལམ་ཆད་པའི་ཚེ། །འདིར་ནི་ཚོར་བས་བསྣན་འཕྲི་བྱ། །དེ་ལྟར་རྒྱལ་དང་མཆུ་གཉིས་ཀྱི། །ལེགས་མཚན་ལྷག་མའི་ཟླ་བ་དག །མཉམ་མི་མཉམ་ཀུན་དཀར་དམར་གྱི། །ཚེས་གཅིག་ལ་ནི་ཟླ་བ་ཁྱིམ། །སོ་སོའི་རྟེན་འབྲེལ་གང་ཡིན་འཆར། །དེ་ནས་རིམ་ཙམ་བཅུ་གཉིས་ཀྱི། །ལྷག་པའི་ཞག་དང་ཆད་ལྷག་ཞག །རྟེན་འབྲེལ་སྦྱར་ཚུལ་གོང་དང་མཚོན། །བློ་གྲོས་ཅུང་ཟད་ལྡན་པ་ཀུན། །དེ་ཡི་	ཉིད་རྟོགས་ཀྱང་། །འོན་ཀྱང་བློ་གྲོས་གསར་བུ་བར། །ད་དུང་ཅུང་ཟད་གསལ་བཤད་ན། །སྦོ་ཟླའི་ཚེས་གཅིག་རྣམ་ཤེས་ཡིན། །ཡར་ངོ་ལུགས་འབྱུང་མར་ངོ་བཟློག །ལྷག་ཆད་དཀར་ཕྱོགས་ལ་སྲེད་པ། །དམར་ཕྱོགས་ལ་ནི་སྲིད་པ་སྦྱོར། །ནག་ཟླ་མིང་གཟུགས་ནས་དབུ་ཙམ། །དཀར་ཕྱོགས་ལུགས་བཟློག་དམར་ལུགས་འབྱུང་། །ཡར་ངོ་ལྷག་ཆད་སྐྱེ་བ་དང་། །མར་ངོ་ལྷག་ཆད་ལེན་པར་འགྱུར། །ས་ག་སྐྱེད་སྐྱེད་ལུགས་འབྱུང་བཟློག །ལྷག་ཆད་དཀར་སྲིད་དམར་རྒ་ཤི །སྣྲོན་ལ་རེག་པ་ལུགས་བཟློག་འབྱུང་། །ལྷག་ཆད་མ་རིག་དང་སྐྱེ་བ། །ཆུ་སྟོད་ཚོར་བ་ལུགས་འབྱུང་བཟློག །འཇུག་འབྱིན་རྒ་ཤི་འདུ་བྱེད་ངེས། །གྲོ་ཞུན་སྲེད་པ་ལུགས་བཟློག་འབྱུང་། །ལྷག་ཆད་རྣམ་ཤེས་དང་མ་རིག །ཁྲུམས་ཟླ་ལེན་པ་ལུགས་འབྱུང་བཟློག །ལྷག་ཆད་འདུ་བྱེད་མིང་གཟུགས་སོ། །ཐ་སྐར་སྲིད་པ་ལུགས་བཟློག་འབྱུང་། །བསྣན་དོར་སྐྱེ་མཆེད་དང་རྣམ་ཤེས། །སྨིན་དྲུག་སྐྱེ་སྟེ་ལུགས་འབྱུང་བཟློག །མིང་གཟུགས་རེག་པ་ཨཱ་ག་མ། །མགོ་ནི་རྒ་ཤིས་ལུགས་བཟློག་འབྱུང་། །བཀླག་ཐབས་ཚོར་དང་སྐྱེ་མཆེད་འགྱུར། །ཟླ་ལྷག་ཡོད་ཚེ་ཕྱི་མ་ལ། །སྔ་མ་ཇི་བཞིན་ལྡབས་ཏེ་བཀོད། །རང་ལུགས་ཟླ་བདག་འཕར་བའི་ཚེ། །ཟླ་ལྷག་འབྱུང་ངོ་གཞན་མ་འཛིན། །དཔལ་མཆོག་རྒྱུད་དང་འབྲེལ་པ་རུ། །རྟེན་འབྲེལ་ཇི་ལྟར་འཆར་བའི་ཚུལ། །རབ་ཏུ་གསལ་བ་གསུང་བཞིན་དུ། །རང་བཟོ་བཅོས་མ་མི་འོས་པས། །དེས་ན་དང་བའི་སེམས་ཁོ་ནས། །འདིར་ཡང་ཞིབ་མོར་བཤད་པ་ཡིན། །ཤིན་ཏུ་གསལ་སྤེལ་ཡི་གེ་དང་། །ཤོག་ཁྲ་གཞན་དུ་ཤེས་པར་བྱོས། །བློ་ལྡན་གཟུ་བོར་གནས་ཀུན་ཀྱང་། །འདི་ལས་གཞན་དུ་མི་ཕྱོགས་མདོ། །དེང་སང་ཁ་ཅིག་ཁྱིམ་སླེབས་ལ། །རྟེན་ནས་རྟེན་འབྲེལ་བཀོད་པ་ནི། །རེ་ཞིག་དཔྱད་པའི་གནས་སུ་བཞག །འོན་ཀྱང་གོང་ཉིད་འཁྲུལ་བ་མེད། །ཁ་ཅིག་བློ་གྲོས་གསར་བའི་གཏམ། །སྒང་ཚད་རྟེན་འབྲེལ་མཐུན་པར་བསྒྲིག །ད་ལྟ་དེ་ཡི་རྗེས་འབྲང་མང་། །བདག་ཅག་གིས་ནི་བཏང་སྙོམས་མོ། །དེ་ལྟར་རྒྱུད་དོན་ཇི་བཞིན་དུ། །ཞག་གི་རྟེན་འབྲེལ་བཤད་ཟིན་ནས། །ད་ནི་དུས་ལ་སྦྱོར་བའི་ཚུལ། །ཏཏྐཱལ་གང་ལ་བབ་པ་ཡི། །དེ་དེའི་རྟེན་འབྲེལ་འཆར་བ་སྟེ། །ཆུ་སྲིན་མ་རིག་སོགས་གོང་བཞིན། །སྤྱིར་བཏང་སྐར་རྩིས་ནས་དུས་སྦྱོར། །འབྱུང་རྩིས་ལས་ནི་དུས་ཚོད་ཞེས། །གཉན་བཞིན་དུས་ཀྱི་རྟེན་འབྲེལ་ཡང་། །ཤིན་ཏུ་རྣོ་བར་རིག་པས་རྟོགས། །གཞན་ཡང་བོད་རྙིང་ཡི་གེ་འགར། །རྟེན་འབྲེལ་ལོ་ལ་བཀོད་པ་ཡོད། །དེར་སླན་ཕྱིས་འབྱུང་ཡི་གེར་སླད། །ཅུང་ཟད་ཞུགས་པ་ཀློག་མཐོང་ནས། །མཁས་པ་ཁ་ཅིག་མི་མགུ་ཞིང་། །ཕྱོགས་དེར་འདོར་བར་མཛད་མོད་ཀྱང་། །དཔལ་མཆོག་རྒྱུད་དང་འགྲེལ་པ་ལས། །དབྱངས་དང་ན་ཚོད་དགའ་སོགས་པ། །ལོ་ཕྱོགས་ཟླ་བར་སྦྱར་བའི་མཚོན། །རྟེན་འབྲེལ་ལོ་སྦྱོར་པུ་ཡི་འགོག །དེས་ན་མ་རིག་བྱི་བའི་ལོ། །འདུ་བྱེད་གླང་དང་རྣམ་ཤེས་སྟག །མིང་གཟུགས་ཡོས་ལ་སྐྱེ་མཆེད་འབྲུག །སྦྲུལ་རེག་རྟ་ཚོར་ལུག་སྲིད་པ། །སྤྲེལ་ལེན་བྱ་ཡིས་ལོ་སྲིད་པ། །སྐྱེ་བ་རྒ་ཤི་ཁྱི་ཕག་སྟེ། །རྒྱ་ནག་ལོ་མིང་འཕགས་ཡུལ་དུ། །རྣམ་ཀུན་མེད་ཅེས་བརྗོད་མི་བྱ། །ཁ་ཅིག་གཞུང་རྙིང་ལ་གཤེ་ཞིང་། །རང་བཟོ་ངོ་བོར་འཕྱར་འདི་མཚར། །དེ་ལྟར་རྟེན་འབྲེལ་བཅུ་གཉིས་རྩིས། །ཐུན་མོང་མ་ཡིན་སངས་རྒྱས་གཞུང་། །དེ་ལ་ལྷག་པར་མོས་པ་ཡི། །ཅུང་ཟད་སྤྲོས་ཏེ་བསྟན་ཟིན་ནོ། །དེ་ནས་དེ་རྣམས་སྤྱི་ཡི་དོན། །ཕྱི་སྦྱོར་བའི་ཚུལ་ཇི་འདྲ། །ཕྱོགས་གང་ཆ་ཤས་མདོ་ཙམ་ཞིག །དོན་ལ་གཞོལ་ཕྱོར་འདིར་སྨྲ་ན། །སྤྱིར་ནི་ཐེག་པ་ཕྱོགས་ཀུན་ལས། །ཕྱི་རོལ་དེ་བཞིན་ནང་དེ་བཞིན། །ནང་བཞིན་ཕྱི་རོལ་སྣང་བ་སྟེ། །དེ་དག་དག་པ་གཞན་དུ་གསུངས། །ཁྱད་པར་དཔལ་ལྡན་དུས་འཁོར་ལོ། །འཇིག་རྟེན་ཕྱི་དང་ནང་བཅུད་ལུས། །དཀྱིལ་འཁོར་འཁོར་ལོའི་རང་བཞིན་གཞན། །གཞན་ལས་ཞིབ་པའི་ཚུལ་དུ་བསྟན། །འདི་རུ་ཉེར་མཁོའི་ཕྱོགས་མཚོན་ནི། །ཁམས་དྲུག་ལྡན་པ་རྡོ་རྗེའི་ལུས། །དབུ་མ་དག་པ་ཡེ་ཤེས་ཁམས། །རྩ་ཀུན་ལ་ནི་རྣམ་པར་ཁྱབ། །ཕྱི་རོལ་མཁའ་ཡང་དེ་བཞིན་སྟེ། །ཨ་ཝ་དྷུ་ཏི་དུང་ཅན་མ། །སྒྲ་གཅན་དུས་མེ་མ་ནིང་ཁམས། །རོ་མ་དང་ནི་རྐྱང་མ་གང་། །དཀར་དམར་ཐིག་ལེ་འཛིན་བྱེད་རྩ། །ཉི་མ་ཟླ་བ་ཐབས་ཤེས་རབ། །དེར་བརྟེན་རྩ་བའི་འཁོར་ལོ་དྲུག །འབྱུང་ལྔ་ཡེ་ཤེས་ཁམས་བཅས་དྲུག །གཙུག་ཏོར་ལ་ནི་རྩ་འདབ་བཞི། །ཐུན་མཚམས་བཞི་ཡི་རྣམ་པར་མཚོན། །དཔྲལ་བར་རྩ་ཡི་འདབ་རྩ་དྲུག །ཚེས་གྲངས་བཅོ་ལྔ་ཡེ་ཤེས་བཅས། །མགྲིན་པའི་རྩ་འདབ་སུམ་ཅུ་གཉིས། །རྒྱུ་སྐར་ཉི་ཤུ་རྩ་བརྒྱད་དང་། །ཡེ་ཤེས་ཆ་ལས་དབྱུ་གུ་བཞི། །སྙིང་ཁར་རྩ་འདབ་རྣམ་པ་བརྒྱད། །ཐུན་བརྒྱད་ཡང་ནི་གཟའ་ཆེན་བརྒྱད། །ལྟེ་བར་རྩ་འདབ་དྲུག་ཅུ་བཞི། །དབྱུ་གུ་དྲུག་ཅུ་སྟོང་པ་བཞི། །འདི་ལས་དུས་སྦྱོར་བཅུ་གཉིས་བཅས། །གསང་བའི་རྩ་འདབ་སོ་གཉིས་པར། །དཀར་དམར་བཅུ་དྲུག་ཕྱོགས་སོ་གཉིས། །ཡན་ལག་ཚིག་ཆེན་འཁོར་ལོ་གང་། །བཅུ་གཉིས་ཟླ་བ་ཉིད་དུ་མཚོན། །དེ་ལ་འདབ་མ་སུམ་ཅུ་རེ། །ཟླ་བ་རེ་ཡི་ཞག་དང་མཚུངས། །ཉིང་ལག་ཚིགས་འཁོར་དྲུག་ཅུ་སྟེ། །ཞག་གཅིག་གིས་ནི་དབྱུ་གུ་དང་། །རེ་རེར་འདབ་མ་དྲུག་ལྡན་པ། །སུམ་བརྒྱ་དྲུག་ཅུ་དབྱུ་གུའི་དབུགས། །ཕྱི་རོལ་དེ་བཞིན་ནང་དུ་སྟེ། །སྐར་རྩིས་མཐའ་དག་རྩ་ཡི་གནས། །མཆོག་ཏུ་ཐིག་ལེ་འཁོར་འདས་སྲོག །སྲིད་དང་ཞི་བ་མྱང་འདས་ཀུན། །ཀུན་རྫོབ་དང་ནི་དོན་དམ་གྱི། །བྱང་ཆུབ་སེམས་ཀྱི་འཕྲུལ་ལས་གྲུབ། །དེ་ཡང་ཀུན་རྫོབ་རྒྱུ་ཐིག་ལེ། །ཆུ་དང་མེ་ཁམས་དཀར་དམར་གྱི། །དྭངས་མ་སྤྱི་ཐིག་ཨེ་ཝམ་དང་། །ཨ་ཧཾ་ཕྱི་རོལ་ཉི་ཟླ་ཡིན། །ཕྲ་རགས་རྒྱུ་རླུང་འདུས་པའི་ཁམས། །སྒྲ་གཅན་དུས་མེ་ཐིག་ལེ་ཉིད། །རྩ་ཚོགས་ལ་ནི་ཐིག་ལེའི་ཁམས། །སྣ་ཚོགས་རྒྱུ་བ་རྒྱུ་སྐར་ཚོགས། །དཀར་དམར་འཕེལ་འགྲིབ་རོལ་པ་ལས། །ཡར་མར་ལྷོ་བྱང་ཕྱོགས་བསྒྲོད་པ། །དབྱར་དགུན་སྟོན་དཔྱིད་ཚ་གྲང་སོགས། །རྣམ་པ་དུ་མ་སྟོན་པར་བྱེད། །ཁུ་རྡུལ་རླུང་རྣམས་དབུ་མ་རུ། །ཡོངས་འཇུག་གནས་མཐུན་སྐབས་ཡོད་བཞིན། །ཁམས་དྲུག་དུས་ཚིགས་ཟླ་དྲུག་མཐར། །ཟླ་ཉི་ལ་ནི་སྒྲ་གཅན་འཇུག །མདོར་ན་སྣོད་བཅུད་ཆགས་འཇིག་དུས། །འཕེལ་འགྲིབ་བདེ་དང་སྡུག་བསྔལ་བ། །ལེགས་ཉེས་མཐའ་དག་ཐིག་ལེ་ཡིན། །བྱེད་ལས་ཉིད་དུ་རྒྱལ་བས་གསུངས། །ཁྱད་པར་དུ་ནི་རླུང་གི་ལས། །མཐའ་དག་སྟོབས་དང་ལྡན་པ་སྟེ། །རྩ་དང་ཐིག་ལེའི་བྱ་བ་ཡང་། །མ་ལས་རླུང་གི་བྱེད་པ་སྟེ། །དེས་ན་དེ་ཀུན་བདག་པོ་ཡང་། །རླུང་ཉིད་དུ་ནི་རབ་ཏུ་ངེས། །གནས་སྐབས་ཕྱི་ནང་རྒྱུ་བའི་དབུགས། །སྐར་རྩིས་ཀུན་གྱི་རྩ་བ་འགྲུབ། །གཡས་ནས་རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ། །དྲག་གཟའ་ལྔ་ཡི་རང་བཞིན་དང་། །གཡོན་ནས་རྒྱུ་བའི་དཀྱིལ་འཁོར་ལྔ། །ཞི་གཟའ་ལྔ་ཡི་རང་བཞིན་ཉིད། །རྒྱུ་བའི་དབང་གི་དེ་ལྟར་སྟེ། །སྤྱིར་ནི་སྲོག་ཐུར་ཉི་ཟླར་གསུངས། །གཟའ་རྣམས་རྒྱུ་བའི་ཁྱིམ་ཚོགས་ཀྱང་། །ལྟེ་བའི་གཡས་གཡོན་རྩ་འདབ་མ། །དྲུག་ཅུ་བཅུ་གཉིས་པདྨའི་ཚུལ། །འདབ་བཞི་ལྟེ་ལྔ་ཁྱོན་དྲུག་ཅུ། །འདབ་དང་ལྟེ་བ་ལས་འཕོ་ཆུང་། །ལྔ་སྟེ་སྡོམ་པས་འཕོ་ཆེན་གཅིག །དེ་ནི་དུས་སྦྱོར་ཅིག་སྟེ་དེ། །གཡོན་གཡས་མཉམ་དང་མི་མཉམ་པ། །སྔར་བཤད་བཞིན་ཏེ་དེ་ལས་ཁྱིམ། །ཞག་དང་ཟླ་བ་ལོ་ལ་སོགས། །ཕྱི་རོལ་དུས་ཀྱི་བྱ་བ་ཀུན། །རླུང་གི་བསྒྲོད་པ་ཉིད་ལས་གྲུབ། །སྲིད་གསུམ་སྐྱེ་འཇིག་འཁོར་འདས་ཆོས། །ཀུན་ཀྱང་རླུང་གི་མཐུ་ལས་སོ། །དེ་རྣམས་རྒྱུད་དང་འཕགས་འགྲེལ་གཞུང་། །མཁས་པས་ཇི་ལྟར་བཀྲལ་བ་བཞིན། །གོ་བདེ་ཉུང་ངུའི་ངག་གིས་ནི། །ཅུང་ཟད་ཙམ་ཞིག་སྨྲས་པའོ། །ད་དུང་འདི་རུ་འཕྲོས་པའི་གཏམ། །གདན་བཞི་དུས་འཁོར་རྒྱུད་དགོངས་བཞིན། །དམ་པའི་ཞལ་ལུང་རིམ་བརྒྱུད་པ། །སློབ་དཔོན་གསུང་ལས་འདི་སྐད་ཐོས། །སྐྱེས་བུ་དར་བབ་སྙོམས་པའི་དབུགས། །ཉིན་ཞག་གཅིག་ལ་རྒྱུ་བའི་གྲངས། །ཕྱི་རོལ་རག་རྩིས་ལོ་གཅིག་གི །ཆུ་ཚོད་ཚད་དུ་འགྱུར་བ་ཡིན། །གཡས་གཡོན་འཕོ་བས་ཡར་མར་ངོ་། །ལྷོ་བྱང་བསྒྲོད་པ་གཉིས་དག་སྟེ། །བཅུ་གཉིས་གྲངས་ཀྱི་ཁྱིམ་དང་ནི། །ཟླ་བ་དུས་སྦྱོར་དེ་གྲངས་འགྱུར། །བཅུ་གཉིས་ཐུན་རེ་དབུགས་ཀྱི་གྲངས། །ཟླ་གཅིག་ཆུ་ཚོད་སྟོང་བརྒྱད་བརྒྱ། །འཕོ་ཆུང་དབུགས་གྲངས་དབྱུག་སུམ་བརྒྱ། །དྲུག་ཅུ་ཉིན་ཞག་དྲུག་ལ་འཆར། །ཁྱད་པར་ཉི་མའི་འཁོར་ལོ་གང་། །ཟླ་བ་བཤོལ་དུ་གྲགས་གྱུར་པ། །གཟའ་ཚོགས་སྟོང་འཇུག་སླར་ངེས་སྐྱེས། །ཀུན་གྱི་རྩ་བ་ཡེ་ཤེས་རླུང་། །སྣ་ནས་རྒྱུ་བའི་དབུགས་གཅིག་ལ། །དུམ་བུ་སུམ་ཅུ་སོ་གཉིས་དབྱེ། །དེ་ཡི་ཆ་གཅིག་ཡེ་ཤེས་རླུང་། །དེ་བསགས་འཕོ་ཆུང་གཅིག་གི་མཐར། །བདེ་འབྱུང་རྐང་བཅས་ཡེ་ཤེས་རླུང་། །དེ་བཞིན་ཕྱི་རོལ་ཉིན་ཞག་དྲུག །ཡེ་ཤེས་དབུགས་ཀྱི་དབྱུག་གུའི་གྲངས། །བདེ་འབྱུང་དང་ནི་རྐང་བཅས་འབབ། །ནང་དུ་འཕོ་ཆེན་གཅིག་གི་མཐར། །ང་དྲུག་རྐང་བཅས་ཡེ་ཤེས་དབུགས། །ཕྱི་རོལ་ཟླ་བ་གཅིག་གི་ཚེ། །དབྱུག་གུ་ང་དྲུག་རྐང་བཅོ་ལྔ། །ཞག་གཅིག་མཐའ་རུ་ཡེ་ཤེས་དབུགས། །དྲུག་བརྒྱ་བདུན་ཅུ་རྩ་ལྔ་སྟེ། །ཕྱི་རོལ་ལོ་གཅིག་མཐའ་རུ་ནི། །དྲུག་བརྒྱ་དོན་ལྔ་ཡེ་ཤེས་དབྱུག །མཁའ་རོས་ཞག་དྲིལ་བདེ་འབྱུང་ཆ། །བཅས་ཏེ་ལོ་གཅིག་ཞག་བཤོལ་ཡིན། །དེ་རྒྱུན་ནང་དུ་ཞག་གསུམ་ཁོངས། །དུས་སྦྱོར་བྱེད་བཅས་སོ་གཉིས་སུ། །སྟོང་ཕྲག་བཅོ་བརྒྱད་ཡེ་ཤེས་དབུགས། །ཕྱི་རོལ་དུ་ནི་ལོ་གསུམ་ཁོངས། །ཕྱེད་བཅས་སོ་གཉིས་ཟླ་བའི་མཚམས། །ཡེ་ཤེས་དབྱུག་གུ་སྟོང་བརྒྱད་བརྒྱ། །མཁའ་རོས་དྲིལ་ནོར་ཞག་སུམ་ཅུ། །དེ་ནི་ཟླ་གཅིག་བཤོལ་དུ་གྲུབ། །དེ་རྒྱུན་ནང་དུ་ཟླ་བ་གཉིས། །ཞག་ལྔ་མཚམས་སུ་ཉིན་ཞག་གཉིས། །ཡེ་ཤེས་དབུགས་ཀྱི་ཞག་ལྷག་འགྱུར། །ཕྱི་རོལ་ལོ་གྲངས་རེ་ལྔའི་མཐར། །མཉམ་དང་མི་མཉམ་བཤོལ་ཟླ་བ། །ཉི་ཤུ་རྩ་བཞིའི་ཚད་དུ་ལོངས། །རྒྱུན་དཔེ་ལོ་བརྒྱར་ཡེ་ཤེས་དབུགས། །ལོ་གསུམ་མཆོག་གསུམ་ཚད་བཞག་གསུངས། །སློབ་དཔོན་གསུང་གི་གཅེས་པའི་ཕྱིར། །སྐབས་འདིར་དོན་ལ་འབྱོར་བས་བྲིས། །ཡང་ནི་བདག་གིས་རྣམ་རྟོག་ཏུ། །ལྟེ་བའི་བར་འདབ་རྩ་འཁོར་གང་། །བཅུ་གཉིས་ཁྱིམ་དང་དུས་སྦྱོར་བ། །རྩ་བའི་ལོ་སྐོར་ཉིད་དང་ནི། །ཕྱི་འཁོར་རྒྱུ་བའི་རྩ་དྲུག་ཅུ། །འབྱུང་དབྱེ་ལོ་རྒན་དྲུག་ཅུར་མཐུན། །དེ་བཞིན་གཙུག་ལག་འཕྲུལ་རྩིས་ལས། །ཤིང་མེ་ཆུ་ལྕགས་ཕྱོགས་རིམ་ཡང་། །དུས་འཁོར་ཤར་རླུང་ལྷོ་མེ་དང་། །བྱང་ཆུ་ནུབ་སར་གསུངས་དང་མཐུན། །དབུས་ཀྱི་ས་ཡང་དུས་འཁོར་ལས། །རི་རབ་ཉིད་སྟེ་ནམ་མཁའི་ཁམས། །དེ་ལ་སོགས་ཏེ་རྣམ་གྲངས་འགའ། །མཐུན་པར་བསྒྲིགས་སུ་རུང་མཐོང་མདོ། །འོན་ཀྱང་བསྡུས་ཏེ་འཆད་སྐབས་འདིར། །དོགས་སློང་ཙམ་ལས་རྒྱས་མ་སྤྲོས། །དེ་ལྟར་ཐུན་མོང་རིག་པའི་གནས། །སྐར་རྩིས་དག་ལ་བཞུགས་པ་དང་། །ཐུན་མོང་མ་ཡིན་གདུལ་བྱ་གང་། །མོས་པ་ཐ་དད་བཟུང་བའི་ཕྱིར། །བདག་ཅག་སྟོན་མཆོག་སངས་རྒྱས་ཀྱི། །ནང་དང་གཞན་དུ་རབ་སྦྱོར་བའི། །ཕྱི་ཡི་དུས་ཀྱི་འཁོར་ལོ་ཆེ། །ལེགས་གསུང་དེ་ལ་གཞོལ་འདོད་པ། །རྩིས་པ་གསར་བུའི་བློ་ཅན་ལ། །ཀུན་ཏུ་ཕན་པར་བྱེད་པའི་གཏམ། །སྤྱི་དོན་རྣམ་གྲངས་སློབ་པའི་མདོ། །ཅུང་ཟད་ཙམ་ཞིག་བཤད་ཟིན་ནོ། །སུ་ཞིག་སྐར་རྩིས་རི་མོ་ལ། །ཞུགས་པས་ཐོག་མཐའ་ཀུན་ཏུ་ནི། །གོ་དོན་འཁྲུལ་མེད་ངོ་སྤྲོད་གཅེས། །གཞན་ནི་རྣམ་པ་ཙམ་དུ་ཟད། །དེ་ཕྱིར་ཐོག་མར་རྣམ་གྲངས་མདོ། །བློར་ཆུད་སློབ་དཔོན་གསུང་ངག་ལས། །བརྡའ་དོན་ཚུལ་བཞིན་གོ་གྱུར་ཚེ། །དེས་ཀྱང་མཁས་ནུས་སྦྱིན་པར་བྱེད། །སུ་གང་གོ་དོན་མ་འཕྲོད་བཞིན། །ཚིག་ཙམ་ལ་ནི་སྦྱོར་འདོད་བྱེད། །ནེ་ཙོའི་བཀླག་བརྡར་ཉིད་དུ་གྱུར། །དེ་བས་དོན་ལ་རེག་པར་བྱ། །ཚིག་ཙམ་ཡང་ནི་མི་འཛིན་ཞེས། །ཀུན་རྫོབ་རྟེན་འབྲེལ་མི་བརྩི་གང་། །ཆེས་རྨོངས་ཕྱུགས་འདྲའི་སྐྱེ་བོ་ཉིད། །དེ་བས་རིག་ལམ་འདི་གུས་བྱ། །ཡིན་ལུགས་སེམས་ལ་མ་ངེས་པའི། །བྲི་སུབ་རི་མོ་ཆེར་རྐྱེན་ཡང་། །ཐལ་བར་སྲིན་པོའི་ཤུལ་རྗེས་འདྲ། །དེ་བས་དོན་ལ་མཚོན་པར་བྱ། །ཆོས་ཀུན་ཟུང་འཇུག་མ་ཤེས་པར། །ཐུན་མོང་གཙུག་ལག་སྤང་བྱེད་ནི། །རབ་རིབ་མིག་གི་གཟུགས་བརྙན་མཚུངས། །དེ་བས་རྟེན་འབྲེལ་དོན་ཤེས་བྱ། །སེམས་ཅན་ལས་སུ་མ་རྟོགས་པ། །གཟའ་སྐར་བདེ་འབྲས་ཁོ་ན་ལ། །ཞེན་པ་མུ་སྟེགས་བྱེད་པ་ཉིད། །དེ་བས་སེམས་གྱི་ལས་ཤེས་བྱ། །ནང་གི་དེ་ཉིད་མི་ཤེས་པར། །ཕྱི་རོལ་སྐར་རྩིས་མཁས་གྱུར་ཀྱང་། །གནག་རྫི་རྒད་པོའི་ཚུལ་ལ་འཇུག །དེ་བས་རྣལ་འབྱོར་ཡོངས་ཤེས་བྱ། །ཚེ་འདིའི་ཁེངས་གྲགས་ཁོ་ནའི་དབང་། །ཐུན་མོང་རིག་པར་འབེབ་པ་ནི། །ཁེ་བུན་བྱེད་པའི་ཚོགས་པ་སྟེ། །དེ་བས་ལྷག་བསམ་དག་པ་བྱ། །བཀའ་ལ་དྭངས་བ་མ་ཐོབ་པ། །ཐ་སྙད་རིག་གནས་ཆེར་འབྱོངས་ཀྱང་། །གནས་སྐབས་ཕར་རྩལ་མཁས་པ་བཞིན། །དེ་བས་ཆོས་ལ་རབ་དད་བྱ། །སངས་རྒྱས་ཐོབ་འདོད་སེམས་བསྐྱེད་ཀྱི། །མ་ཟིན་སྒོ་གསུམ་ངལ་ཀུན་ཡང་། །དོན་མེད་བྱིས་པའི་རྩེད་མོ་ཉིད། །དེ་བས་བྱང་ཆེན་རྒྱུར་བསྔོ་བྱ། །དེ་ལྟར་བཤད་ན་རིངས་ཤིག་བར། །འཛད་པར་མི་ནུས་འདིར་དེས་ཆོག །སྐབས་འདིར་དོན་ལ་སྦྱོར་བའི་སླད། །ཅུང་ཟད་ཙམ་ཞིག་སྨྲས་པ་ཡིན། །དེ་སྐད་ཚེ་རབས་ཀུན་ཏུ་དགའ་བ་སྐྱེས། །མ་རྨོངས་རིག་གནས་ཡོངས་ལ་དབང་འབྱོར་ཆེ། །རྩིས་གཞི་རྣམ་གྲངས་སློབ་མདོ་ནོར་བུའི་སྒྲོམ། །འདིར་སྤེལ་དགེ་བས་སངས་རྒྱས་ཉིད་ཐོབ་ཤོག །ཅེས་རིག་པ་རྩིས་ཀྱི་འཇུག་སྒོ་རྩིས་བྱ་སྐར་རྩིས་ཀྱི་མཚན་ཉིད་ལ་སློབ་པ་རྣམ་གྲངས་མདོ་བཤད་པའི་སྐབས་ཏེ་གསུམ་པའོ། །འདིར་སྨྲས་པ། སློབ་དང་སྲས་གྱུར་འཕགས་པའི་ས། །ཇི་བཞིན་བརྙེས་པའི་སྐྱེས་བུ་ཡང་། །ཤེས་བྱ་རིག་པའི་གནས་རྣམས་ལ། །ཡང་དག་མཁས་པར་མ་སྦྱངས་ན། །ཀུན་ཤེས་གོ་འཕང་མཐོན་པོ་གང་། །དུས་དེར་མངོན་པར་མི་ཐོབ་པས། །རིག་པའི་གནས་ལ་མཁས་བསླབ་ཞེས། །ཀུན་མཁྱེན་རྒྱལ་བ་མཆོག་གིས་གདམས། །དེས་ན་རབ་ཏུ་བརྩོན་པའི་བློ། །ལེ་ལོའི་སྐྱོན་གྱིས་མ་སླད་པར། །ཆོས་ལ་ཆོས་བཞིན་གུས་པ་ཡི། །རིག་པའི་གནས་ལ་འབད་པར་བྱ། །ཆོས་བཞིན་དད་པ་མ་ཐོབ་པར། །ཐུན་མོང་རིག་གནས་ཆེར་སྦྱང་ཡང་། །མུ་སྟེགས་བྱེད་ཀྱི་མཁས་པ་བཞིན། །ཐར་ལ་འཇུག་པར་མི་ནུས་ཀྱི། །གང་ཞིག་རྫོགས་པའི་སངས་རྒྱས་ལ། །ལྡོག་མེད་ཡིད་ཆེས་དད་པ་བརྟེན། །དེ་ཡི་བཀའ་ལ་རབ་དང་བའི། །དམ་ཆོས་བསྲུང་བའི་ལྷག་བསམ་ཅན། །གང་གི་སྤྱོད་པ་མཐའ་དག་ཀྱང་། །ཐབས་མཁས་དགེ་བའི་རྒྱུར་གསུང་ན། །ཐུན་མོང་རིག་གནས་བྱ་བ་ཀུན། །ཐར་འཇུག་ཆོས་སྤྱོད་བཟང་པོ་མཆོག །དེ་ལྟར་ཁོང་དུ་ཆུད་པ་ཡི། །རིག་པའི་གནས་ལ་གཞོལ་བར་བྱ། །གཞན་ནི་ཕ་རོལ་ཕྱིན་ཐེག་པ། །སངས་རྒྱས་འབྲས་བུ་རིང་ཞེས་སྨོད། །དེས་ན་ཐུན་མོང་རིག་པ་ཀུན། །དེ་བས་ཡང་ནི་ཅིས་མི་སྨོད། །ཡང་དག་འབྲས་བུ་མྱུར་འདོད་པས། །དོན་སྒོམ་ཉིད་ལ་འབད་པར་འོས། །ངེས་དོན་རྟོགས་པའི་རིག་གནས་ལ། །སྤྱོད་ཀྱང་རྟེན་འབྲེལ་རྒྱན་དུ་མཛེས། །དེ་མ་རྟོགས་པའི་གང་ཟག་གི །རིག་པའི་གནས་ཀྱང་སྤང་ཆ་མིན། །ནང་གི་ཡང་དག་འཇོག་པ་ལ། །རྩེ་གཅིག་དག་ཀྱང་གཞོལ་མིན་ཅིང་། །རིག་པའི་གནས་ཀྱང་མི་སློབ་པ། །དེ་ནི་དལ་འབྱོར་ཆུད་ཟོས་འགྱུར། །དེ་ཕྱིར་རིག་གནས་རྩིས་ཀྱི་སྒོར། །འཇུག་པ་དང་པོའི་བློ་ཅན་རྣམས། །མཁས་མཛད་གཞུང་རྒྱས་ཚིག་བརླིང་ཞིང་། །དོན་མང་འཐོར་ཐབས་བལྟ་བས་ངལ། །འགའ་ཞིག་ཉུང་ཆེས་དོན་མ་ཚང་། །ཁ་ཅིག་གྲོང་རྩིས་མ་དག་གཏམ། །དེ་ཡི་རྩིས་པ་གསར་བུ་ལ། །ཕན་པ་དགའ་བ་ཉིད་གྱུར་ཅིང་། །དེས་ན་རྣམ་གྲངས་སློབ་པའི་མདོ། །སྤྱི་ཆིངས་སྔོན་འགྲོ་གོ་དོན་གཞུང་། །ཁྱེར་བདེ་གཞན་ནས་མཛད་པ་ཞིག །མ་མཐོང་བས་ན་དུས་འདི་རུ། །བདག་གི་བློ་གྲོས་བཟང་པོ་ཡི། །མཁས་པའི་གསུང་ལས་ལེགས་བཏུས་ཏེ། །ཚིག་ཉུང་དོན་མང་རྣམ་དག་ཉིད། །གཞན་ལ་ཕན་པ་ཁོ་ན་ཡི། །ལྷག་བསམ་ཨུཏྤལ་སྟོན་ཟླ་ལྟར། །གཅིག་ཏུ་དཀར་བས་བཀོད་པ་འདི། །རྩིས་མཁན་རྣམས་ལ་ཆེས་གྲགས་བཞིན། །རྩིས་ལ་གཞུག་པ་གསར་བུ་རྣམས། །ཡིད་མི་འཁྲུག་པ་ངལ་གསོའི་སྟེགས། །སྔོན་མེད་ལེགས་བཤད་སྤེལ་ལེགས་པ། །ཚེས་གཅིག་ངག་གི་དབུལ་སེལ་གཏམས། །རང་དབང་འཛད་མེད་རིན་ཆེན་རྒྱན། །ཕུན་ཚོགས་ལེགས་བཤད་ནོར་བུའི་གཏེར། །དོན་གཉེར་རྣམས་ལ་སྐྱེས་བུ་སྦྱིན། །འདི་ལྟར་ཕྱིན་ཆད་བྱུང་བ་ན། །འདི་ཡི་མཐུ་རུ་ཤེས་པར་གྱིས། །དེ་སྐད་བསྐལ་བཟང་ཚེ་རིང་ལྷ་ཡི་བྱ། །མཁས་དབང་གསེར་རིར་ཅུང་ཟད་བསྙེན་པས་ཀྱང་། །དོན་ལྡན་རིག་གནས་ནོར་བུའི་སྒྲོ་གཤོགས་བརྟས། །འདི་ཀོ་བློ་ལྡན་འདུན་པར་མཛེས་གར་སྤེལ། །འདི་བགྱི་དགེ་མཐུ་མཁའ་མཉམ་སེམས་ཅན་ལ། །ཀུན་ཏུ་ཕན་པ་ཀུན་ཏུ་བཟང་པོ་མཆོག །དཔལ་ལྡན་འཇམ་དཔལ་དཔའ་བོའི་གོ་འཕང་གང་། །རིང་མིན་མྱུར་བ་ཉིད་དུ་རེག་གྱུར་ཅིག །དེ་ལྟར་རིག་པ་རྩིས་ལ་འཇུག་པའི་སྒོ་སྔོན་དུ་འགྲོ་བ་རབ་ཏུ་བྱེད་པ་རི་མོའི་གནད་གྲངས་ཀྱི་གནས་སྐར་རྩིས་ཀྱི་མཚན་ཉིད་དེ་སྤྱི་དོན་རིམ་པ་གསུམ་དུ་བྱས་པ་ལེ་ཚན་འདི་ཉིད་རབ་བྱུང་བཅུ་གཉིས་པའི་མཐའ་རྔ་ཆེན་ཆུ་ཁྱིའི་ལོར་སྐབས་གཉིས་པ་ཡན་ཡི་གེར་བཀོད་པ་བྱས་ཀྱང་བར་སྐབས་ལེ་ལོར་གྱུར་པའི་འཕྲོ་སྐབས་གསུམ་པ་ཉིད་སླར་ཤིང་གླང་གི་ཆུ་སྟོད་ཟླ་བའི་དམར་ཕྱོགས་ཀྱི་ཚེས་བཅུ་འོད་ཟེར་བདུན་པ་དང་བི་རྫི་ལྷན་ཅིག་ཏུ་སྤྱོད་པའི་འགྲུབ་སྦྱོར་བཟང་པོའི་སྔ་ཐུན་སྐབས་སུ་གྲུབ་པར་ཤར་ཕྱོགས་ཀོང་ཡུལ་ལྗོན་པ་ཀླུང་བསམ་གཏན་སྤྱིལ་བུར་རྣལ་འབྱོར་པ་ཚེ་དབང་ནོར་བུས་ལེགས་པར་སྦྱར་བའོ། །དགེའོ། །དགེའོ། །དགེའོ། །བཀྲ་ཤིས་དཔལ་འབར་འཛམ་གླིང་རྒྱན་དུ་ཤོག །",
    "ContentChinese": "<p class=\"chinese-text\"><p class="poem-block">嗡娑帝 那瑪 室利 薩曼達 巴札嘎喇 匝札雅<br>卷一：基礎圖算入門品<br>一、開篇禮讚<br>遍智善巧濟群生，甘露源處寂怙主，<br>具德上師佛陀前，虔誠信心稽首禮。<br>二、著述緣起<br>少壯之士志弘遠，數理明晰通算學，<br>欲入此門求究竟，此乃至寶眾所需。<br>初習圖法諸要訣，秘傳悉數不隱匿，<br>淺顯直述易解文，讀之即可增智慧。<br>三、文字總說<br>首論確立諸要義，音聲言詞符號等，<br>文字形貌所呈現，實乃佛陀勝事業。<br>歷久浩瀚難計數，當知不可思議然，<br>此土娑婆閻浮提，域區各處語言異。<br>四、書寫規則<br>天竺尼泊爾藏地，字符相連成行列，<br>縱橫相接為定制，別論外餘通常然。<br>文字體制盡如是，書讀之法皆相符，<br>首端起自左方始，終至右側而行進。<br>五、數字書寫法<br>今為近要所論義，算師圖法諸通則，<br>數符轉化為算號，九數一點共成十。<br>文字符號任便用，大抵相合而無異，<br>算法如是而運行，繪圖之時作記號。<br>異於尋常字體法，下起上行為書寫，<br>何故一十百千等，自末向上而數之，<br>算號書寫從下起，抑或自右而為之。<br>然讀之時同常例，自上而下如是時，<br>多數上起為其例，如二萬千六百言。<br>六、數學符號運用<br>左右分位為其法，下標轉數書於末，<br>百數之末兩點現，千數之末三點成。<br>萬數四點十萬五，四分轉數各有分，<br>此理推廣復生他，分轉無誤為其要。<br>七、分數記法<br>半標橫線為記號，三分三角四分方，<br>如是繪之諸賢言，除分合併法示之。<br>除法得數有誤差，合併多無誤差現，<br>除法零散當匯總，合併示現剩餘力。<br>八、除法运算规则<br>餘者理則皆相同，平除自得所得數，<br>宣除下數為依據，過多下數不能得。<br>過少下數重得餘，此等過失當遠離，<br>是故多寡得其中，除數未定上數者。<br>九、進位法則<br>十數上溢九數盈，上行百位自然成，<br>十位千臨點現處，八數依舊一位明。<br>百有八數為常法，千萬億兆循此程，<br>智者當以理通達，更有妙理細推尋。<br>十、循環计算法<br>除數被除若相等，各自周轉得圓成，<br>被除倘若多於數，所得之數為周程。<br>若無餘數盡除盡，或因不足未得成，<br>當知其數未圓滿，此理常用記心中。<br>十一、分數计算法<br>更有玄機當細究，被除之數若為真，<br>二分所得之商數，恰是被除一半真。<br>三四五分亦如是，所得之數各有因，<br>若遇零散當會合，數理玄機細察真。<br>十二、时空度量衡换算<br>時與方位物度量，精粗大小有次第，<br>自下向上層層增，由上向下次第分。<br>且說一日分六十，時辰復分六十刻，<br>一刻又分六息間，展轉細分難窮盡。<br>十三、長度换算<br>由旬分作八由延，由延五百弓為度，<br>一弓四肘度分明，一肘二十四指量。<br>七分次第細推尋，蟣虱毫末微塵量，<br>象羊兔塵次第行，水鐵微塵至極微。<br>十四、总结<br>此中所述諸法門，文義精確記心中，<br>算理入門基礎法，萬勿輕忽需用功。<br>雖是初階基礎法，實為入門要徑途，<br>功小利大不可廢，至為珍貴密要符。<br>十五、謙辭迴向<br>智者久習本無待，此文何用徒費言，<br>然為初學諸學人，輔助記憶除疑惑。<br>如是天路耀明星，淨善願言化玉珠，<br>願以此福證菩提，利濟有情無窮盡。<br>是為《時輪數理入門基礎明鏡善說論》第一品：基礎圖算入門品竟。<br><br>卷二：數量類別與術語品<br>第一章 乘法總說<br>一、九因歌<br>今說算數諸理法，基數次位與別名，<br>且述其中要義端，首論九數乘法歌：<br>九一即九本自然，九二得數十八全，<br>九三二十七為度，九四三十六方圓。<br>九五四十五當知，九六五十四分明，<br>九七六十三無差，九八七十二為程。<br>九九八十一告成，此為九數乘法竟。<br>二、八因歌<br>八一為八本自然，八二十六理自彰，<br>八三二十四為數，八四三十二方量。<br>八五四十無有差，八六四十八堪詳，<br>八七五十六分曉，八八六十四圓當。<br>三、七因歌<br>七一為七本如是，七二十四無別理，<br>七三二十一為數，七四二十八可知。<br>七五三十五分明，七六四十二應知，<br>七七四十九圓滿，算盡七數歸於真。<br>四、六因歌<br>六一為六理自明，六二十二無別增，<br>六三十八數已定，六四二十四方成。<br>六五三十無有差，六六三十六圓清。<br>五、五因歌<br>五一為五本自然，五二得十無偏差，<br>五三十五理可明，五四二十數方圓，<br>五五二十五為度，此為五數乘法盡。<br>六、餘數乘法<br>四一為四四二八，四三十二四四寺，<br>三一為三三二六，三三為九二二四，<br>一一唯一無他增，圓滿得數點為記。<br>如是九數諸乘法，口熟心記最為要，<br>若欲圖式清淨成，未修遽教徒勞然。<br>第二章 大數位次<br>一、基本大數<br>諸佛所契算師知，三藏所詮大數名：<br>一十百千萬億兆，京垓已上更相增。<br>大數冠以月名者，億億兆兆重重增，<br>二十一位大數名，遞增十倍無窮盡。<br>二、佛經大數<br>大方廣經所宣說，世尊童年算術時，<br>展現算數不思議，一一大數具體名。<br>始從億兆至無盡，七十一位為其量，<br>十倍遞增無有窮，唯佛能知餘莫測。<br>第三章 數字異名<br>一、基本數名<br>自性本質與形貌，月兔同表其為一，<br>方位眼足表為二，時火所燒表為三。<br>四海明論表為四，箭與帝王表為五，<br>時光與味表為六，聖者星宿表為七。<br>龍蛇財寶表為八，九曰星宿與空竅，<br>十方不易表為十，十一諸神與猛獸。<br>十二宮垣日所行，十三醉心與欲念，<br>十四意根與人王，十五月德與時節。<br>十六君王十八過，二十四聖二十七，<br>星宿運轉三十二，齒德圓滿盡無餘。<br>二、異譯辨析<br>梵語億兆諸異名，翻譯差異須明辨，<br>洛叉俱胝諸梵文，譯者各異理可通。<br>藏地古譯有異名，察之源自梵語異，<br>此中已說諸要義，餘者當於本書尋。<br>第四章 結語<br>算數名相雖繁多，約定俗成無定因，<br>智者善解此道理，不執名相得其真。<br>長生天路耀明星，淨善願言化玉珠，<br>願以此福證菩提，利濟有情無窮盡。<br>是為《時輪算數入門》第二品：數量類別與術語品竟。<br><br>卷三：論時數曆算<br>第一章 總論時數<br>今論曆算諸要門，所推所算基本因：<br>年月時節與宮位，呼吸權衡百刻分。<br>七曜日數諸宿度，相會對照力時輪，<br>因緣內外皆相應，略述大要示其真。<br>第二章 年號命名<br>一、年號總說<br>日行十二宮位圓，月有晦朔二十四，<br>四時寒暑春與秋，周而復始號為年。<br>梵語稱謂有四義：計數所數往來轉，<br>無死藏論善演說，如是年號各分明。<br>二、六十年號<br>聖土外教諸算家，日輪周天為紀年，<br>勝樂註疏所宣說，六十年號列於前：<br>最勝最明白淨年，醉生主宰火耀年，<br>德容盛壯青春歲，持主自在豐實天。<br>柔順降伏群牛歲，雜色日光解脫年，<br>地主無盡調御歲，普持勇主變化年。<br>驢歡勝者勝利歲，勝者醉象醜面年，<br>金垂天垂轉易歲，普具躍動善作年。<br>妙作忿怒珍寶歲，威伏獼猴斧鉞年，<br>寂靜共違違逆歲，攝持放逸歡喜年。<br>羅剎阿那赤黃歲，時使圓成名譽年，<br>智難鼓音赤行歲，欲主忿怒窮盡天。<br>三、十二生肖<br>摩訶支那典籍中，雄雌配偶十二辰：<br>鼠牛虎兔龍蛇走，馬羊猴雞狗豬循。<br>五行相乘六十歲，次第輪轉古今遵。<br>四、五行與年號<br>大漢五行諸符號，揭己公庚戊為名，<br>木火土金水次第，如同梵音韻母聲。<br>漢土文字諸韻律，盡依此理作規程，<br>首始木鼠為元始，終於水豬六十成。<br>第三章 月號命名<br>一、月份總論<br>黑白二月各分時，十五日數兩周圓，<br>梵語稱月薩摩娑，別有異名今當宣。<br>漢土以鬼時節終，大月胡韃諸部用，<br>藏地論典諸大義，天竺通用吠陀經。<br>日月宮位與星宿，勝者密續諸經中，<br>因緣名數諸差別，凡此八類各分明。<br>二、十二月名<br>黑月始自羊宮起，諸曜常行此為先，<br>是故曆算月之首，始自黑月此理全。<br>蛇月夏初第一月，胡月三春中時分，<br>聖土黑月羊宮位，密續名相群牛月。<br>馬月盛夏第二時，胡曆四月春末分，<br>聖土四月雙宮位，密續根身龜蛇月。<br>羊月夏末第三時，胡曆五月夏初分，<br>昴宿之月天蠍宮，因緣觸入水獸月。<br>大猴秋初第一月，胡曆六月仲夏分，<br>尾宿之月射手宮，所觸水獺之月名。<br>雞月秋中第二時，胡曆七月夏末分，<br>量宿之月獅子宮，渴愛麝香月亦然。<br>狗月秋末第三時，胡曆八月秋初分，<br>大月處女星宮中，有支月亦名龍象。<br>豬月冬初第一月，胡曆九月仲秋分，<br>秤宿天秤之宮中，後有飛行之月焉。<br>鼠月冬中第二時，胡曆十月秋末分，<br>尾月天蠍之宮位，生命夢幻之月名。<br>牛月冬末第三時，胡曆十一冬初時，<br>角月人馬之宮中，老死地主月亦然。<br>虎月春初第一月，胡曆十二仲冬分，<br>星月摩羯之宮中，因緣無明月增長。<br>兔月春中第二時，胡曆正月冬末分，<br>軫月寶瓶之宮中，行為月名癡暗時。<br>龍月春末第三時，胡曆二月春初分，<br>昂宿雙魚之宮中，識月亦名為善月。<br>三、其他月名<br>如是月名諸類別，編列易解今略明，<br>漢語月名諸古德，稱作越歷舊傳承。<br>漢地曆書記月數，一月至於十二月，<br>親月二月參月四，五月六月七月八，<br>九月十月十一月，十二月名次第全。<br>第四章 時分論述<br>一、大時分<br>總論時分諸層次，成住壞空四大分，<br>圓滿三滿二滿世，鬥諍末世次第循。<br>壽命福德富貴時，佛法住世四時分，<br>持明王朝四時節，時數年月皆具陳。<br>二、小時分<br>九曜一餘定生起，同入宮位盡行時，<br>空入之名分四際，後代智者立此規。<br>附論時算諸典籍，彈指六十四分微，<br>極微剎那更細分，百二十分成剎那。<br>三、日分論<br>六十剎那為一息，三十須臾成一時，<br>三十晝夜成一月，十二月圓歲已週。<br>又如獅子請問經，紡織匠師紡一縷，<br>長短適中線一條，此為最短剎那時。<br>百二十分成剎那，六十剎那為一息，<br>三十息為一須臾，三十須臾成一日。<br>四、其他時分<br>又有眨眼二為度，四度難成十六分，<br>一時辰也如是增，須臾時分皆相應。<br>晝分十五依日影，夜分依於更點燈，<br>名相各異有別稱，諸說不同今具陳。<br>五、總結<br>無死藏論及別說，眨眼十八為一度，<br>三十分之三十時，剎那十二成須臾。<br>須臾三十成一日，十五日來成一祭，<br>二祭一月三月時，六月周天歲已終。<br>第五章 時分結要<br>時分名相如上述，一歲時分諸要門，<br>吉祥無上佛密續，時輪所攝世間品。<br>諸經論中說六時，或五或四或二三，<br>醫方八支與律藏，涅槃經中具宣說。<br>第六章 醫方時節<br>一、季節劃分<br>醫經律典諸經論，尼薩耆經與戒論，<br>日藏金光涅槃經，漢地譯本所宣說：<br>冬春夏秋四時分，各具三月為定制。<br>二、其他分法<br>律華經中並阿毗，春夏冬季三時分，<br>孟仲季節攝其中，諸佛以冬為首位。<br>餘者皆從四時行，黑月為始春季起，<br>四時年首雖不同，春初配以寅卯辰。<br>漢土至今仍奉行，孟春建寅為歲首，<br>觀音化現藏王時，年首定在二月中。<br>三、密續之說<br>總攝時輪四怛特，金剛空行海潮教，<br>同顯因緣月之始，二月無疑為年首。<br>世間眼目古智者，以寅為春立定規，<br>通說春初等梵音，譯師順應藏地語。<br>第七章 二分論<br>一、南北二分<br>日行南北二分野，印度東方諸國土，<br>此道亦可為年期，此時冬月為年首。<br>無死獅子藏中說：摩竭月時為元始，<br>吠陀論師亦主張，冬月為始不應誤。<br>二、節氣定時<br>雖因地域有差異，本土中央依日轉，<br>諸賢依經驗推算，各有不同今略說。<br>昔日先賢所傳承，吾師智者世眼言：<br>星次二月始現時，人馬宮中夜分長。<br>六月星現夏至時，北極盡處秋分至，<br>再加南極冬至臨，春分後逢夏至至。<br>三、日月會合<br>日行南北轉運時，月亦隨之而運行，<br>分至日月同一道，此理應當善觀察。<br>細詳安布諸分位，如我考察所得知，<br>依從文字與口傳，今為略說其大要。<br>第八章 分至節氣<br>一、二分節氣<br>分時升起諸星宿，善知七曜運行度，<br>日出日沒中分時，即為分至之時節。<br>春分時節善盈星，現於天球北極處，<br>秋分仙人星現時，天球南極方位見。<br>二、仙人星象<br>仙人升起七旬間，除病八德時運轉，<br>或說七日為定期，此說迷誤應善辨。<br>恆星中等光度者，色帶微黃可辨識，<br>此說源自聖者言，遍智上師所宣說。<br>第九章 星宿宮位<br>一、宮位度數<br>每宿四分各有度，一分十五時辰行，<br>九分度數成一宮，如是運轉有次第：<br>羊宮始自昴宿起，畢星初分為界限，<br>牛宮畢宿三分半，參星二分為疆域。<br>胃宿終盡觜星圓，井宿三分為蟹界，<br>巨鬼柳星皆癸宮，軫星一分獅子分。<br>處女翼星張宿滿，氐房心尾為天秤，<br>天蠍尾箕牛宮盡，斗牛為人馬宮度。<br>摩羯女虛危室分，瓶宿奎壁參為界，<br>雙魚昂星觜參度，如是十二宮周天。<br>二、宮位總數<br>如是宮位總和數，一千六百二十度，<br>此為天體運行域，眾星遊行此道中。<br>三、梵語宮名<br>梵語宮名今略述：彌沙名羊佛利沙，<br>彌徒那為雙子宮，羯羯吒為蟹行度。<br>僧訶獅子犍尼耶，處女都拉為天秤，<br>毗栗支迦蠍宮是，檀努名為人馬宮。<br>摩伽羅為摩羯位，宮陶名瓶彌那魚，<br>總名羅濕謂宮垣，如是梵名應記持。<br>第十章 七曜生宿<br>一、諸曜生處<br>七曜生處今略說：羅睺生於天秤初，<br>計都生於雙魚末，日生巨蟹四分始。<br>或說生於房宿中，依經無誤應受持，<br>故知血月生天秤，昴宿夜分等分時。<br>二、五星生處<br>獅宮朱宿火星生，天蠍二足水星起，<br>處女畢宿木星現，雙宿日月羅計臨。<br>水瓶彗星現其中，牛宮熒惑來降世，<br>如是七曜生宮位，依於時輪教理明。<br>三、宮位主宰<br>羊蠍火星為主宰，牛秤金星掌其權，<br>雙女水星為統領，蟹月獅日各司分。<br>人馬雙魚木星主，摩羯瓶宮土德臨，<br>隨宮現起諸星象，主客相爭成吉凶。<br>第十一章 氣息時分<br>一、氣息根本<br>年月日時諸運轉，根本即是命氣息，<br>善惡業力為其因，壽量長短由此定。<br>人身氣息有三等：長短中等各不同，<br>壯年無病正常人，一呼一吸為根本。<br>二、氣息換算<br>一息分作二萬數，一千六百為其量，<br>此為微細蟣虱息，故知人息攝微細。<br>一日之中三萬息，餓鬼一息人月周，<br>人間一時為天息，是故人年天一日。<br>人間一日成一息，阿修羅界如是知，<br>故知人間十二年，修羅一日無差別。<br>能力氣息人間歲，等同一年無增減，<br>二萬一千六百年，勝者一息如是說。<br>三、四禪天界<br>此中能力與勝者，色界極頂無色頂，<br>皆為補特伽羅名，世間怙主如是言。<br>然而三十一有中，所說壽量與氣息，<br>此處所說不相符，為引外道故隨順。<br>四、氣息根本<br>如是已說諸支分，今當宣說其精要：<br>贍部人間眾生息，實為時算之根本。<br>一日之中氣息數，二萬一千六百行，<br>水滴時分諸細分，皆從此中而生起。<br>第十二章 水滴時分<br>一、時分總說<br>佛陀金剛持如來，無上密意續部中，<br>歡喜金剛經典說：時分三十二水滴，<br>六十四分刻度成，三昧耶生續亦云：<br>十六時分三十二，水滴六十四分明。<br>二、時分細分<br>金剛空行續中說：六度眨眼為一分，<br>六分積聚成剎那，三十須臾成一時，<br>十倍千一再二十，水滴一量如是定。<br>六十水滴成一時，百時即為一大時，<br>八大時分成一日，水器量度今當說。<br>三、水器度量<br>銅器十二兩所成，器高八指寬十二，<br>精工鑄造成圓器，黃金三十沙數重。<br>六指長度為其度，針孔精鑿於器底，<br>清水無濁六十兩，此為時分準確量。<br>四、漢土計時<br>大唐計時九十六，每刻三十八水量，<br>折合氣息二百廿，晝夜平分四十八。<br>他如獅子請問經，諸經論典雖不同，<br>用語略異義相同，此依時輪最為顯。<br>第十三章 日分計算<br>一、基本原理<br>自他平等一氣息，六度圓轉至流盡，<br>五滴三十氣息行，百八十息三十滴。<br>六十水滴一時轉，總計三百六十息，<br>為一時辰之長度，時輪六十周天度。<br>二、換算關係<br>三千六百水滴量，二萬一千六百息，<br>晝夜等分無增減，是謂時分之根本。<br>餘者地分與節氣，一切依此而建立，<br>有智之人善推算，細部觀察當了知。<br>第十四章 晝夜節氣<br>一、諸家說法<br>智者有立四分位，水滴一分細分明：<br>空天時分三剎那，建立四分無差異。<br>或有分作三六位，時分以上無錯謬，<br>大體相同無異議，細部差別應詳察。<br>二、晝夜類別<br>次說晝夜之性相，宮日太陽月晝夜，<br>廣說三日差別時，此處且述其梗概。<br>一年之中立三日，各有不同分位別：<br>宮日三百六十日，太陽三百六十五，<br>月日三百七十一，長短次第如是知。<br>三、日月運行<br>宮日太陽晝夜中，日行星宿一周天，<br>合於四足度量分，前足東方後足南。<br>半圓之後前足西，後足北方而運行，<br>月行二十七日中，星宿周天四足行。<br>第十五章 曆法推算<br>一、朔望交會<br>十四分度定位時，月度均分得其數，<br>前足七分居東方，後足七分居南方。<br>若數不均前足西，後足北方定其位，<br>日月運行如五星，雖無逆行停留相。<br>閏月順逆皆相應，智者所言當善解。<br>二、時算根本<br>總論時算諸根本，太陽為主影為證，<br>長短極致與等分，一處出沒諸方域。<br>現量可見差別故，欲力時分定其準，<br>足度性相影長短，未得算師徒有名。<br>此理當善思維之，莫執表相為根本。<br>三、三日差別<br>宮日太陽月晝夜，長短差距各不同，<br>未滿一月依日行，日數為主而建立。<br>月滿之後依月行，雖未滿三十日時，<br>月從望至望月間，三十日滿月圓周。<br>是故律論諸師徒，粗算每年去六日，<br>細推五日餘分位，每分四十八刻度。<br>第十六章 總結<br>一、曆法根本<br>年滿之時日月中，宮日為主而建立，<br>何故宮日未圓滿，年歲不得成辦耶？<br>一年三百六十日，世間共許此為準，<br>星算圖式諸要門，三日差別所生故。<br>二、諸星週期<br>月十五日日六日，水三金九木十二，<br>土三十土十五年，羅睺九年為一周。<br>日月合計半月三，加三分之人年百，<br>日數二千月一周，十二月年復百年。<br>三、大期推算<br>人年四十萬二萬，二位下數十除餘，<br>上數積聚所得數，二十一萬六萬年。<br>此為主息一千八，一息千二百年期，<br>大轉一周五分商，此為爭鬥劫時量。<br>商數二三四乘積，二全三全圓滿量，<br>年滿諸數究竟時，眾星入於空位中。<br>復起定數重新生，世間勝智如是說。<br>眾星各有日數期，每依本身圓輪時。<br>半日以分晝夜度，權為初學導明知。<br>細論經法有明示，日依宮位月行遲。<br>羅睺計算以月日，五星行度依晝時。<br>日月歲數總推算，準確易解不差違。<br>十一輪星七值次，更有其餘名數奇。<br>日名蘇羅與羅毗，光形晝主千光持。<br>光蔽施火所生者，銀精七馬稱名時。<br>月名旃陀與初母，宿主星王藏寶期。<br>星曜輪環三方處，東方明點蓮友知。<br>火星名為曼嘎拉，赤體地生天子期。<br>肋光九焰與邪曲，吉祥稱號備周知。<br>水星名為布達那，月子髻生與一體。<br>金寶滿意生王子，歡喜稱號亦相宜。<br>木星巨辯明天師，躍動師長清淨期。<br>粗重光明智者主，言語主者施命時。<br>金星名為勝天師，無天上師惡斷持。<br>施主精液工詩者，十六光明百詞師。<br>土星閃耀名緩行，七光日子行遲遲。<br>梵生不盡眼閻幡，息滅和平時見之。<br>十五辨明遷不遷，輪圓十一位中存。<br>遷宿七者為分列，名號巴胡婆末搬。<br>句來龐亢及其餘，歌黑嘉木吉哈章。<br>巴尼章與毗瑟持，梵語藏音分別知。<br>播種馬首族性行，芝麻舍生本分明。<br>毗瑟跡尾皆稱謂，數符其一播種標。<br>二為馬首三族性，四五布尼六親生。<br>七圖毗瑟所計時，半月各分晝夜移。<br>白黑初一之後半，播種二前馬首期。<br>二後族性三之前，芝麻後半家生知。<br>四五布尼四後分，毗瑟運行時節宜。<br>如是五日月半分，黑分十四後分期。<br>十五前後白分初，四位不遷常定時。<br>梵語商句及其他，娑陀察睹與那伽。<br>金蘇格日尼稱謂，藏語楔子四足龍。<br>不悅依次分別明，黑分十四後分時。<br>十五前後白分初，一日前分常時現。<br>毗瑟金剛運時期，同分故為嚴肅期。<br>如是星曜宿度分，相合時宜辨作期。<br>梵音次第稱其名，伽羅日提與那叉。<br>瑜伽稱為迦羅那，五支聲名普傳知。<br>五聚亦為名稱宜，其中別有如是義。<br>今時推算時宜中，星數下標竹籤時。<br>起數盛名圖數宜，晨起至午為現在。<br>享用盡時月亦遷，此理分明可觀察。<br>虛空輪中前享分，減去現今正享時。<br>現今過去合其時，享用限量皆周全。<br>盡此無間即刻時，後分時享始起期。<br>如是時中月現行，生起諸類現時眾。<br>月中運行決定合，然而時節運行中。<br>諸類月中不宜合，彼為依日眾決定。<br>是故定於彼日時，今時如此諸說者。<br>月中相合非如理，譬如右手皮膚中。<br>左肉骨節非相合，雖似源流各別開。<br>不須合為決定一，是故各別教法中。<br>不錯修行正知行，作曆時享往昔中。<br>如算多年少有愆，此中如法增竹籤。<br>如是作曆日數中，多分有故應減除。<br>星宿復有月宿分，日宿清淨月宿中。<br>日夜竹籤海王分，日數一日享用時。<br>此中淨分諸星分，享用所減依次合。<br>然彼日數一日量，水時四時絲二一。<br>五息三時分為量，月輪度中正安住。<br>月環羅睺入境觀，依次月中星宿分。<br>當即觀察為上首，諸星相合二十八。<br>成相焚燒死相合，雙合吉祥相應喜。<br>日合增喜日喜日，怖日粗日非合日。<br>永斷盡勝甘露等，月宿享用處中現。<br>日之星宿時合分，四時分位悉周圓。<br>月星四數日光中，牙面觀察了知分。<br>五星計都與羅睺，出沒行向入位樣。<br>日之所行星宿中，觀察成就唯一義。<br>韻起所說輪類分，大分復依此為準。<br>是故時算一切中，月日星宿普知行。<br>如是月中星宿分，竹絲氣息分數量。<br>享用圖數過去許，餘分現在正受用。<br>明察星宿享用故，虛空輪中助分餘。<br>現今現前星辰一，享用月數時量是。<br>月環粗相現前執，細相徹底過去知。<br>相合清淨享用分，出沒過去現在時。<br>時量明察觀察法，依隨星宿享用儀。<br>然而相合法日中，水時二時絲四三。<br>五息三時分十九，受用勝師如是說。<br>總攝因緣眾聚時，名為相合合宜之。<br>雖含眾義詞多端，此處且論算術期。<br>十七力別今當辨，值日星宿二事持。<br>自在論中如是說，值宿力勝眾皆知。<br>持明諸者知其理，月值具一功德門。<br>四曜星宿八德備，時合功德億萬存。<br>今人算法尊日值，然知曜宿力最尊。<br>時合作用分二品，毗瑟羅睺特難分。<br>五支綱要辨力別，金剛羅睺日月陳。<br>曜象運時皆有次，力用大小細推循。<br>密教別門分方位，瑜伽祕法應時輪。<br>風力半時成變化，羅睺出沒布方門。<br>尊主所住星宮處，方向羅列極分明。<br>戰陣王族諸儀軌，如幻佛說妙難評。<br>根本最勝羅睺者，方位力用顯殊型。<br>所值星辰須細察，前後相對仔細聽。<br>二十四遷分晝夜，每遷氣息九百行。<br>小遷分作四分位，二百二十五氣量。<br>大遷各主司其職，晝夜三時轉不妨。<br>四主粗細分左右，蓮花金剛業寶揚。<br>四風天女分方向，上面頰鼻唇中流。<br>白衣度母並眼母，自在天母運行周。<br>大遷二十四時節，小遷九六細推求。<br>一日一夜成量數，二萬一千六百收。<br>密意瑜伽深妙處，二十四脈應相承。<br>自在受用並趣入，三時一起現分明。<br>為顯內外同合理，十二時輪轉匆匆。<br>虛空宮闕環相繞，日出日沒運行中。<br>三十六竿二十四，雪山北境定其程。<br>迦拉仙境與中土，香巴拉與漢藏城。<br>聖境竿度各不同，上下相次有差評。<br>水量三十互相奪，七地晝夜定長征。<br>論中明示此道理，顯密二義共相成。<br>宮宿運轉之道理，七位東升七位沉。<br>七半東昇七半落，東盡西沒相銜存。<br>毒宿宮位皆圓滿，七升如前復循輪。<br>如彼莎訖剛沒處，那嘎立即自東生。<br>納索高懸天際上，餘星由此細推行。<br>時合星宿雖不等，步分齊等此中明。<br>總攝虛空輪道理，二十七分細分清。<br>四分一中星宿住，試舉納索例中程。<br>四分虛空前二分，納索所轄定分明。<br>後二分屬王星轄，王星至竿細推評。<br>前二屬王分四盡，餘星皆應此理行。<br>值日五星依此轍，兩種星算古今存。<br>新舊諸說多名相，沿襲之外不須陳。<br>今有依從元算者，曉色虎兔列其循。<br>次第配合諸時位，一合或中終未真。<br>須從智者圖譜取，算理推求定法真。<br>答迦圖數根本處，或近或遠各自陳。<br>答迦淨域同宅主，梵音流出一時輪。<br>半分三九十二數，三十分位細區分。<br>諸力眾多經所說，當依本論細尋真。<br>此處略述明理趣，文簡義顯示其因。<br>時合功德億萬種，共通經論極稱珍。<br>總攝數中為最勝，日之時合第一循。<br>兼及月之時合者，大天論中音起經。<br>今時智者稱月密，十二宮白各有名。<br>住於何宮成時合，異名標示體各呈。<br>羊宮末至兔星內，行時月合眾名生。<br>十二月輪序次行，餘缺之日諸相生，<br>因緣和合法如是，智者觀之自通明。<br>然為初學示微言，正月初一識為先，<br>上弦順行下逆轉，盈虧明暗互相連。<br>黑月名色自為始，白分逆行赤順行，<br>上弦增長如流轉，下弦取受成輪迴。<br>四月生生順逆行，白赤因緣老死明，<br>五月觸法逆順轉，無明生死兩相生。<br>六月感受順逆行，老死行蘊定中明，<br>七月渴愛逆順轉，識與無明互相生。<br>八月取受順逆行，諸行名色成定形，<br>九月有支逆順轉，增處與識互相應。<br>十月生生順逆行，名色觸法互相生，<br>十一復逢老死轉，感受增處兩相成。<br>若遇閏月依前法，重疊排布理分明，<br>己宗月主增盈日，閏現無他當審聽。<br>吉祥續部如理說，因緣次第顯明然，<br>不敢臆造違經義，淨信為懷解此篇。<br>更詳文字他方尋，智者平心自可明，<br>今人或執宮次第，因緣配合且存疑。<br>雖有新智創所言，依準星算諧律文，<br>隨順時人多從此，吾等置之存中庸。<br>如是經義已宣明，日輪因緣說已終，<br>今當更論時分法，隨順因緣轉法輪。<br>水瓶無明依次轉，總攝三界諸因緣，<br>星算推時依歲行，陰陽五行運四天。<br>智者觀察知其妙，因緣時序互相連，<br>古卷或有年中說，後人傳寫或增添。<br>賢哲或有不許者，以為違背本經文，<br>然觀吉祥續經意，音韻年歲皆相通。<br>是故鼠年為無明，牛虎行識次第行，<br>兔為名色龍增處，蛇觸馬受羊渴求。<br>猴取雞有狗生死，豬與因緣次第通，<br>漢地年名雖有異，印土義理實相同。<br>或有譏毀古經者，妄造新義實可嗤，<br>如是十二因緣法，佛說無上甚深義。<br>信心淨妙為人說，略陳梗概今已終，<br>從此更論總義門，外相因緣妙理同。<br>諸乘皆說此道理，外內相應本相同，<br>外如於內內如外，清淨義趣別處明。<br>特於時輪最尊勝，外器內情皆具陳，<br>輪壇法相妙無比，細密過於諸教門。<br>今當略說其要義，六大所成金剛身，<br>中脈本淨智慧界，遍及一切脈輪門。<br>外空亦復如是住，中脈明月遍虛空，<br>羅睺時火中性界，日月二脈左右通。<br>白紅明點所依止，日月方便智慧融，<br>依此根本六輪現，五大智慧具圓通。<br>頂輪四瓣表四際，額輪十六表時分，<br>喉輪三十二葉滿，星宿二八智四增。<br>心輪八葉表八時，或表八曜運行真，<br>臍輪六十四瓣具，空點六十四時輪。<br>此中十二時分現，密輪三十二葉圓，<br>紅白十六方三十，支分大節具周全。<br>十二月輪各自具，三十瓣葉應時天，<br>支分大節六旬數，一日氣數六百全。<br>三百六十氣輪足，內外相應妙理圓，<br>星算一切依脈住，至妙明點轉法筵。<br>生死涅槃諸法界，世出世間無不全，<br>世俗勝義菩提性，一切從此明點現。<br>世俗因緣明點者，水火二大紅白圓，<br>精華總攝成明點，金剛薩埵妙理詮。<br>日月光明外相現，細密因緣風大全，<br>羅睺時火明點性，遍滿一切脈輪間。<br>種種星宿從此運，紅白增減妙用圓，<br>南北往來依此轉，寒暑四序此中現。<br>精氣風息入中脈，契合因緣時至圓，<br>六界時節六月後，日月相合羅睺現。<br>總攝器界成壞時，增減苦樂善惡全，<br>一切皆從明點起，佛說作用最為先。<br>特論風力最殊勝，一切功能具此間，<br>脈與明點諸作用，無不依於風力全。<br>故知此等諸法主，唯風最勝實可宣，<br>暫時內外諸氣息，星算根本從此詮。<br>右行五輪五曜義，剛宿五曜性相連，<br>左行五輪五曜義，柔宿五曜互相牽。<br>雖依運行如是說，總攝命氣日月圓，<br>星宿所行宮度者，臍輪左右瓣葉全。<br>六十二十蓮華相，四瓣五輪六十圓，<br>葉與輪心流注小，總攝成就大流圓。<br>是即一時如是轉，左右相等不等間，<br>如前所說從此起，日月年歲次第圓。<br>外在時分諸作用，風力運行悉圓全，<br>三界生滅諸法界，一切不離風力全。<br>如是經續聖釋中，智者所解妙理圓，<br>今以淺近言辭說，略陳梗概示其端。<br>更有旁出諸言論，四續時輪經義全，<br>承襲師訓相傳授，從師所聞如是言。<br>壯年平和氣息數，一日所行妙理圓，<br>外算一年時數等，左右流注表盈虧。<br>南北二道從此轉，十二宮度月輪齊，<br>十二時中氣息數，一月時數千八百。<br>小流氣數三百六，六旬日數應時機，<br>特論日輪周天數，閏月所以從此知。<br>諸曜空入復定生，根本智風妙理宜，<br>鼻中所行一息中，分為三十二分時。<br>其中一分智風起，積此小流一盡時，<br>吉祥足數智風現，外現六日應其時。<br>智風氣數相應足，吉祥兼足數相宜，<br>內現小周一終後，五十六足智風時。<br>外現一月時分中，五十六足十五依，<br>一日究竟智風數，六百七十五相宜。<br>外現一年究竟時，六百七十五智輪，<br>虛空所攝日積數，一年閏日從此知。<br>如是相續內三日，時輪兼足三十二，<br>智風氣數千八百，外現三年時節知。<br>半足三十二月間，智風氣數千八百，<br>虛空所攝三十日，一月閏數從此知。<br>相續內現二月間，五日之中二日全，<br>智風氣數成餘數，外現四十五年圓。<br>等與不等閏月數，二十四數量方圓，<br>百年智風流注說，三年最勝量可詮。<br>師承妙訣珍如此，今因契理故書傳，<br>復次我思臍輪中，十二宮度時輪全。<br>本命年輪正相應，外輪流注六十圓，<br>五行老年六十數，相合無差妙理圓。<br>如是算法相應處，東風南火次第全，<br>北水西土依時輪，諸方次第正相連。<br>中央地位時輪說，須彌正是虛空天，<br>如是種種諸名數，相合可得妙理圓。<br>然於略說此時中，且舉少分未敢宣，<br>如是共通智慧處，星算具有諸理全。<br>不共所化諸根器，各有不同信樂緣，<br>我等大師佛世尊，內外和合妙道詮。<br>外在時輪最殊勝，善說法門甚可怜，<br>志求此法新學者，利益一切眾生圓。<br>總持名數略教門，少分略說今已宣，<br>若人入於星算法，始終皆當識其源。<br>義理無差最為要，餘者不過相而已，<br>是故最初總持門，善解師承言教旨。<br>文義如理能通達，自然智慧得開啟，<br>若人不解實義理，但依文字作標記。<br>鸚鵡學語終無益，是故當求實理知，<br>若謂文字亦不取，不信因緣最愚癡。<br>是故當於智道中，恭敬修學莫暫離，<br>未解實理妄下筆，徒如鬼跡空無依。<br>諸法圓融未了知，捨棄共通諸學智，<br>翳眼所見諸色像，是故因緣當證知。<br>眾生業力未了悟，專執星曜善惡時，<br>即是外道所行法，是故心業當證知。<br>內道實理未了知，外算雖精徒勞爾，<br>不異牧牛老翁輩，是故瑜伽當證知。<br>唯求現世名利故，共通智慧作生涯，<br>即是商賈營利眾，是故淨願當發時。<br>於佛教法未信解，世間學問雖精通，<br>不過暫時諸伎能，是故正信當生時。<br>未發無上菩提願，三業雖勤徒勞爾，<br>不異童稚戲論事，是故迴向菩提時。<br>若欲詳說諸義理，窮劫難盡且略陳，<br>為令契理略宣說，少分義理今已終。<br>如是一切諸生中，常生歡喜智慧明，<br>諸智自在無障礙，算數總持妙寶林。<br>此中所集諸善業，回向無上菩提門，<br>願證佛果度眾生，利樂無盡等虛空。<br>是為《時輪算數入門》第三品：星算性相總持略說品竟。<br>於此偈曰：<br>所有學人與佛子，如實證得聖者地，<br>若於明處未精通，遍智高位難成就。<br>是故佛陀大導師，勸勉當習諸明處，<br>故應精進無懈怠，如理恭敬修智業。<br>未得如法真淨信，縱習世間諸明處，<br>猶如外道諸智者，終難趣入解脫門。<br>若於圓覺佛世尊，生起不退真信心，<br>敬奉佛言生淨信，護持正法勝意樂。<br>一切所行諸事業，善巧方便皆成因，<br>世間明處諸事業，解脫勝行最殊勝。<br>如是深解其義趣，當入明處修學門，<br>或有譏毀波羅蜜，謂此果德路遙遠。<br>是故世間諸明處，何不更受彼訶斥，<br>若欲速證勝果者，當勤修習實義門。<br>通達勝義諸明處，因緣莊嚴亦相宜，<br>未達此理諸有情，明處亦非當棄捨。<br>專修內觀妙理時，一意專修不學明，<br>如是虛耗暇滿身，是故入此算門者。<br>初觀智者廣論議，文深義廣疲難究，<br>或有太略義未圓，或是俗算非正論。<br>為利新學諸算者，故造總持略教門，<br>總綱前行義理論，簡要未見他處有。<br>是故我以智慧力，集諸智者妙言教，<br>文簡義豐最清淨，利他意樂同秋蓮。<br>一切算師所共知，為諸初學作依止，<br>遠離擾亂息心處，開創善說前未有。<br>初始語藏除貧寶，自在無盡珍寶嚴，<br>圓滿善說如意藏，饋贈求法諸賢士。<br>此後若有諸生成，悉依此力當了知。<br>如是賢劫長壽鳥，雖僅少依智者山，<br>已得明處寶翼成，妙舞智者座前展。<br>願以此善根力故，等空有情普蒙益，<br>文殊勇士最勝位，不久速疾願圓成。<br>此《入算明論》前行簡擇，圖象數理星算性相總義三品，第二品止，著於十二勝生末年水狗歲。因中懈怠，第三品復於木牛歲箕宿月下弦第十日，日光七耀與畢宿同度，吉祥和合之晨時，於東方貢域松林靜處，瑜伽士才旺諾布善為敘述。善哉！善哉！善哉！願吉祥光嚴閻浮提！</p></p>",
    "status": "published",
    "meta": { "words": "N/A", "pages": "N/A", "readTime": "N/A", "preview": "N/A" },
     "availableLanguages": ["bo", "zh", "en"],
    "createdAt": "2023-05-21T11:00:00Z",
    "updatedAt": "2023-05-21T11:00:00Z"
  }
]